import 'package:flutter/cupertino.dart';
import 'package:learn_to_cook/Cake/c_Food.dart';

class cFoods extends ChangeNotifier{
  List<cFood> _items=[
   cFood(
      id: 'p1',
      title: 'বেরিস কেক',
      description: 'ভ্য্যনিলা বিন গ্রীক য়োগার্ট - বেরিস কেক'
          '\nউপাদানগুলি::-- ৪-৫ জন'
      '\n১ কাপ ময়দা'
      '\n১ চা চামচ বেকিং পাউডার'
     '\n ১/৪ চা চামচ বেকিং সোডা'
   '\n১/৮ চা চামচ নুন'
   '\n১/৪ কাপ আনসল্টেড বাটার'
   '\n১/২ কাপ পাউডার চিনি'
   '\n১/৪ কাপ ভ্যানিলা বিন গ্রীক য়োগার্ট'
   '\n১/৪ কাপ ফুল ক্রিম দুধ'
   '\n৩-৪টি ছোট টুকরো করে নেওয়া স্ট্রবেরি'
   '\n১/৪ কাপ ব্লুবেরি'
          '\n\n\nধাপগুলি::--'
          '\n# উপকরণ গুছিয়ে নিতে হবে।'
          '\n# ওভেন ৩৫০ ডিগ্রী ফারেনহাইট তাপমাত্রায় প্রি হিট করে নিতে হবে।'
          '\n# বেকিং প্যান মাখন দিয়ে গ্রিস করে নিতে হবে।'
          '\n# একটি মিক্সিং বোলে ময়দা চেলে নিয়ে দিতে হবে। তার সঙ্গে বেকিং পাউডার, বেকিং সোডা এবং নুন মিশিয়ে নিতে হবে॥'
          '\n# আরেকটি পাত্রে মাখন এবং চিনি ভালোভাবে বিট করে নিতে হবে।'
          '\n# অন্য একটি পাত্রে দুধ, য়োগার্ট হুইস্ক করে নিতে হবে।'
          '\n# কিছুটা ময়দার মিশ্রণ মাখন, চিনির মিশ্রণের সঙ্গে মিশিয়ে হুইস্ক করে নিতে হবে। এবার কিছুটা দুধ,'
          ' য়োগার্ট মিশ্রণ মিশিয়ে হুইস্ক করে নিতে হবে। এই পদ্ধতির আরেকবার পুনরাবৃত্তি করতে হবে।'
          '\n# মিশ্রণটি বেকিং প্যানে ঢেলে কেটে রাখা স্ট্রবেরি এবং ব্লুবেরি উপর থেকে ছড়িয়ে দিতে হবে।'
          '\n# এবার ওভেনে ৩০-৩৫ মিনিট ৩৫০ ডিগ্রী ফারেনহাইট তাপমাত্রায় বেক করতে হবে।'
          '\n# নির্দিষ্ট সময় পর একটা টুথপিক ঢুকিয়ে দেখে নিতে হবে মসৃণভাবে বার করা যাচ্ছে কিনা নইলে সময় বাড়াতে হবে।'
          '\n# তৈরী হয়ে গেল ভ্যানিলা বিন গ্রীক য়োগার্ট বেরিস কেক। ঠান্ডা করে পরিবেশন করুন।',
      imageUrl: 'assets/cakeimages/baris_cake.webp',

    ),
    cFood(
      id: 'p2',
      title: 'জন্মদিনের কেক',
      description: 'জন্মদিনের প্লেইন কেক বানানোর রেসিপি:-'
          '\nউপাদানের নাম:'
          '\nময়দা-২ কাপ নিতে হবে'
          '\nডিমের সাদা অংশ-৪টি ডিমের সাদা অংশ নিতে হবে'
          '\nডিমের কুসুম-৪টি ডিমের কুসুম নিতে হবে'
          '\nচিনি-৭ চা চামচ লাগবে'
          '\nবেকিং সোডা	হাফ চা চামচ নিতে হবে'
          '\nবেকিং পাউডার	এক চা চামচ'
          '\nবাটার	২০০ গ্রাম নিতে হবে'
          '\nভেনিলা এসেন্স	এক চা চামচ নিতে হবে'
          '\nগুড়া দুধ	মাত্র ৩ চা চামচ'
          '\n\n\nজন্মদিনের কেক বানানোর নিয়ম:'
          '\n# কেক বানানোর জন্য প্রথমেই ডিমের সাদা অংশ আলাদা করে নিয়ে ফেটাতে হবে! এজন্য একটি বিটার দিয়ে বিট করে ফোমের মতো বানিয়ে নেয়া যেতে পারে। '
          'ভালো করে বিট করার পরে; এর সাথে একটি করে ডিমের কুসুম দিতে হবে এবং বিট করতে হবে।'
          '\n# মনে রাখতে হবে, ভালো ভাবে ফেটানোই হলো কেক বানানোর গোপন কৌশল ! এরপরে, চিনি, ভেনিলা এবং বাটার মিশিয়ে আবার বিট করে নিতে হবে। খেয়াল রাখতে হবে;'
          ' যেনো বাটার ভালো করে গলে ও মিশে যায়।'
          '\n# এখন, আলাদা একটি পাত্রে, ময়দা, বেকিং পাউডার, বেকিং সোডা ও গুড়া দুধ ঢেলে হাত দিয়ে ভালো করে মিশিয়ে নিয়ে; একটি ময়দা চালনা চালুনি দিয়ে চেলে নিতে হবে!'
          ' এরপরে, ফেটিয়ে রাখা বাটার ও ডিমের সাথে মিশিয়ে বেটার বানাতে হবে। এই বেটার দিয়েই কেক বানাতে হবে! '
          'সুতরাং লক্ষ্য রাখতে হবে যেনো বেটার বা মিশ্রণ বেশি তরল কিংবা বেশি ঘন হয়ে না যায়।'
          '\n# এখন চুলায় কেক বানানোর জন্য একটি ভারি ও মোটা অ্যালুমিনিয়ামের পাত্র বা সসপ্যান নিতে হবে। এটা আগেই চুলায় দিয়ে গরম করে নিয়ে রাখতে হবে!'
          ' পরে গোল আকৃতির কেক মোল্ড এ গ্রিস কাগজের মধ্যে বাটার মাখিয়ে তাতে কেক বানানোর বেটার বা তরল মিশ্রণ সমান ভাবে ঢেলে দিতে হবে!!'
          ' যদি মোল্ড করা সম্ভব না হয়, তবে একটি রাইচ কুকারের বাটি ব্যবহার করতে হবে! রাইচ কুকারের মতো বাটিতে কাগজ দিয়ে, '
          'তার মধ্যে বেটার ঢেলে, মুখ বন্ধ করে; চুলায় দিয়ে রাখা মোটা সসপ্যানে; (সসপ্যন না থাকলে কড়াই ব্যবহার করা যেতে পারে) বেটারের পাত্র বসিয়ে দিতে হবে।'
          '\n# এই পদ্ধতিতে কেক প্রায় ১ ঘন্টা অল্প তাপে রান্না করতে হবে! কেকের বেটার ঢালা পাত্র অন্য আরেকটি মোটা পাত্রের উপর দেয়ার প্রধান কারণ হলো; '
          'সরাসরি একটি পাত্রে কেক বানাতে গেলে পুড়ে যাওয়ার সম্ভাবণা রয়েছে! একটি কাঠি কেকের মধ্যে ঢুকিয়ে দেখতে হবে যে কেক হয়েছে কিনা! '
          'যদি কাঠি পুরিষ্কার হয়ে বের হয়; তখন বুঝতে হবে যে কেক হয়ে গেছে। আর যদি কাঠির সাথে বেটার বা কেকের উপদান লেগে থাকতে দেখা যায়;'
          ' তখন বুঝতে হবে যে কেক এখনো পুরোপুরি হয়নি।'
          '\n# যাদের বাড়িতে গ্যাস ওভেনে বা মাইক্রোওয়েভ আছে, তারাও চুলায় না দিয়ে ওভেনে করে কেক বানাতে পারবেন! যাইহোক, কেক বানানো হলে, তা বের '
          'করে তা ১ ঘন্টা রেখে দিয়ে ঠান্ডা করে নিতে হবে! জন্মদিনের বা বার্থডে কেকের উপর ক্রিম দিতে হয়। সুতরাং আমরা এখন জন্মদিনের কেকের জন্য ক্রিম '
          'বানানোর সহজ রেসিপি জেনে নিব।'
          '\n\n\nজন্মদিনের কেক এর ক্রিম বানানোর রেসিপি: উপকরণঃ'
          '\nবাটার নিতে হবে ৪০০ গ্রাম'
         '\n৫০ গ্রাম আইসিং সুগার নিতে হবে'
         '\nকনডেন্সড মিল্ক নিতে হবে হাফ টিন'
        '\n ঘন দুধ নিতে হবে ১ কাপ'
         '\nভেনিলা এসেন্স নিতে হবে হাফ চা চামচ'
         '\nখাওয়ার রং নিতে হবে সামান্য পরিমান'
          '\n\n\nক্রিম বানানোর নিয়ম:'
          '\nপ্রথমেই বাটার গলিয়ে মিহি করে নিতে হবে! বাটার গলিয়ে নিয়ে তাতে আইসিং সুগার, ঘন দুধ, '
          'কনডেন্স মিল্ক ও ভেনিলা দিয়ে ভালো করে বিটার দিয়ে বিট করতে হবে। এরপরে; তা অন্য একটি পাত্রে নিয়ে ইচ্ছে মত ফুড কালা দেয়া যেতে পরে! '
          'এভাবে ক্রিম বানিয়ে নিয়ে জন্মদিনের কেক সাজাতে হবে।',
      imageUrl: 'assets/cakeimages/birthday_cake.jpg',

    ),
    cFood(
      id: 'p3',
      title: 'ব্লাক ফরেস্ট কেক',
      description: 'উপাদানগুলি::--'
          '\n(৫-৬ জন):--'
 '\n ১ কাপ ময়দা'
  '\n১/৪ কাপ কোকো পাউডার'
 '\n ১ কাপ চিনি'
  '\n১/৪ কাপ তেল'
  '\n৩ টা ডিম'
  '\n১টে চামচ বেকিং পাউডার'
  '\n১/২ চা.চা ইন্সট্যান্ট কফি'
  '\n১ চা চামচ ভ্যনিলা এসেন্স'
  '\n১ চা চামচ লবণ'
  '\n১ +১/২ কাপ (৩৫০ গ্রাম) হুইপ ক্রিম+৪ টেবিল চামচ আইসিং সুগার'
  '\n১০০ গ্রাম ডার্ক চকলেট'
  '\nসুগার সিরাপের জন্য (২টেবিল চামচ চিনি+১/৪ কাপ পানি +১ টা চেরি)'
          '\n\n\nধাপগুলি::-'
          '\n# ডিমের সাদা অংশটা আলাদা করে, ফোম তৈরি করে কুসুম টা মিশিয়ে নিবো।(ডিম সাভাবিক তাপমাত্রার) চিনি, ভ্যনিলা এসেন্স তেল মিশিয়ে নিবো ।'
          '\n# এবার অল্প অল্প করে ৩ বারে শুকনো উপকরন মিশিয়ে নিবো।'
          '\n# কেকের পাএটিতে একটা কাগজ একটু তেল দিয়ে সেট করে নিবো।'
          '\n# প্রেশার কুকারের মধ্যে ১কাপ পরিমান বালি /লবণ দিয়ে তার উপরে ১ টা স্টেন বসিয়ে দিবো। এবার কেকের পাএটি এর উপরে বসিয়ে দিবো এবং '
          'প্রেশার কুকারের ঢাকনা লাগিয়ে দিবো।(সেফটি বালভ খুলে নিবো). ৩০ মিনিট পর নামিয়ে ঠান্ডা করে নিবো।'
          '\n# ক্রিম ও সুগার সিরাপটাও বানিয়ে নিবো। এবার কেক টাকে ৩ লেয়ারে কেটে নিবো, প্রথম লেয়ারের উপর সুগার সিরাপ দিয়ে ক্রিম দিবো,'
          ' দিতীয় লেয়ার দিয়ে আবার সুগার সিরাপ দিয়ে ক্রিম দিবো।'
          ' এবার উপরের পার্টটা বসিয়ে সুগার সিরাপ দিয়ে ক্রিম দিয়ে চারপাশ ডেকে নিবো.১৫ মিনিটের জন্য ফ্রিজে রেখে দিব।'
          '\nফ্রিজ থেকে নামিয়ে, কেকের চারপাশে ও মাঝখানে গ্রেট করা ডার্ক চকলেট দিয়ে নিবো। স্টার নজেল দিয়ে কেকের উপরে ফুল বসিয়ে '
          'তার মাঝখানে চেরি বসিয়ে দিয়েছি, কেকটা খেতে ইয়াম্মি হয়েছে..',
      imageUrl: 'assets/cakeimages/black_forest_cake.webp',

    ),
    cFood(
      id: 'p4',
      title: 'চকলেট কেক',
      description: 'উপাদানগুলি::--'
          '\n৪-৫ জন'
  '\n১ কাপ ময়দা'
  '\n২/৩ টেবিল চামচ কোকো পাউডার'
  '\n১টে চামচ বেকিং পাউডার'
  '\n১ চা চামচ ভ্যনিলা এসেন্স'
  '\n১/২ চা চামচ লবণ'
  '\n৩ টা ডিম'
  '\n১/২ কাপ চিনি'
  '\n১/৪ কাপ তেল'
  '\n(১/২ কাপ চকলেট+১/২ কাপ ক্রিম) গানাশ'
  '\n(১ কাপ লিকুইড হুইপড ক্রিম+আইসিং সুগার ৩/ ৪ টে চামচ) হুইপড ক্রিম'
 '\n (২টেবিল চামচ চিনি+৩টেবিল চামচ পানি+ চকলেট) সুগার সিরাপের জন্য'
          '\n\n\nধাপগুলি::--'
          '\n# প্রথমে কেকের পাএটিতে একটা কাগজ একটু তেল দিয়ে সেট করে নিবো। শুকনো উপকরন চেলে নিবো।'
          '\n# ডিমের সাদা অংশটা আলাদা করে ফোম তৈরি করে কুসুম টা মিশিয়ে নিবো।(ডিম সাভাবিক তাপমাত্রার) চিনি, '
          'ভ্যনিলা এসেন্স তেল মিশিয়ে নিবো ।এবার অল্প অল্প করে ৩ বারে শুকনো উপকরন মিশিয়ে নিবো।'
          '\n# প্রেশার কুকারের মধ্যে ১কাপ পরিমান বালি /লবণ দিয়ে তার উপরে ১ টা স্টেন বসিয়ে দিবো। এবার কেকের পাএটি এর উপরে '
          'বসিয়ে দিবো এবং প্রেশার কুকারের ঢাকনা লাগিয়ে দিবো।(সেফটি বালভ খুলে নিবো). ৩০ মিনিট পর নামিয়ে ঠান্ডা করে নিবো'
          '\n# ক্রিম,গানাশ,ও সুগার সিরাপটা রেডি করে নিবো। সুগার সিরাপটাও বানিয়ে নিবো। এবার কেক টাকে ৩ লেয়ারে কেটে নিবো, প্রথম লেয়ারের উপর '
          'সুগার সিরাপ দিয়ে ক্রিম দিবো, দিতীয় লেয়ার দিয়ে আবার সুগার সিরাপ দিয়ে ক্রিম দিবো। এবার উপরের পার্টটা বসিয়ে সুগার সিরাপ দিয়ে ক্রিম দিয়ে'
          ' চারপাশ ডেকে নিবো, উপরে চকলেট গানাশ টা দিয়ে ইচ্ছে মতো সাজিয়ে পরিবেশন করুন দারুন মঝার চকলেট কেক।',
      imageUrl: 'assets/cakeimages/coklet-cake.webp',

    ),
    cFood(
      id: 'p5',
      title: 'কাপ কেক',
      description: 'উপাদানগুলি::--'
          '\n( 2-3জন)'
      '\n১/২ কাপ ময়দা'
    '\n২ টা ডিম'
   '\n ১/৪ কাপ চিনি'
   ' \n২ টেবিল চামচ তেল'
   ' \n২ টেবিল চামচ পাউডার মিল্ক'
    '\n১ চা চামচ বেকিং পাউডার'
    '\n১ চা চামচ ভ্যানিলা এসেন্স'
    '\n১ /২ চা চামচ লবণ'
          '\n\n\nধাপগুলি'
          '\n# প্রথমে কেকের পাএ গুলোতে কেকের কাগজ একটু তেল দিয়ে সেট করে নিবো।'
          '\n# ডিমের সাদা অংশটা আলাদা করে, ফোম তৈরি করে কুসুম টা মিশিয়ে নিবো।(ডিম সাভাবিক তাপমাত্রার) চিনি,'
          ' ভ্যনিলা এসেন্স তেল মিশিয়ে নিবো ।এবার অল্প অল্প করে শুকনো উপকরন মিশিয়ে নিবো।'
          '\n# প্রেশার কুকারের মধ্যে ১কাপ পরিমান বালি /লবণ দিয়ে তার উপরে ১ টা স্টেন বসিয়ে দিবো। এবার কেকের পাএ গুলো এর উপরে বসিয়ে দিবো এবং '
          'প্রেশার কুকারের ঢাকনা লাগিয়ে দিবো।(সেফটি বালভ খুলে নিবো).১৫/20 মিনিট পর নামিয়ে ঠান্ডা করে নিবো।'
          '\n# এটা ক্রিম ছাড়া বা ক্রিম দিয়েও খাওয়া যায়...।',
      imageUrl: 'assets/cakeimages/cup_cake.webp',

    ),
    cFood(
      id: 'p6',
      title: 'ফ্রুটস কেক',
      description: 'ডিম ছাড়া ফ্রুটস কেক--'
          '\n\n\nউপাদানগুলি:-'
          '\n(৮জন)'
      '\n১কাপ ময়দা'
     '\n ১/৪ কাপ সুজি'
   '\n ১কাপ চিনি'
    '\n১/২ কাপ তেল'
    '\n২ টেবিল চামচ ঘি'
    '\n১কাপ দুধ'
    '\nকাজুবাদাম, কিসমিস, কাঠবাদাম, পেস্তা বাদাম, চিনে বাদাম,খেজুর ১কাপ'
    '\n১/২ চামচ ভেনিলা এসেন্স'
    '\n১/২ চা চামচ বেকিং সোডা'
    '\n১/২ চা চামচ বেকিং পাউডার'
          '\n\n\nধাপগুলি::--'
          '\n# একটা পাত্রে সুজি ময়দা বেকিং পাউডার ও বেকিং সোডা মিলিয়ে নিতে হবে। এখন এর মধ্যে চিনি তেল ঘি ও দুধ দিয়ে মিলিয়ে নিতে হবে।'
          '\n# এখন এর মধ্যে ড্রাই ফ্রুটস মিশিয়ে নিতে হবে।'
          '\n# এখন যে পাত্রে কেক বসাবো সে পাত্রে তেল লাগিয়ে বেকিং পেপার বিছিয়ে কেকের ব্যাটার ঢেলে উপরে ড্রাই ফ্রুটস ছড়িয়ে দিতে হবে।'
          '\n# এখন চুলায় একটা প্যানে বালি দিয়ে উপরে একটা হট স্টেন্ড বসিয়ে গরম করে কেকের মোল্ড বসিয়ে ঢেকে দিতে হবে।'
          ' ৪০- ৫০ মিনিট পর ঢাকনা তুলে চেক করে নামিয়ে নিতে হবে।',
      imageUrl: 'assets/cakeimages/fruts_cake.webp',

    ),
    cFood(
      id: 'p7',
      title: 'সুজির কেক',
      description: 'উপাদানগুলি::--'
          '\n(৮জন)'
      '১কাপ সুজি'
      '১/২ কাপ চিনি'
    '১/২ কাপ তেল'
    '২টি ডিম'
    '১কাপ দুধ'
    '১চা চামচ ঘি'
    'কাজুবাদাম কিসমিস কাঠবাদাম'
   ' ১চা চামচ বেকিং পাউডার'
    '১/২ চা চামচ ভানিলা এসেন্স'
          '\n\n# ধাপগুলি::'
          '\n# একটা বাটিতে ডিম ও চিনি ফেটতে হবে। এখন এর মধ্যে তেল ঘি মেশাতে হবে।'
          '\n# এখন এর মধ্যে সুজি দিয়ে মেশাতে হবে। এবং এর মধ্যে দুধ দিয়ে মেশাতে হবে প্রয়োজন মতো।'
          ' মিেশানো হয়ে গেলে এর মধ্যে বাদাম কুচি ও ভেনিলা এসেন্স মিশিয়ে নিতে হবে।'
          '\n# এখন কেকের মোল্ডে বাটার পেপার বিছিয়ে কেকের ব্যাটার ঢেলে দিতে হবে।'
          '\n# এখন চুলায় একটা প্যানে বালি দিয়ে এর উপরে হট সট্যান্ড বসিয়ে কেকের মোল্ডে বসিয়ে ঢেকে দিতে হবে। ২০ মিনিট পর ঢাকনা তুলে চেক'
          ' করতে হবে হয়েছে কিনা। হয়ে গেলে নামিয়ে পরিবেশন করতে হবে। বা ওভেনে বেক করে নিতে হবে।',
      imageUrl: 'assets/cakeimages/sujir_cake.webp',

    ),
    cFood(
      id: 'p8',
      title: 'অরেঞ্জ পাউন্ড কেক',
      description: 'উপাদানগুলি:--'
          '\n (৬ জন)'
     '\n ১ কাপ ময়দা'
      '\n১/৪ কাপ চিনি'
    '\n২ টা ডিম'
    '\n১চা চামচ বেকিং পাউডার'
    '\n২ টেবিল চামচ কমলার রস'
    '\n১/২ কাপ সয়াবিন তেল'
   '\n ১/২ চা চামচ অরেঞ্জ ফুড কালার'
    '\nসামান্য লবণ'
          '\n\n\nধাপগুলি:--'
          '\n(1).প্রথমে শুকনা উপকরণ গুলো চেলে নিব।'
          '\n(2).স্বাভাবিক তাপমাত্রার ডিমের সাদা অংশ বিট করে ফোম বানিয়ে নিব।'
      'এবার ডিমের কুসুম,চিনি মিশিয়ে আবার বিট করে নিব।'
          '\n(3).কমলার রস,তেল,লবণ,অরেঞ্জ ফুড কালার দিয়ে স্পেচুলার সাহায্যে মিশিয়ে নিব।'
      'শুকনা উপকরণ অর্ধেক চলে মিশিয়ে নিব।'
      'আবার বাকি অর্ধেক চেলে মিশিয়ে বেটার তৈরি করে নিব।'
          '\n(4).7" মোল্ডের নিচে একটু তেল ব্রাশ করে সাদা কাগজ বিছিয়ে নিব।'
          '\n(5).প্রি হিট ইলেক্টিক ওভেনে 160 ডিগ্রি সেঃ'
      '30মিনিট বেক করে নিব।'
          '\n(6).ঠান্ডা হলে মোল্ড আইট করে পছন্দ মতো সাজিয়ে নিব।',
      imageUrl: 'assets/cakeimages/orange_found_cake.webp',

    ),
    cFood(
      id: 'p9',
      title: '',
      description: '',
      imageUrl: '',

    ),   cFood(
      id: 'p10',
      title: '',
      description: '',
      imageUrl: '',

    ),






  ];

  List<cFood> get items => _items;


// List<Food> get items {
  //   return [..._items];
  // }
// List<Food>get items => _items;
  cFood FindById(String id){

    return _items.firstWhere((prod) => prod.id==id);

  }
  void AddFood(cFood value){
    _items.add(value);

  }
}