import 'package:flutter/cupertino.dart';
import 'package:learn_to_cook/foodReview/providers/food.dart';


class Foods extends ChangeNotifier{
  List<Food> _items=[
    Food(
      id:'p1',
      title: 'বার্গার ',
      description: 'ফাস্টফুডের মধ্যে অনেকেই বার্গার খেতে পছন্দ করেন। '
          ' তবে বার্গার সাধারণত আমরা রেস্তোরাঁ থেকে কিনে খেয়ে থাকি। '
          ' তবে আপনি চাইলে ঘরেই তৈরি করতে পারেন চিকেন চিজ বার্গার।'
          '\n\n\nআসুন জেনে নেই কীভাবে তৈরি করবেন চিকেন চিজ বার্গার- '
          '\n\n\nউপকরণ:- '
          '\nপ্যাটি বানানোর জন্য-'
          '\nমাংসের কিমা ৫০০ গ্রাম, গোলমরিচের গুঁড়া ২ চা-চামচ, লবণ ১ চা-চামচ, তেল ১ চা-চামচ।'
          '\n\nবার্গারের জন্য-'
          '\nবার্গার বান ৪টি (মাঝখান থেকে ২ ভাগ করা), মেয়নেজ, বার্গার চিজ ৪টি বা, '
          'পছন্দ করলে ৮টি, লেটুসপাতা বড় করে কাটা, টমেটো মোটাকুচি কয়েকটি, পেঁয়াজ মোটাকুঁচি কয়েকটি, সরিষাবাটা ২ চা-চামচ।'
          '\n\nপ্রস্তুত প্রণালি-'
          '\nপ্যাটির সব উপকরণ ভালোভাবে মাখিয়ে নিন। ৪ ভাগেভাগ করুন। গোল গোল প্যাটি বানিয়ে অল্প তেল দিয়ে দুই দিকে ভালোভাবে ভেজে নিন। এছাড়া গ্রিল করে নিতে পারেন।'
          'এবার বার্গার বানের নিচের বানে আগে অল্প সরিষাবাটা দিন। তারপর লেটুস পাতা দিয়ে একটি প্যাটি দিন। এর উপর মেয়নেজ দিয়ে টমেটোকুচি আর পেঁয়াজকুচিও দিন। চিজ দিন।'
          'চিজ বেশি পছন্দ করলে একেবারে নিচেও আরেকটা দিন। উপরের বানটা দিয়ে বানিয়ে ফেলুন মজাদার বার্গার।'
          '\n\n\nইতিহাস--'
          '\nহ্যামবার্গার (ইংরেজি: hamburger) (বীফ বার্গার, বার্গার স্যান্ডউইচ, বার্গার বা হ্যামবুর্গ নামেও পরিচিত) বা বার্গার (burger) হচ্ছে একপ্রকার স্যান্ডউইচ সদৃশ খাবার যা দুই '
          'প্রস্থ রুটির মধ্যে রান্না করা কিমা মাংস দিয়ে তৈরি করা হয়। মাংস হিসেবে সাধারণত গরু ব্যবহার করা হলেও শূকর, টার্কি, বা বিভিন্ন রকম মাংসের মিশ্রণ ব্যবহার করা হয়। বাংলাদেশে'
          ' বার্গারে মাংস হিসেবে প্রধানত ব্যবহৃত হয় মুরগী ও গরুর মাংস, এছাড়া কিছু কিছু স্থানে খাসী, অর্থাৎ ছাগলের মাংসের চলও দেখা যায়। বার্গারের রুটি বা বান তৈরিতে প্রধানত গমের আটা '
          'ব্যবহৃত হয়। এছাড়া রুটি হিসেবে বানের বদলে সাধারণ দু প্রস্থ পাউরুটির ব্যবহারও স্বীকৃত। হ্যামবার্গার তৈরি ও পরিবেশনে প্রায়ই সময়ই যে উপাদানগুলো ব্যবহৃত হয় তা হচ্ছে, লেটুস, টমেটো, '
          'পেঁয়াজ, শসা, পনির, এবং সস, যেমন: মাস্টার্ড, মেয়নেজ, এবং টমেটো কেচাপ। এই তিন ধরনের সস এবং অন্যান্য উপকরণ গ্রহণ করা সম্পূর্ণ ক্রেতার ইচ্ছার ওপর নির্ভরশীল।',
      price: 200.0,
      imageUrl: 'assets/images/burger.jpg'
    ),
    Food(
        id:'p2',
        title: 'ফ্রাইড চিকেন ',
        description: 'ফ্রাইড চিকেন বা চিকেন ফ্রাই বা মুরগী ভাজা যাই বলেন না কেন, এই খাবার আইটেমটি এতটাই জনপ্রিয় ঘরে বা বাইরে , যেকোনো জায়গায় তা অবশ্য বলার অপেক্ষা রাখেনা।'
        'সাধারণত এই খাবার আইটেমটি আলাদাভাবে বা ফ্রাইড রাইস বা পোলাও বা সন্ধ্যার স্ন্যাক্স হিসাবে খাওয়া হয়।'
       ' এই আইটেমটি বেশ অনেক উপায়েই করা যায়। কিন্তু অনেক ক্ষেত্রে সমস্যা হচ্ছে যে, কিছু উপাদান যা সব সময় আমাদের ঘরে থাকেনা। আবার শুধুমাত্র এই মেন্যুর জন্য আলাদা করে কেনার ইচ্ছা করেনা। তাহলে কি করা যায়?'
       'এখানে দুই ধরনের প্রস্তুত প্রণালির বর্ণনা আমি দিবো। একটি সাধারন এবং আর একটি একটু স্পেশাল। তবে হ্যাঁ, স্পেশাল নিয়মে অবশ্যই স্পেশাল স্বাদই পাওয়া যাবে। যাই হোক চটজলদি দেখে নিন তাহলে নিয়মাবলীগুলি, যা আপনার'
            ' জন্য সহজ হবে।'
            '\n\nসাধারন প্রস্তুতপ্রনালিঃ-'
            '\nউপাদানঃ-'
            '\n1.মুরগীর টুকরা (আপনার হিসাব মত, ৪/৫/৬)'
              '\n2.হাফ কাপ দুধ'
               '\n3.ডিম (মাঝারী ৪ টুকরা মুরগির জন্য দুইটা)'
             '\n4.টমেটো সস (মিনি প্যাক কিনতে পাওয়া যায়, মিনি প্যাক মিনিমাম দুইটা)'
             '\n5.আদা বাটা, রসুন বাটা, লাল মরিচ বাটা'
              '\n6.চালের গুড়া বা বেসন'
            '\n\nপ্রনালিঃ-'
            '\n1.প্রথমে একটি পাত্রে দুধ নিয়ে তাতে সামান্য লেবুর রস বা ভিনেগার ও দিতে পারেন।'
            '\n2.কিছুক্ষণপর দেখবেন যে একটু কেটে যাবার মত হইছে, তখন তাতে একএক করে হাফ চা চামচ আদা বাটা, রসুনবাটা, টমেটো সস, অল্প পরিমান লাল মরিচ দিন।'
            '\n3.তারপর তাতে মুরগির টুকরা গুলো দিন এবং ভাল ভাবে মাখিয়ে নিন। এরপর মিশ্রণটি এভাবে ২/৩ ঘন্টা ফ্রিজে রাখুন বা ভালভাবে ঢেকে একটি ঠান্ডা জায়গায় রাখুন।'
            '\n4.এবার একটি পাত্রে ডিম নিন, তাতে সামান্য লবন বা বিট লবন দিয়ে ভালোভাবে ফাটিয়ে নিন। আলাদা পাত্রে কিছু চালের গুড়া বা বেসন নিন।'
            '\n5.এখন মাংসের টুকরাগুলি প্রথমে ডিমে ডুবিয়ে নিন তারপর বেসন বা গুড়া দিয়ে মাখিয়ে নিন, আবার ডিম দিয়ে ডুবিয়ে গুড়া দিয়ে মাখিয়ে নিন। এভাবে মিনিমাম ৩ থেকে ৪ বার করুন। তা নাহলে কিন্তু পুরু স্তর হবেনা।'
            '\n6.এবার চুলায় পাত্র বসিয়ে তেল দিয়ে একদম মাঝারী আঁচে গরম করে নিন। তারপর মাংসের টুকরা গুলি একে একে তেলে ছেড়ে দিন। ডুবন্ত তেলে করাটা বেশি ভালো তাহলে পরিপূর্ণভাবে মাংসের টুকরা ভাজা সম্ভব হয়। তবে '
            'বারবার উল্টাপাল্টা করবেননা। কিছুক্ষণ পর উল্টিয়ে দিন। অপর পাশটি হয়ে এলে পাত্র থেকে তুলে নিন। '
             'এবং সম্ভব হলে পাত্রে টিস্যু পেপার নিয়ে তাতে রাখুন, তাহলে বাড়তি তেলটুকু ভালোভাবে শুষে নিবে। একদমই তেলতেলে মনে হবেনা। '
            '\n\nতাহলে কেমন মনে হলো? এর চাইতে সহজ কিন্তু সম্ভব নয়। তাহলে করে ফেলুন যেকোনো সময়, কোনো ঝামেলা ছাড়ায়। '
            '\nস্পেশাল প্রণালীঃ '
            '\n\nউপাদানঃ'
            '\n1.মুরগীর টুকরা (আপনার হিসাব মত, ৪/৫/৬)'
            '\n2.মেয়নেজ ২ টেবিল চামচ'
            ' \n3.টেস্টিং সল্ট, লবন (হালফ চা চামচ)'
             ' \n4.ডিম (মাঝারী ৪ টুকরা মুরগির জন্য দুইটা)'
             '\n5.চিলি সস (১ টেবিল চামচ), সয়া সস, টমেটো সস (১ চা চামচ)'
            '\n6. পেয়াজ বাটা, আদা বাটা, রসুন বাটা'
             '\n7.ব্রেড ক্রাম (সুপার শপে কিনতে পাবেন)'
            '\n\nপ্রণালীঃ '
            '\n1.প্রথমে একটি নিন, তাতে ব্রেড ক্রাম এবং ডিম ছাড়া সব কিছু নিয়ে ভালভাবে মাখিয়ে নিন।'
            '\n2.তারপর তাতে মুরগির টুকরা গুলো দিন এবং ভাল ভাবে মাখিয়ে নিন। এরপর মিশ্রণটি এভাবে ৩/৪ ঘন্টা ফ্রিজে রাখুন বা ভালভাবে ঢেকে ঠান্ডা জায়গায় রাখুন।'
            '\n3.এবার একটি পাত্রে ডিম নিন, তাতে সামান্য লবন বা বিট লবন দিয়ে ভালোভাবে ফাটিয়ে নিন। আলাদা পাত্রে পরিমান মত ব্রেড ক্রাম নিন। আসলে ব্রেড ক্রাম দিলে'
            ' খুব ভাল মচমচে এবং অনেকটা KFC Fried Chicken এর মত হয়।'
            '\n4.এখন মাংসের টুকরাগুলি প্রথমে ডিমে ডুবিয়ে নিন তারপর ব্রেড ক্রাম এ ভালোভাবে মাখিয়ে নিন। এরপর আবার ডিমে ডুবিয়ে ব্রেড ক্রাম এ মাখিয়ে নিন।  এভাবে মিনিমাম ৩ থেকে ৪ বার করুন। '
            '\n5.এবার চুলায় পাত্র বসিয়ে তেল দিয়ে একদম মাঝারী আঁচে গরম করে নিন। তারপর মাংসের টুকরা গুলি একে একে তেলে ছেড়ে দিন। ডুবন্ত তেলে করাটা বেশি ভালো তাহলে পরিপূর্ণভাবে মাংসের টুকরা ভাজা সম্ভব হয়।'
            ' তবে বারবার উল্টাপাল্টা করবেননা। কিছুক্ষণ পর উল্টিয়ে দিন। অপর পাশটি হয়ে এলে পাত্র থেকে তুলে নিন। এবং সম্ভব হলে পাত্রে টিস্যু পেপার নিয়ে তাতে রাখুন,'
            ' তাহলে বাড়তি তেলটুকু ভালোভাবে শুষে নিবে। একদমই তেলতেলে মনে হবেনা। ',
        price:80.50,
        imageUrl: 'assets/images/chicken.webp'
    ),
    Food(
        id:'p3',
        title: 'kfc-Kentucky Fried Chicken ',
        description: 'কেন্টাকি ফ্রাইড চিকেন (কেএফসি নামে পরিচিত) যুক্তরাষ্ট্রের কেন্টাকি অঙ্গরাজ্যের লুইসভিলে বেড়ে উঠা একটি ফুড চেইনকে বুঝায় যা মূলত এর ফ্রাইড চিকেনের জন্য সুখ্যাতি লাভ করেছে। '
            'এটি ম্যাকডোনাল্ডের পরে বিশ্বের দ্বিতীয় বৃহত্তম রেস্তোরাঁর চেইন (বিক্রয় দ্বারা পরিমাপ করা হয়েছে), ডিসেম্বর ২০১৯ পর্যন্ত ১৫০টি দেশে বিশ্বব্যাপী ২২,৬২১টি স্থানে এদের দোকান রয়েছে। [৫] চেইনটি ইউম!'
            ' ব্র্যান্ডসের একটি সহযোগী প্রতিষ্ঠান, যা একটি রেস্তোরাঁ কোম্পানি যা পিৎজা হাট, টাকো বেল এবং উইংস্ট্রিট চেইনের মালিক। [৬]'
        '২০০২ সাল থেকে যুক্তরাষ্ট্রের ইয়াম! ব্র্যান্ড্‌স ইনকরপোরেটেডের একটি সহযোগী প্রতিষ্ঠানের মালিকানায় পরিচালিত হচ নাম কেএফসি রাখা হয় ১৯৯১ সালে। তবে ২০০৭ সালের '
            'এপ্রিল মাস থেকে এর সকল স্বাক্ষর, প্যাকেজিং এবং বিজ্ঞাপনের জন্য পুরো কেন্টাকি ফ্রাইড চিকেন নামের ব্যবহার শুরু হয়েছে। মূলত যুক্তরাষ্ট্রে কোম্পানিটির ব্র্যান্ডে পূর্ণ'
            ' পরিবর্তন আনার জন্যই এমনটি করা হয়েছে। নতুনভাবে নির্মিত রেস্তোঁরাগুলোতে এই নতুন স্বাক্ষর এবং প্রতীক ব্যবহৃত হবে। অবশ্য আগের রেস্তোঁরাগুলোতে ১৯৯১ সালের পুরনো'
            ' প্রতীকই ব্যবহার করা হবে বলে সিদ্ধান্ত নেয়া হয়েছে। তবে বর্তমানে বিভিন্ন বিজ্ঞাপনের জন্য কেএফসি নামটিই মুক্তভাবে ব্যবহৃত হচ্ছে। আন্তর্জাতিকভাবে এটি এখনও কেএফসি নামেই বেশি পরিচিত।'
       'কেএফসি বিশ্বব্যাপী বিপুল জনপ্রিয়তা অর্জন করে। এরই স্বীকৃতিস্বরূপ পৃথিবীর বিভিন্ন দেশের রেস্তোঁরা মালিকরা এই নামটি খাদ্যের মান হিসেবে ব্যবহৃত হচ্ছে। অর্থাৎ কোন রেস্তোঁরায় যদি কেএফসির সমমানের'
            ' খাদ্যমান বজায় রাখতে পারে তাহলে তাদেরকে এই নামে আখ্যায়িত করা যাচ্ছে। কেএফসি ফাস্ট ফুড তাই এখন সারা বিশ্বে বিস্তৃতি লাভ করেছে।'
            '\n\nKFC নামটি আমাদের সবার কাছেই খুব পরিচিত । নামটি শুনলেই আমাদের মাথায় ভেসে উঠে ক্রিস্পি একটি চিকেন ফ্রাই এর ছবি । '
            'আমরা সবাই একে KFC CHICKEN FRY নামেই জানি । KFC এর এই চিকেন ফ্রাই এর রেসিপিটি তারা কখনো প্রকাশ করে নি । '
            'তবে আপনি চাইলে নিচের রেসিপিটি ফলো করে খুব সহজেই ঘরে বসে বানিয়ে নিতে পারেন KFC এর মত চিকেন ফ্রাই যা আকারে এবং স্বাদে প্রায় পুরোপুরি আসল KFC CHICKEN FRY এর মত ।'
            ' তাই চলুন আর দেরি না করে দেখে নেয়া যাক সহজ এই  রেসিপিটি ......'
              'kfc style chicken fry recipe in bangla'
            '\n\nপ্রয়োজনীয় উপকরণঃ '
            '\n1.সুন্দর ভাবে কাটা ৪ পিস ফ্রেশ মুরগি'
          ' \n2. আদা রসুন পেস্ট ১চা চামচ'
          '\n3. টকদই ২০০ মিলি'
           '\n4.  ১/২ টেবিল চামচ লবন'
           '\n5.৬০০মিলি পানি'
          '\n6. ময়দা ১ কাপ'
          ' \n7. কর্ণফ্লাওয়ার ১ টেবিল চামচ'
         '\n8. অনিয়ন পাওডার (পেয়াজের গুড়ো) ১চা চামচ'
        '\n9. গরম মশলা গুড়ো ১ চা চামচ'
         '\n10. ১টি ডিম ও ভাজার জন্য'
            '\n\nরন্ধনপ্রণালীঃ -'
            '\nমুরগীর পিসগুলো ভালো করে ধুয়ে পানি ঝরিয়ে কিচেন টিস্যু দিয়ে শুকনো করে মুছে নিন। একটি মিক্সিং বোল এ আদা রসুন পেস্ট, গরম মশলা গুড়ো ,টকদই, লবন দিয়ে ভালোকরে মিশান। এবার এতে '
            'মুরগীর পিসগুলো দিয়ে মিশিয়ে ঢাকা দিন ও ২-৪ ঘন্টা মেরিনেট করুন। এ সময়টা রেফ্রিজারেটর এ রাখতে পারেন।'
           'Recipes in bengali language        Bangla Food recipes                Easy Recipes Bangla        Recipes BD            Easy Recipes'
        ' ১টি ছড়ানো পাত্রে  ময়দা, কর্ণফ্লাওয়ার, অনিয়ন পাওডার,  ও সামান্য লবন মিশিয়ে শুকনো একটি মিশ্রন তৈরী করুন।মেরিনেট করা চিকেন পিস বের করে তা প্রথমে শুকনো মিশ্রনে'
            ' ভালোভাবে গড়িয়ে কোট করুন। এবার হালকা করে পানিতে চুবিয়ে পুনরায় শুকনো মিশ্রনে গড়িয়ে নিন। এভাবে সবগুলো করুন।'
        ' চুলাই প্যান গরম করে তেল দিন। তেল গরম হলে এক এক করে কোট করা চিকেন পিসগুলো ডুবোতেলে ভাজুন। চুলার আচ সবসময় মাঝারী করে রেখে ভাজুন। এভাবে সবগুলো ভেজে ১টি কিচেন টিস্যু বিছানো '
       ' পাত্রে তুলে নিন। এটি অতিরিক্ত তেল শুষে নিবে।'
       'ব্যস হয়ে গেলো। এবার আপনার পছন্দের সস/চাটনি দিয়ে পরিবেশন করুন লোভনীয় স্বাদের ক্রিস্পি চিকেন ফ্রাই। যার স্বাদ হয়তো কেএফসি চিকেন ফ্রাইকে ও হার মানাবে!'


         '\n\n#আন্তর্জাতিক কেএফসি রেস্তোঁরাসমূহের অবস্থান:'

        '\nAntigua and Barbuda এন্টিগুয়া ও বারবুডা\n'
    'Aruba আরুবা'
    '\nAustralia অস্ট্রেলিয়া'
    '\nAustria অস্ট্রিয়া'
    '\nBahamas বাহামাস'
    '\nBahrain বাহরাইন'
    '\nBangladesh বাংলাদেশ'
    '\nBarbados বারবাডোস'
    '\nBermuda বারমুডা'
    '\nBotswana বতসোয়ানা'
    '\nBrazil ব্রাজিল'
    '\nBulgaria বুলগেরিয়া'
    '\nCanada কানাডা'
    '\nChile চিলি'
    '\nChina চীন'
    '\nColombia কলম্বিয়া'
    '\nCosta Rica কোস্টা রিকা'
    '\nCuraçao কুরাকাও'
    '\nCyprus সাইপ্রাস'
    '\nCzech Republic চেক প্রজাতন্ত্র'
    '\nDenmark ডেনমার্ক'
    '\nDominica ডোমিনিকা'
    '\nDominican Republic ডোমিনিকান প্রজাতন্ত্র'
    '\nEcuador ইকুয়েডর'
    '\nEl Salvador এল সালভাদর'
    '\nEgypt মিশর'
    '\nFiji ফিজি'
    '\nFrance ফ্রান্স'
    '\nGermany জার্মানি'
    '\nGrenada গ্রেনাডা'
    '\nGreece গ্রিস'
    '\nGuyana গায়ানা'
    '\nHonduras হন্ডুরাস'
    '\nHong Kong হংকং'
    '\nHungary হাঙ্গেরি'
    '\nIceland আইসল্যান্ড'
    '\nIndia ভারত'
    '\nIndonesia ইন্দোনেশিয়া'
    '\nIreland আয়ারল্যান্ড'
    '\nIsrael ইসরাইল'
    '\nJamaica জ্যামাইকা'
    '\nJapan জাপান'
    '\nJordan জর্ডান'
    '\nKorea দক্ষিণ কোরিয়া'
    '\nKuwait কুয়েত'
    '\nLebanon লেবানন'
    '\nMacau মাকাউ'
    '\nMalaysia মালয়েশিয়া'
   ' \nMalta মাল্টা'
   ' \nMauritius মরিশাস'
   ' \nMexico মেক্সিকো'
   ' \nNamibia নামিবিয়া'
   ' \nNetherlands নেদারল্যান্ড'
  '  \nNew Zealand নিউজিল্যান্ড'
   ' \nOman ওমান'
    '\nPakistan পাকিস্তান'
    '\nPanama পানামা'
    '\nPeru পেরু'
    '\nThe Philippines ফিলিপাইন'
    '\nPoland পোল্যান্ড'
    '\nPortugal পর্তুগাল'
    '\nPuerto Rico পুয়ের্টো রিকো'
    '\nQatar কাতার'
    '\nRomania রোমানিয়া'
    '\nRussia রাশিয়া'
    '\nSaint Vincent and the Grenadines সেন্ট ভিনসেন্ট এবং গ্রেনাডাইন্‌স'
    '\nSaudi Arabia সৌদি আরব'
    '\nSingapore সিঙ্গাপুর'
    '\nSlovakia স্লোভাকিয়া'
   ' \nSouth Africa দক্ষিণ আফ্রিকা'
    '\nSpain স্পেন'
    '\nSri Lanka শ্রীলঙ্কা'
    '\nSyria সিরিয়া'
    '\nSt. Lucia সেন্ট লুসিয়া'
    '\nTaiwan তাইওয়ান'
    '\nThailand থাইল্যান্ড'
    '\nTrinidad and Tobago ত্রিনিদাদ ও টোবাগো'
    '\nTurkey তুরস্ক'
    '\nU.S. Virgin Islands মার্কিন ভার্জিন দ্বীপপুঞ্জ'
    '\nUnited Arab Emirates সংযুক্ত আরব আমিরাত'
    '\nUnited Kingdom যুক্তরাজ্য'
    '\nUnited States যুক্তরাষ্ট্র'
    '\nVenezuela ভেনিজুয়েলা'
    '\nVietnam ভিয়েতনাম'
    '\nYemen ইয়েমেন'
    '\nZimbabwe জিম্বাবুয়ে',
        price: 100.0,
        imageUrl: 'assets/images/kfc.webp'
     ),
    Food(
        id:'p4',
        title: 'পিজ্জা ',
        description: 'বিভিন্ন রকমের পিজ্জা রেসিপি / পিৎজা রেসিপি এর পরিচিতি ( Introduction to Pizza Recipes in Bangla ) : '
            '\n\nপিজ্জা একটা নাস্তা জাতীয় খাবার । ময়দা , চিকেন , বিভিন্ন সস ও আরও উপকরণ দিয়ে বানানো হয় এই পিজ্জা । বিভিন্ন রকম পিজ্জা বানানো যায় যেমন :- চিকেন পিজ্জা , এগ পিজ্জা , ভেজিটেবল পিৎজা ।'
       ' এই জন্য ছোট বড় সবার পছন্দ পিৎজা । রেস্টুরেন্ট এ পাওয়া যায় বিভিন্ন রকমের পিজ্জা । আপনি চাইলে বাসায় ও বানিয়ে নিতে পারেন পিৎজা ।'
        'আসুন কয়েক রকমের পিজ্জা রেসিপি দেখে নেওয়া যাক ।'
            '\n\n\nচিকেন পিজ্জা রেসিপি ( Chicken Pizza Recipe Bangla ) :'
            '\nছোট বড় সবার পছন্দের একটা খাবার চিকেন পিজ্জা । ঘরে খুব সহজেই বানিয়ে নিতে পারেন চিকেন পিৎজা । আসুন খুব সহজে কিভাবে চিকেন পিজ্জা বানানো যায় দেখে নেওয়া যাক ।'
            '\nচিকেন পিৎজা রেসিপি এর উপকরণ ( Ingredients of chicken pizza recipe bangla ) :'
            '\n১) ময়দা ২ কাপ ।'
             '\n২) লবণ পরিমান মতো ।'
            '\n৩) অলিভ অয়েল ২ চা চামচ ।'
            '\n ৪) ইস্ট ১ চা চামচ ।'
           '\n৫) চিনি ১ চা চামচ ।'
            '\n ৬) টমেটো সস ১ টেবিল চামচ ।'
             '\n৭) পিৎজা সস ১ টেবিল চামচ ।'
            '\n৮) রান্না করা চিকেন টুকরা আধা কাপ ।'
             '\n ৯) পেঁয়াজ কিউব করে কাটা ১ টা ।'
            ' \n ১০) কেপ্সিকাম কিউব করে কাটা ১ টা ।'
            ' \n ১১) চিজ গ্রেট করে কাটা আধা কাপ ।'
             '\n ১২) স্লাইজ চিজ ১ টা ।'
            '\n১৩) চিলি ফ্লেক্স ১ চা চামচ ।'
            '\n ১৪) ডো মাখানোর জন্য গরম পানি ১ কাপ ।'
            '\n\nচিকেন পিজ্জা রেসিপি এর প্রস্তুত প্রণালী ( Preparation of chicken pizza recipe bangla ) :'
            '\n১) প্রথমে হালকা কুসুম গরম পানিতে ১০ মিনিট ইস্ট ভিজিয়ে রাখতে হবে । এবার একটি বোলে ময়দা , লবণ , চিনি , তেল ভালোভাবে মিশিয়ে নিতে হবে ।'
                 'গরম জলে মেশানো ইস্ট দিয়ে ভালোভাবে মেখে নিতে হবে।'
              '  মাখানো হয়ে গেলে ডোতে অলিভ অয়েল দিয়ে ভালোভাবে ঢেকে গরম কোন জায়গায় রেখে দিতে হবে ।'
            ' \n ২) ৩০ থেকে ৪০ মিনিট হলে ডো অনেক ফুলে উঠবে । এবার একটি পিৎজা বেকিং ট্রেতে অয়েল ব্রাশ করে চেপে চেপে সেট করে নিতে হবে ।'
           ' এবার একটা চিকন কাঠি দিয়ে ফুটো ফুটো করে দিতে হবে । এবার এর উপর টমেটো সস আর পিজ্জা সস দিয়ে ভালোভাবে মাখিয়ে নিতে হবে ।'
              'এবার এর উপর চিকেনের টুকরো , পেঁয়াজের টুকরো , ক্যাপসিকামের টুকরো , স্লাইজ চিজের টুকরো আর গ্রেট করা চীজ দিয়ে সাজিয়ে দিতে হবে । এবার উপরে চিলি ফ্লেক্স ছড়িয়ে দিতে হবে ।'
          '\n৩) এবার মাইক্রো ওভেন ১০ মিনিট প্রিহিট করে ১৫ থেকে ২০ মিনিট পিৎজা বেক করে নিতে হবে ।'
            '\nব্যাস হয়ে গেলো সুস্বাদু চিকেন পিজ্জা ।'
            '\n\nভেজিটেবল পিজ্জা রেসিপি ( Vegetable pizza recipe bangla ) :'
            '\nভেজিটেবল পিজ্জা ছোট বড় সবার পছন্দের । খুব সহজেই ঘরে বানিয়ে নিতে পারেন ভেজিটেবল পিজ্জা । আসুন দেখে নেওয়া যাক খুব সহজে কিভাবে ভেজিটেবল পিৎজা বানানো যায় ।'
            '\nভেজিটেবল পিৎজা রেসিপি এর উপকরণ ( Ingredients of vegetable pizza recipe bangla ) :'
            '\n১) ময়দা ২ কাপ ।'
             '\n২) ইস্ট ২ চা চামচ ।'
            '  \n৩) চিনি ১ চা চামচ ।'
             '\n৪) লবণ পরিমান মতো ।'
            '\n৫) তেল ৩-৪ চামচ ।'
            '\n  ৬) কুসুম গরম পানি ১ কাপ ।'
 ' \n৭) গ্রেট করা চীজ ১ কাপ ।'
  '\n৮) কেপ্সিকাম টুকরো করে কাটা এক কাপ । সবুজ , হলুদ দুই রকমের কেপ্সিকাম নিবেন ।'
  '\n৯) মেয়োনিজ ২-৩ টেবিল চামচ ।'
  '\n১০) টমেটো সস ৩ টেবিল চামচ ।'
            '\n\nভেজিটেবল পিজ্জা প্রস্তুত প্রণালী ( How to prepare vegetable pizza Bangla ) :'
            '\n১) প্রথমে একটি বড় বাটিতে ময়দা , ইস্ট , চিনি , লবণ ও ৩ চামচ তেল নিয়ে সবগুলো উপকরণ ভালোভাবে মিশিয়ে নিতে হবে ।'
            '\n২) এবার হালকা কুসুম পানি দিয়ে ডো তৈরী করে নিতে হবে । ডো তৈরী করা হলে উপর দিয়ে তেল দিয়ে মাখিয়ে দিতে হবে ।'
            'একটা ঢাকনা দিয়ে ভালোভাবে ঢেকে দিতে হবে যাতে , ভেতরে বাতাস ঢুকতে না পারে । এবার পাত্রটি গরম জায়গায় রেখে দিতে হবে ৩০ মিনিট এর জন্য ।'
            '\n৩) ৩০ মিনিট পর ডো ফুলে ডাবল হয়ে গেলে এটি ২ ভাগ করে নিন । এবার একটি পিজ্জা প্যান নিয়ে তাতে ডো দিয়ে হাত দিয়ে ঘুরিয়ে ঘুরিয়ে গোল শেপ করে নিতে হবে ।'
            '\n৪) এবার সেট করা হয়ে গেলে একটি কাটা চামচ দিয়ে ছিদ্র করে নিতে হবে । এখন এর উপরে টমেটো সস মাখিয়ে নিতে হবে । এরপর এর উপর মেয়োনিজ মাখিয়ে নিতে হবে ।'
            '\nএবার এক এক করে হলুদ ও সবুজ ক্যাপসিকাম এর টুকরা গুলো ছড়িয়ে দিতে হবে । এবার চীজ গুলো ছড়িয়ে দিন উপরে ।'
            '\n৫) এবার ১৮০ ডিগ্রী সেলসিয়াসে ওভেন প্রিহিট করে ১৫-২০ মিনিট পিজ্জা বেক করে নিতে হবে । ব্যাস হয়ে গেলো ভেজিটেবল পিজ্জা ।',
        price: 400.0,
        imageUrl: 'assets/images/pizza.jpg'
    ),
    Food(
        id:'p5',
        title: 'স্যান্ডউইচ ',
        description: 'স্যান্ডউইচ এমন একটি খাবার, যা সাধারণত শাকসবজি, পনির/চিজের ফালি বা মাংস দিয়ে তৈরি করা হয়। রুটির টুকরোর উপরে বা ভেতরে উপকরণগুলি পুর হিসাবে দেওয়া হয় এবং রুটি উপকরণগুলির ধারক বা মোড়ক হিসাবে থাকে।'
            ' পশ্চিমা বিশ্বে হাতে বহনযোগ্য জলখাবার হিসাবে স্যান্ডউইচের ব্যুৎপত্তি হয়েছিল, '
            'যদিও সময়ের সাথে সাথে বর্তমানে খাবারটি বিশ্বব্যাপী প্রচলিত রয়েছে। প্রতিবছর ৩"রা'
            ' নভেম্বরকে জাতীয় স্যান্ডউইচ দিবস হিসাবে গণ্য করা হয়।[৪]'
            '\n\nমাত্র ১০ মিনিটে বাড়িতে তৈরি করতে পারেন সবচেয়ে মজাদার ও সহজ নাস্তার রেসিপি ডিম স্যান্ডউইচ। বিশেষত বাচ্চারা এই খাবারটি বেশি পছন্দ করে। সকালের নাস্তা অথবা বিকাল...'
            '\nউপকরণ-'
            '\n২ টি ‏ডিম'
        '\n৮ পিস ‏পাউরুটি'
       ' \n১ টেবিল চামচ ‏পেঁয়াজ কুচি'
        '\nআধা চা চামচ ‏কাঁচা মরিচ কুচি'
        '\n২ টেবিল চামচ ‏শসা কুচি'
        '\n১ টেবিল চামচ ‏টমেটো সস'
        '\n২ টেবিল চামচ ‏মেয়োনিজ'
       '\n ১/৪ কাপ ‏মাখন'
       '\nপরিমাণ মত ‏লবণ'
            '\n\nপ্রস্তুত-প্রনালী:'
            '\nডিম দুইটি সেদ্ধ করে খোসা ছাড়িয়ে কাটা চামচ দিয়ে একটু ম্যাশ বা ভর্তা করে নিন। এবার এর মধ্যে একে একে পেঁয়াজ, কাঁচামরিচ, শসা, টমেটো সস, মেয়োনিজ ও লবণ দিয়ে ভালো করে মাখিয়ে একপাশে রেখে দিন।'
            '\nএবার ফ্রাই প্যানে পরিমাণ মত মাখন দিয়ে পাউরুটি এপিঠ ওপিঠ করে লাল করে ভেজে নিন। কিছুটা ডিমের পুর নিয়ে পাউরুটির ওপর মাখিয়ে নিন।'
            '\nএর ওপর এক টুকরো চিজ স্লাইস দিয়ে আরেকটি পাউরুটি দিয়ে আবার এপিঠ ওপিঠ করে সেকে নিন। এরপর নামিয়ে স্যান্ডউইচের আকারে কেটে গরম গরম পরিবেশন করুন।',
        price: 250.0,
        imageUrl: 'assets/images/sandwich.jpg'
    ),
    Food(
      id:'p6',
      title: 'গরুর মাংস',
      description: 'গরুর মাংস রান্নার রেসিপি--'
          '\n\nপ্রয়োজনীয় উপকরণ :'
          '\n গরুর মাংস ১ কেজি, পেঁয়াজ কুচি ১ কাপ, হলুদ ও মরিচ গুঁড়া ১ কাপ, আদা ও রসুন বাটা আধা চা চামচ, রসুনের কোয়া ৪/৫টি, ধনে ও জিরা গুঁড়া ১ চা চামচ, টেস্টিং সল্ট সামান্য, তেল আধা কাপ, মাংসের মসলা আধা চা চামচ, '
          'টমেটো সস আধা কাপ, টক দই ১ কাপ, গরম মসলা গুঁড়া আধা চা চামচ, লবণ স্বাদ মতো।'
          '\n\n\nপ্রস্তুত প্রণালী:'
          '\nমাংস ধুয়ে কেটে নিন। একটি পাত্রে মাংস, হলুদ, মরিচ, টক দই, আদা, রসুন, লবণ, ধনে, জিরা গুঁড়া, টেস্টিং সল্ট ভালো করে মিশিয়ে '
          '২০ মিনিট মেরিনেট করে রাখুন। কড়াইতে তেল গরম করে পেঁয়াজ বাদামী করে ভেজে মাংস দিয়ে নেড়ে কষাতে হবে।'
          ' কষানো হলে সামান্য পানি দিয়ে নেড়ে ঢেকে রাখতে হবে। মাংস সিদ্ধ হয়ে আসলে টমেটোসস, কাঁচামরিচ ফালি ও'
          'রসুনের কোয়া দিয়ে ১০ মিনিট দমে রেখে নামিয়ে গরম গরম পরিবেশন করুন।',
      price: 200.0,
      imageUrl: 'assets/images/beef_roast.jpg'
    ),
    Food(
        id:'p7',
        title: 'চিকেন বিরিয়ানি',
        description: 'বিরিয়ানির নাম শুনে জ্বিভে জল আসে না এমন মানুষ পাওয়া দুষ্কর। কিন্তু ব্যস্ততার '
            'কারণে হয়তো মোঘল স্টাইলে অথবা রেস্তোরার স্বাদে মজাদার বিরিয়ানি রান্না করার সময়টুকু হয়ে উঠে না।'
            ' আজকে আমরা দেখাবো কিভাবে খুব সহজে ঘরে বসেই রেস্তোরার স্বাদে মজাদার চিকেন বিরিয়ানি রান্না করা যায়!'
            '\n\n\nচিকেন বিরিয়ানি রান্নার রেসিপি'
            '\n\nউপকরণ:-'
            '\n১. মুরগী- ১ কেজি'
            '\n২. আদা বাটা- ১.৫ চা চামচ'
       ' \n৩. ধনিয়া গুড়া- ১ চা চামচ'
    '\n৪. জিরা গুড়া- ১ চা চামচ'
    '\n৫. টকদই- ২ টেবিল চামচ'
    '\n৬. রসুন বাটা- ১.৫ চা চামচ'
    '\n৭. মরিচের গুড়া- ১ চা চামচ'
    '\n৮. জয়ফল-জয়ত্রী গুড়া- ১/২ চা চামচ'
    '\n৯. গরম মসলা গুড়া- ১.৫ চা চামচ'
    '\n১০. লবণ- পরিমাণমতো'
    '\n১১. তেল- ৩ টেবিল চামচ'
    '\n১২. পেঁয়াজ কুঁচি- ২ টেবিল চামচ'
        '\n১৩. ঘি- ২ টেবিল চামচ'
    '\n১৪. পেঁয়াজ মরিচ বাটা- ১/২ কাপ'
            '\n\nরান্নার পদ্ধতি:-'
            '\n(১) প্রথমে একটি পাত্রে মুরগী  নিয়ে তাতে একে একে আদা বাটা, রসুন বাটা, জিরা গুড়া,'
            ' ধনিয়া গুড়া, টক দই, মরিচের গুড়া, জায়ফল-জয়ত্রী গুড়া, গরম মসলা গুড়া, লবণ, এবং পেঁয়াজ মরিচ বাটা '
            'মাখিয়ে এক ঘন্টা রেখে দিতে হবে।'
            '\n(২) তারপর একটি প্যান-এ তেল আর ঘি দিয়ে গরম হয়ে এলে পেঁয়াজ কুঁচি দিয়ে ভেজে নিতে হবে।'
  '\n(৩) পেঁয়াজ সামান্য ভাজা হয়ে গেলে তাতে মেরিনেট করে রাখা মুরগী সব মসলাসহ দিয়ে দিতে হবে।'
  '\n(৪) মুরগী হয়ে গেলে নামিয়ে রাখতে হবে।'
            '\n\n\nরাইস  রান্নার জন্য যা যা লাগবে-'
            '\n১. পোলাও এর চাল- ১ কেজি'
        '\n২.পেঁয়াজ কুঁচি- ১/২ কাপ'
    '\n৩.তেল- ৩ টেবিল চামচ'
    '\n৪. ঘি- ২ টেবিল চামচ'
    '\n৫. আদা বাটা- ২ টেবিল চামচ'
    '\n৬. রসুন বাটা- ২ টেবিল চামচ'
    '\n৭. এলাচ- ৪ টুকরা'
    '\n৮. দারচিনি- ২ টুকরা'
    '\n৯. তেজপাতা- ৩ টুকরা'
    '\n১০. গরম পানি- চালের দ্বিগুণ'
    '\n১১. লবণ- পরিমাণমতো'
    '\n১২. কাজু বাদাম- ১/২ কাপ'
    '\n১৩. গোলাপ জল- ২-৩ ফোঁটা'
    '\n১৪. কেওড়া জল- ২ ফোঁটা'
            '\n\nরান্নার পদ্ধতি:-'
            '\n(১) প্রথমে চাল ধুয়ে পানি ছেঁকে নিতে হবে।'
  '\n(২) তারপর একটি প্যানে তেল ও ঘি গরম করে তাতে পেঁয়াজ কুচি, এলাচ, দারচিনি, তেজপাতা দিয়ে ভেজে নিতে হবে।'
  '\n(৩) পেঁয়াজ লাল লাল করে ভাজা হলে তাতে আদা বাটা ও রসুন বাটা দিয়ে নাড়তে হবে।'
  '\n(৪) তারপর চাল দিয়ে তাতে লবণ দিয়ে আরো কিছুক্ষণ ভেজে নিতে হবে।'
  '\n(৫) ভাজা হয়ে গেলে তাতে গরম পানি দিয়ে ঢেকে দিয়ে অল্প আঁচে রান্না করে নিব।'
  '\n(৬) পানি কমে আসলে তাতে আগে থেকে রান্না করা মুরগী দিয়ে নেড়ে আরো কিছুক্ষণ অল্প আঁচে রান্না করে নিতে হবে।'
  '\n(৭) তারপর হয়ে এলে কেওড়া জল এবং গোলাপ জল ছিটিয়ে দিতে হবে।'
  '\n\n\nব্যস! হয়ে গেলো মজাদার চিকেন বিরিয়ানি। এভাবে খুব সহজে পরিবারের সবার জন্য রান্না করে ফেলুন চিকেন'
            ' বিরিয়ানি এবং কাছের মানুষদের নিয়ে উপভোগ করুন মজাদার এই ডিশটি!',
        price: 280.0,
        imageUrl: 'assets/images/ch_biryani.jpg'
    ),
    Food(
        id:'p8',
        title: 'মুরগির মাংস ',
        description: 'আলু দিয়ে মুরগির মাংস রেসিপি'
            '\n\n\nউপকরন :-'
            '\nমুরগির মাংস :- ১ কেজি'
        '\nআলু মাঝারি সাইজের :- ৫-৬ টা খোসা ছারিয়ে ২ টুকরা করে কাটা'
    '\nপেয়াজ কুচি :- মাঝারি সাইজের ১ টা'
    '\nরসুন ছেঁচা :- ৩-৪ কোয়া'
    '\nপেয়াজ বাটা :- ৩ টে: চামচ'
    '\nরসুন বাটা :- ১ টে: চামচ'
    '\nআদা বাটা :- ১ টে: চামচ'
    '\nহলুদ গুড়া :- ২ চা চামচ'
    '\nমরিচ গুড়া :- ২ চা চামচ'
    '\nকাশ্মিরী মরিচ গুড়া :- ১ চা চামচ'
    '\nজিরা গুড়া :- ১ চা চামচ'
    '\nগরম মসলা গুড়া :- ১ চা চামচ'
    '\nদারচচিনি :- ১ ইঞ্চি ২-৩ টুকরা'
    '\nএলাচি :- ২ টা'
   ' \nতেজপাতা :- ১ টা'
   '\n লবন :- ২ চা চামচ / স্বাদমত'
   '\n  চিনি :- ১ চিমটি'
    '\n তেল :- ১/২ কাপ'
            '\n\n\nপ্রনালী :-'
            '\nমুরগি কেটে ধুয়ে পানি ঝরিয়ে পেয়াজ বাটা, রসুন বাটা আদা বাটা, হলুদ গুড়া, মরিচ গুড়া, কাশ্মিরী মরিচ গুড়া, '
            'জিরা গুড়া, লবন, চিনি ১ টে: চামচ তেল দিয়ে মাখিয়ে রাখুন।'
        'এবার একটি প্যানে তেল গরম করে আলু গুলো লাল করে ভেজে তুলে রাখুন। এখন প্যানে বাকি'
        'তেল দিয়ে পেয়াজ কুচি লাল করে ভেজে তুলে রাখুন এবং ওই তেলে গোটা দারচিনি, এলাচি, তেজপাতা'
    'দিয়ে নেড়ে রসুন ছেঁচা দিন এবং নাড়ুন রসুন টা লাল হলে মাখানো মাংস টা দিয়ে ভাল করে নেড়ে ঢেকে দিন। অল্প আঁচে'
    'রান্না করুন যাতে মাংস থেকে যে পানি বের হবে তাতেই মাংস টা সিদ্ধ হয়ে যায়। মাংস অর্ধেক সিদ্ধ হলে ভেজে রাখা আলু টা দিয়ে '
    'নেড়ে ঢেকে দিন। মাংস সিদ্ধ হয়ে গেলে ভাল করে কষিয়ে পরিমান মতো ঝোল দিয়ে নেড়ে ঢেকে দিন। ঝোল ফুটে উঠলে এবং পরিমান'
    'মতো হলে ভেজে রাখা পেয়াজ ও গরম নসলা গুড়া দিয়ে নেড়ে ঢেকে দিন ফুটে উঠলে চুলা বন্ধ করে দিন এবং ১০-১৫ মিনিট ঢাকা দিয়ে'
    'রাখুন। ১০-১৫ মিনিট পর নামিয়ে পরিবেশন করুন।',
        price: 150.0,
        imageUrl: 'assets/images/checken_curry.jpg'
    ),
    Food(
        id:'p9',
        title: 'Chicken Roast',
        description: 'রোস্ট রান্নার সহজ উপায়:-'
            '\n\nরোস্ট আমরা সবাই কম বেশি খেয়েছি। তা বিয়ে বাড়িতে হোক বা অন্য কোথাও। কিন্তু অনেকেই মনে করে রোস্ট রান্না অনেক ঝামেলা। তাই আপনারা সহজে বাড়িতে '
            'রোস্ট রান্না করেন না। আবার অনেকে রোস্ট কিভাবে রান্না করবেন '
            'তার সঠিক রেসিপি জানেন না। রোস্টর জন্য কিন্তু যে কোন মুরগি নেয়া যায়। দেশি মুরগি, পাকিস্তানি মুরগি বা বয়লার মুরগি। পাকিস্তানি মুরগি দিয়ে রোস্ট করলে বেশি '
            'ভাজতে হয় না কিন্তু বয়লার মুরগি দিয়ে রোস্ট করলে অনেক ভাজতে হয়। কারণ বয়লার মুরগিতে মাংসের পরিমাণ বেশি থাকে। আপনি চাইলে মুরগির মাংসটা চিরে দিতে পারেন আবার না চিরেও করতে পারেন।'
        'আপনি দেড় কেজির একটি মুরগি নিয়ে ৪ টুকরা করে নিতে পারেন বা এর থেকে বেশিও করতে পারেন। মুরগি কেটে ভাল করে ধুয়ে নিবেন। এরপর এটাতে লবন মাখিয়ে '
        'রেখে দিবেন। যাতে লবনটা ভিতর পর্যন্ত যায়। রোস্টের ভেজাল একটাই যে এতে বিভিন্ন প্রকার মসলা লাগে। কিন্তু ২–১ বার করলে এটি আর ভেজাল মনে হবে না।'
        'সব উপকরন যদি হাতের কাছে থাকে তবে খুব সহজে এটি তৈরী করে ফেলতে পারবেন।'
            '\n\n\nউপকরণ:'
            '\n১. ১৫–২০ টি সাদা গোল মরিচ'
        '\n২. ৮–১০ টি এলাচ'
    '\n৩. ১ চা চামচ সাহি জিরা'
    '\n৪. ১ টেবিল চামচ পোস্ত দানা'
    '\n৫. ১/৪ ভাগ জয়ফল'
    '\n৬. ১ চা চামচ জয়ত্রী'
    '\n৭. দারুচিনি'
   '\n ৮. বাদাম'
    '\n৯. কিচমিচ ১৫–২০ টি'
    '\n১০. কাচা মরিচ ৫–৬ টি'
    '\n১২. আলু বোখরা ৪–৫ ট'
    '\n১৩. টক দই'
            '\n\n\nরান্না:'
            '\nরোস্টের রান্না করার জন্য প্রথমে আপনাকে  রোস্ট গুলো ভাজতে হবে। তাই প্রথমে আপনি কড়াইতে পরিমাণ মত বাটার দিয়ে দিবেন। ইচ্ছে হলে আপনি ঘী টাও ব্যবহার দিতে পারেন। এরপর '
            'মাংসগুলো দিয়ে আপনি ঢাকনা দিয়ে দিবেন। '
            'চুলার আচঁটা মিডিয়ামের কম থাকবে। মাংসগুলো আপনি ১০ মিনিটের মত এ পিট ও পিট করে ভেজে নিবেন। মাংসটা একটু কালার করে ভেজে নিবেন যাতে মাংসটা একটু শক্ত হয়। এবার মাংসগুলো একটি '
            'প্লেটে তুলে নিবেন।'

        'আগে যে বাটার ছিল তার সাথে আরও হাফ কাপ পরিমান বাটার দিয়ে দিবেন। হাপ কাপ পরিমান পেয়াজ দিবেন বেরেস্তার জন্য। পেয়াজ গুলো লাল লাল করে ভেজে নিবেন। তারপর বেরেস্তা'
        'নামিয়ে নিবেন। বাটারের মধ্যে ২ টুকরা দারুচিনি, ৪-৫টি এলাচ, এক কাপ পেয়াজ কুচি দিয়ে দিবেন। পেয়াজ টা একটু ভেজে নিবেন।'

   ' ২–৩টি তেজপাতা এবং ৩–৪ টি লবঙ্গ দিয়ে দিবেন। পেয়াজটা যখন লাল হয়ে আসবে তখন মসলা গুলো দিতে থাকবেন। আদা রসুন বাটা ৩ টেবিল চামচ। ১ চা চামচ কাচা জিরা,'
   ' ১ চা চামচ গরম মসলা দিয়ে দিবেন। গরম মসলার মধ্যে অনেক ধরনের মসলা থাকে। এর মধ্যে ১ কাপ পানি দিয়ে কষিয়ে নিবেন। তারপর রোস্টের সব উপকরন গুলো এক সাথে পানি দিয়ে'
    'পেস্ট করে নিবেন। সব উপকরন দিয়ে দিবেন।'

    'তারপর এগুলো ভালোভাবে পানি দিয়ে কষিয়ে নিবেন। মিডিয়াম আচে ১০ মিনিট ধরে কষাবেন অনবরত নাড়ার উপর, যতক্ষন না তেল উপরে উঠে আসবে। এখন দিবেন হাফ কাপ পরিমান '
   ' টক দই। এটা নেড়ে মিলিয়ে দিবেন। তারপর নিবেন ২চা চামচ পরিমান টমেটো কেচাপ। কেচাপের পরিবর্তে টমেটো সসও নিতে পারেন। এটা ভালো করে মিক্স করে ২-৩ মিনিট কষিয়ে নিবেন '
   ' সব মসলা। তারপর আপনি মাংসগুলো দিয়ে দিবেন। ৫ মিনিটের জন্য ঢাকনা দিয়ে দিবেন। '
   ' চুলার আচঁ মিডিয়ামের থেকে কমে রেখে মাংসগুলো কষাতে হবে তেল উপরে ভেসে না উঠা পর্যন্ত। তরপর ১ কাপ পরিমান লিকুইড দুধ দিবেন।'

    'যতটুকু আপনি ঝোল রাখতে চান ততটুকু পরিমান দুধ দিবেন। এতে মাংস সিদ্ধ হয়ে মাখা মাখা থাকবে। দুধ এবং দইয়ের জন্য রোস্টের কালারটা আসবে ভালো করে। দুধটা সব মসলার '
    'সাথে ভালো করে মিশিয়ে নিতে হবে। এক চিমটি পরিমান লেবুর রস দিবেন, ফ্লেভারটা ভাল করার জন্য। এ ছাড়া দই যদি বেশি টক হয় তবে লেবু না দিলেও হবে। ৪-৫ টি কাচা মরিচ এবং ৪-৫ টা '
    'আলু বোখরা দিয়ে দিবেন।'

    'এগুলো ভালোভাবে মিক্স করে ১৫-২০ মিনিটের জন্য ঢেকে দিবেন মিডিয়াম আচেঁ। পুরো পুরি সিদ্ধ হওয়া পর্যন্ত অপেক্ষা করবেন যাতে মাখা মাখা হয়ে যায়। এরপর পেয়াজ বেরেস্তা দিয়ে '
    'দিবেন উপর থেকে। টক কমানোর জন্য ১ চা চামচ চিনি দিয়ে দিতে পারেন। ভাল গন্ধ আনার জন্য গোলাপ জল বা কেওড়া জল দিতে পারেন। যে কোন একটি দিলেও হবে, ২টা না থাকলে। '
    'এটা কিন্তু সব সময় নাড়ার উপর রাখতে হবে যাতে নিচে লেগে না যায়। সব শেষে ১০-১৫ মিনিট ঢাকনা দিয়ে রাখবেন। এরপর পরিবেশন করবেন মজাদার বিয়ে বাড়ির রোস্ট।',
        price: 200.0,
        imageUrl: 'assets/images/chicken_roast.jpg'
    ),
    Food(
        id:'p10',
        title: 'মাছের তরকারি',
        description: 'মাছের তরকারি রান্নার স্পেশাল ও সহজ রেসিপি'
            '\n\n\nআমরা যে কোন মাছের স্পেশাল ভাবে তরকারি রান্না করা শিখব! রুই, কাতল, বোয়াল মাছ , ভেটকি; বা যে কোন মাছ দিয়ে তরকারি রান্না করা যাবে।'
            ' সবজি হিসেবে তরকারির সাথে দিতে পারেন আলু, ঝিঙে; পটল সহ যে কোন তরকারি।'
            '\n\n\nপ্রথমে আমরা মাছের তরকারি রান্নার উপকরন সমুহ জেনে নেব:'
            '\nমাছ নিতে হবে 500 গ্রাম'
    '\nমরিচ বাটা 2 চা চামচ'
    '\nধনে বাটা 2 চা চামচ'
    '\nআদা বাটা 1 চা চামচের চার ভাগের এক ভাগ'
    '\nপেঁয়াজ বাটা 1 চা চামচের চার ভাগের এক ভাগ'
    '\nলবণ নিতে হবে দুই চা-চামচ'
    '\nপটল নিতে হবে চার টি'
    '\nঝিঙ্গা নিতে হবে দুটি'
    '\nপেঁপে সিদ্ধ করে নিতে হবে হাফ কাপ'
    '\nকাকরোল নিতে হবে ২ টি'
    '\nপুঁই শাকের আগা নিতে হবে ২ থেকে ৩ টি'
    '\nডাটা নিতে হবে হাপ কাপ'
    '\nতেল নিতে হবে ১ কাপের মতো'
            '\n\n\nমাছের তরকারি রান্নার নিয়ম:'
            '\nমাছের তরকারি রান্না করার জন্য প্রথমে আধা কেজি পরিমাণ সবজি কেটে নিতে হবে। সব রকমের সবজি না দিয়ে; শুধু মাত্র এক পদ বা দু তিন পদের সবজি নেওয়া যেতে পারে। '
            'শুধু ঝিঙে, পটল দিয়ে; তরকারি রান্না করা যেতে পারে। তবে; তার সাথে কিছু আলু দিলে আরো ভালো হবে।'
        'মাছ হিসেবে রুই, কাতলা, বোয়াল, শোল, গজার, ভেটকি বা যে কোন ধরনের মাছ নেওয়া যেতে পারে। প্রথমে; মাছ সুন্দরভাবে পরিষ্কার করে নিয়ে টুকরা করে কেটে নিতে হবে। এখন; তেলে,'
       'বাটা মসলা ও পানি দিয়ে ভালোভাবে কষিয়ে নিতে হবে।'
            'মশলা কষানো হলে দুই কাপ পানি দিয়ে মাছ ও কিছু লবণ দিয়ে দিতে হবে। এখন ঢেকে দিয়ে ১০ থেকে ১২ '
            'মিনিট ভালোভাবে সেদ্ধ করে নিতে হবে মাছ সিদ্ধ হলে; এবং পানি শুকিয়ে গেলে মাছ উল্টে দিতে হবে। তবে, মাছ ভেজেও নেয়া যেতে পারে।'
            'এখন; দুই কাপ ফুটানো পানি দিয়ে সব তরকারি ঢেলে দিতে হবে। দেখতে হবে লবণ যেন বেশি না হয়! ঢাকনা না দিয়েই ১০ থেকে ১২ মিনিট ফুটিয়ে নিতে হবে। '
            'পরে, ভালো করে সিদ্ধ করতে হবে! তরকারি সিদ্ধ হওয়া মাত্রই নামাতে হবে। তাহলে; সবজির সবুজ রঙ ঠিক থাকবে। চুলা থেকে নামিয়ে সঙ্গে সঙ্গে গরম গরম ভাতের সাথে পরিবেশন করতে হবে।',
        price:100.0,
        imageUrl: 'assets/images/fish_curry.jpg'
    ),
    Food(
        id:'p11',
        title: 'কাচ্চি বিরিয়ানী',
        description: 'কাচ্চি বিরিয়ানী তৈরি করার সব থেকে সহজ রেসিপি'
            '\n\nকাচ্চি বিরিয়ানির নাম শুনলে জিভে জল আসেনা এমন লোকের সংখ্যা খুব কম। বিয়ে বাড়ি হোক বা অতিথি আপ্যায়ন কাচ্চি বিরিয়ানির তুলনা হয়না। নাম শোনা '
            'মাত্রই খেতে ইচ্ছে করে। অনেকের ধারনা কাচ্চি বিরিয়ানি রান্না করা বেশ ঝামেলার ব্যাপার। কিন্তু আপনি চাইলে খুব সহজেই বাড়িতে কাচ্চি বিরিয়ানি রান্না করে ফেলতে পারেন।'
            '\n\n\nউপকরণ:-'
            '\nবাসমতি চাল – ১ কেজি'
        '\nবখাসির মাংস – ২ কেজি'
        '\nবঘি ও তেল -২৫০ গ্রাম'
        '\nবটকদই- দেড় কাপ,'
        '\nবআলু – আধা কেজি,'
    '\nবপেঁয়াজ বাটা – আধা কাপ,'
   '\nব পেঁয়াজের বেরেস্তা – এক কাপ,'
    '\nবআদা বাটা – ২ টেবিল চামচ,'
    '\nবরসুন বাটা – ২ টেবিল চামচ,'
    '\nবপোস্তেদানা বাটা – এক টেবিল চামচ,'
    '\nবদারচিনি – ৮/১০ টুকরো,'
    '\nবএলাচ – ১০/১২টি,'
    '\nবলবঙ্গ – ৬/৭ টি,'
    '\nবতেজপাতা – ৫/৬ টি ,'
    '\nবগোলমরিচ গুঁড়া – এক চা চামচের চার ভাগের এক ভাগ,'
    '\nবধনে গুঁড়া – ১ চা চামচ,'
   '\nব জিরা – ১ চা চামচ,'
    '\nবমরিচ গুঁড়া – এক চা চামচ,'
    '\nবদুধ – ২ কা্‌প,'
   '\nব চিনি – ১ চা চামচ বা স্বাদ অনুযায়ী,'
    '\nবআলুবোখারা – ১০-১২ টি,'
    '\nবকেওড়াজল – ১ টেবিল চামচ,'
   '\nব কিশমিশ – ইচ্ছেমত ,'
    '\nবজর্দার রঙ – সামান্য,'
    '\nবএবং লবণ – স্বাদ অনুযায়ী।'
            '\n\n\nপ্রস্তুত প্রণালী:-'
            '\nপ্রথমে তেল - ঘি, পেঁয়াজ কুচি এবং গরম মসলার অর্ধেক বাদে অন্যান্য বাটা ও গুঁড়া মসলা মেখে মাংস ম্যারিনেট করে রাখতে হবে এক ঘণ্টা।'
        'এবার চুলায় কড়াই বসিয়ে তাতে তিন ভাগের দুইভাগ তেল ও ঘি দিতে হবে। পেঁয়াজ কুচি দিয়ে বেরেস্তা করে অর্ধেক তুলে রাখতে হবে। এবার তেল ও বেরেস্তার মিশ্রণে ম্যারিনেট করা'
        'মাংস ঢেলে অল্প পানি দিয়ে ভুনা ভুনা করে রান্না করতে হবে।'
        'এবার চাল ধুয়ে পানি ঝরিয়ে রাখতে হবে। একটি বড় ডেকচিতে চালের দিগুন পরিমাণ পানি ফুটাতে হবে। অন্য একটি পাত্রে বাকি তেলটুকু ঢেলে তারমধ্যে বাকি গরম মশলা এবং লবণ দিয়ে চাল ঢেলে'
        'নেড়েচেড়ে ভাজতে হবে কিছুক্ষণ। তারপর তাতে গরমপানিটুকু ঢেলে দিতে হবে।'
        'এবার ভাত পুরোপুরি সেদ্ধ না করে আধা সেদ্ধ হয়ে আসলেই চুলা থেকে নামিয়ে রাখতে হবে। এবার বড় একটি সসপ্যানে ভাত তিনভাগ এবং মাংস দুই ভাগ করে এক ভাগ ভাত, এক ভাগ মাংস এভাবে করে '
    'দুই থেকে তিনটি স্তরে ভাত এবং মাংস বিছিয়ে দিতে হবে।'
    'প্রতিটি স্তরে কাঁচামরিচ এবং কেওড়া ছড়িয়ে দিতে হবে। সবার উপরের স্তরে বাকি পেঁয়াজ বেরেস্তা টুকু, ঘি, কেওরাজল, সামান্য জর্দার রঙ এবং কাঁচামরিচ ছড়িয়ে দিয়ে ঢাকনা দিয়ে ১৫-২০ মিনিট মৃদু আঁচে '
        'দমে রাখতে হবে। এবার গরম গরম পরিবেশন করুন মজাদার কাচ্চি বিরানি।',
        price:180.0 ,
        imageUrl: 'assets/images/kacchi.jpg'
    ),
    Food(
        id:'p12',
        title: 'মটন বিরিয়ানি ',
        description: 'মটন বিরিয়ানি রেসিপি:-'
            '\n\n\nমটন বিরিয়ানি রেসিপি উপকরণ: '
            '\nবাসমতি চাল- ৫০০ গ্রাম'
  '\nমটন – ৫০০ গ্রাম'
  '\nপেয়াঁজ বাটা – ৪ টি মাঝারি সাইজের'
  '\nবেরেস্তা – ১ বাটি'
  '\nমিঠা আতর- ৩-৪ ফোঁটা'
 '\n গোলমরিচ গুঁড়ো- ২ চা চামচ'
  '\nআদা বাটা- ২ চা চামচ'
  '\nরসুন বাটা – ৩ চা চামচ'
  '\nটকদই- ২০০ গ্রাম'
  '\nগোটা গরম মশলা – পরিমাণমত'
  '\nজাফরান – পরিমাণ মতো'
  '\nধনে গুঁড়ো – ২ চা চামচ'
  '\nজিরে গুঁড়ো – ১ চা চামচ'
  '\nবিরিয়ানি মশলা – ৩ চা চামচ'
  '\nকাশ্মিরী লঙ্কা গুঁড়ো- ১ চা চামচ'
  '\nদুধ – ১/২ কাপ'
  '\nঘি – পরিমাণ মতো'
  '\nগোলাপ জল- ২ চা চামচ'
  '\nকেওড়া জল – ৩ চা চামচ'
  '\nতেজপাতা – ৪ টি'
 '\n আলু – ৪ টুকরো ( নুন হলুদ দিয়ে ভেজে রাখা).'
  '\nনুন- স্বাদমতো'
  '\nচিনি- স্বাদমতো'
  '\nসাদা তেল- পরিমাণ মতো'
            '\n\n\nপ্রস্তুতি প্রণালী: '
            '\n প্রথমে  হাফ কাপ দুধে কিছুটা জাফরান ভিজিয়ে রাখতে হবে।'
        '\nচাল ভালো করে ধুয়ে ১ ঘন্টা ভিজিয়ে রাখুন।'
        '\nএবার মাংসটা একটা বড় জায়গায় নিয়ে ওর মধ্যে ,'
            '\n\n\n(১) টকদই – ২০০ গ্রাম।'
            '\n(২) আদা বাটা – ২ চা চামচ'
  '\n(৩) রসুন বাটা- ৩ চা চামচ'
  '\n(৪) ধনে গুঁড়ো – ২ চা চামচ'
  '\n(৫) জিরে গুঁড়ো- ১ চা চামচ'
  '\n(৬) কাশ্মীরি লঙ্কা গুঁড়ো – ১ চা চামচ'
  '\n(৭) বিরিয়ানি মশলা – ১ চা চামচ'
  '\n(৮) গোলমরিচ গুঁড়ো – ১/২ চা চামচ'
  '\n(৯) পেয়াঁজ বাটা – পুরোটা'
  '\n(১০) নুন – স্বাদমতো'
  '\nদিয়ে ভালো করে মিশিয়ে  ২ ঘণ্টা রেখে দিতে হবে । '
            '\n  ২ ঘণ্টা পর একটা কড়াইতে  সাদা তেল ও ২ চামচ ঘি দিয়ে গরম করে নিয়ে ওর মধ্যে ২ টি তেজপাতা , গরম মশলা ফোরন দিতে হবে ।'
        '\nএবার আগে থেকে ম্যারিনেট করা মাংস দিয়ে ভালো করে নেড়ে নিতে হবে ।'
        '\nজল বেরিয়ে এলে ১০ মিনিট হাই ফ্লেম – এ  ফোঁটাতে হবে।'
        '\nগ্রেভি ঘন হয়ে এলে ওর মধ্যে ১/২ চা চামচ বিরিয়ানি মশলা, ১/৪ গোলমরিচ গুঁড়ো,'
    'স্বাদমত নুন চিনি দিয়ে মিশিয়ে নিন।'
    '\nএবার ওর মধ্যে আগে থেকে ভেজে রাখা আলু দিয়ে  পরিমাণমত জল দিয়ে পুরো মাংসটা প্রেসার'
    'কুকার এ ঢেলে ৫ টা সিটি দিয়ে মাংস সিদ্ধ হয়ে এলে নামিয়ে নিন ।'
    '\nঅন্য একটি কড়াইতে  পরিমাণ মতোজল, ২ তেজপাতা, গরম মশলা, ১/২ চা চামচ নুন ,'
    '\n১ টেবিল চামচ তেল  দিয়ে ওর মধ্যে আগে থেকে ভেজানো চাল দিয়ে ৭০-৭৫%সিদ্ধ  করে নিতে হবে ।'
            '\n\n\nবিরিয়ানি তৈরির জন্য ভাত মাংস তৈরি । আসুন এবার দেখি বিরিয়ানি দমে কিভাবে বসাবো। '
            '\nএকটা হাঁড়ি বা ডেচকি নিয়ে ওর গায়ে ২ চা চামচ ঘি মাখিয়ে নিন।'
        '\nএবার নিচে মাংসের অর্ধেকটা দিয়ে দিন । ওর ওপর আলতো করে ভাত বিছিয়ে দিন অর্ধেক অংশ। ওপর দিয়ে কিছুটা বেরেস্তা ছড়িয়ে দিন।'
        'একই ভাবে আরো একটি লেয়ার তৈরি করুন ।'
       '\n এবার ওপর দিয়ে বাকি বেরেস্তা , ৩ চা চামচ ঘি, ১ চা চামচ বিরিয়ানি মশলা, ১/২ চা চামচ গোলমরিচ গুঁড়ো,'
    'জাফরান ভেজানো দুধ , ২ চা চামচ গোলাপ জল, ২ চা চামচ কেওড়া জল, কিছুটা মিঠা আতর, ছড়িয়ে দিন ।'
   '\n এবার হাঁড়ির মুখটা ভালো করে বন্ধ করে দিন।'
    '\nগ্যাসে একটা তাওয়া বসিয়ে ওর ওপর হাঁড়ি বা ডেচকি টা বসিয়ে দিন।'
    '\n২০-২৫ মিনিট দমে বসিয়ে রাখুন । ',
        price: 300.0,
        imageUrl: 'assets/images/mutton_biryani.webp'
    ),
    Food(
        id:'p13',
        title: 'নুডুলস ',
        description: 'যেভাবে বাড়িতে নুডুলস রান্না করবেন'
            '\n\nডিম্ নুডলস রান্নার রেসিপি'
            '\n\n\nভোজনরসিকদের মজার খাবার নুডুলস। বাচ্চা থেকে শুরু করে যে কোন বয়সের মানুষের জন্য'
            ' প্রিয় এটি। মজাদার রান্না করা নুডুলস পাওয়া যায় ফাস্ট ফুডসহ স্বনামধন্য রেস্টুরেন্সে। কিন্তু ফাস্ট ফুডের দোকান '
            'ছাড়াও মজাদার নুডুলস '
            'আপনিও রান্না করতে পারেন বাড়িতে। আসুন জেনে নিই যেভাবে বাড়িতে নুডুলস রান্না করবেন।'
            '\n\n\nনুডুলস রান্না করতে যেসব উপকরণ লাগে:'
            '\n\n১। নুডুলস ১ প্যাকেট'
       '\n ২। পেয়াজ'
        '\n৩। কাঁচামরিচ'
        '\n৪। সবজি দিতে পারেন, যেমন আলু, বরবটি, গাঁজর ইত্যাদি।'
    '\n৫। ডিম ২ টা'
    '\n৬। পরিমাণমত লবণ'
    '\n৭। তেল'
            '\n\n\nনুডুলস রান্নার প্রণালীঃ'
            '\n\nএকটা পাতিলে গরম পানি দিয়ে তাপ দিন। পানি বলক উঠলে তাতে নুডুলসকে হাত দিয়ে অর্ধেক করে পানিতে ছেড়ে দিন।'
            ' কিছুক্ষন পর সিদ্ধ হলে প্লাস্টিকের ঝুড়িতে ট্যাপ এর নিচে রেখে পানি ছেড়ে দিয়ে নাড়াচাড়া দিয়ে রেখে দিন ।'

        'আপনি যদি সবজি দিয়ে নুডুলস বানাতে চান তাহলে তা সিদ্ধ করে নিন। সিদ্ধ হয়ে গেলে ঠান্ডা করে নিন। এবার কড়াইতে তেল গরম'
        'করে পেয়াজ+কাঁচামরিচ+লবন দিয়ে সুন্দর তাপ দিতে থাকুন।এরপর পেয়াজ বাদামী রং হলে তাতে দুইটা ডিম ভেঙ্গে ছেড়ে দিন। এখানে মনে রাখতে হবে পেঁয়াজ যেন'
    'পুড়ে না যায়। ডিম দিয়ে নাড়াচাড়া করে ডিমগুলো একটো ভাজা ভাজা হয়ে গেলে সবজিগুলো ডিমের মধ্যে ছেড়ে দিন।'

    'এরপর যা করবেন তা হলো ১০-১২ মিনিট ধরে নাড়াছাড়া করা। সিদ্ধ নুডুলস দিয়ে দিন এবার সবজির ভেতরে। নুডুলস দিয়ে ১৫ মিনিট ধরে নাড়াচাড়া করে নামিয়ে নিন।'
            '\n\n\nচিকেন নুডলস রান্নার রেসিপি'
            '\n\nনুডলস্‌ এবং চিকেন, দুটিই আমাদের বেশিরভাগ মানুষের কাছে প্রিয় দুটি খাবার। এ দুটি খাবারকে এক জায়গায় করে চিকেন নুডলসও করে থাকেন'
            ' এবং তৃপ্তি নিয়ে খেয়ে থাকেন এমন মানুষের সংখ্যা নেহাত কম নয়। আজ আমরা জানব ''চিকেন নুডলস রান্নার রেসিপি। '
            '\n\n\nরান্নার উপকরণ'
            '\nমুরগীর মাংস (কাঁচা এবং হাড়বিহীন)'
  '\nহাফ চা চামচ আদা কুচি'
  '\n১ চা চামচ রসুন কুচি'
  '\n১০০ গ্রাম নুডলস (এগ নুডলস্‌)'
  '\nমুরগি সেদ্ধ করা পানি ১ কাপ পরিমাণ (স্টক)'
  '\nসিকি চা চামচ আজিনোমোটো'
  '\nএক টেবিল পানিতে গুলাতো হাফ চা চামচ এবারুট'
  '\nলবণ (পরিমাণ মতো)'
  '\nগোলমরিচ গুড়ো এক চা চামচ'
  '\n১ টেবিল চামচ কুচোনো পার্সলে পাতা'
  '\nরেপসিড তেল'
            '\n\n\nরান্নার প্রক্রিয়া:-'
            'রান্নার প্রক্রিয়া:-'
            '\n\nপ্রথমে স্বাভাবিক নিয়মেই নুডলস সেদ্ধ করে পানি ঝড়িয়ে নিতে হবে। মুরগি ফালি করে কেটে নিবে। এবার তিন টেবিল চামচ রেপসিড তেল গরম করে তাতে কুচানো মুরগি, '
            'আদা কুচি এবং রসুন কুচির সাথে পরিমাণমতো লবণ, গোলমরিচ এবং আনিনোমোটো এক সঙ্গে মেশাতে হবে। মিশিয়ে ছেড়ে দিন। অন্যদিকে মুরগি অল্পস্বল্প নাড়াচাড়া করে তাতে মুরগি'
            ' সেদ্ধ করে পানি ঢেলে দিতে হবে। পাত্র ঢেকে রাখতে হবে।'
       ' মুরগির টুকরো নরম হলে এবারুটের মিশ্রণ দিয়ে সবটা নাড়তে হবে। ঘন হয়ে এলে নামিয়ে ফেলতে হবে। তারপর, এগ নুডলসে চার টেবিল চামচের মতো চিকেন স্টক মিশিয়ে আবার'
        ' গরম করতে হবে।'
    'ব্যাস, এবার পরিবেশনের পালা। প্রথমে এগ নুডলস ঢালতে হবে, পরে মুরগির মিশ্রণ ঢালতে হবে। পার্সলে পাতা কুচি সহ আরও যা যা আপনার ভালোলাগে তা দিয়ে সাজিয়ে পরিবেশন করে ফেলুন।'
            '\n',
        price: 50,
        imageUrl: 'assets/images/noodles.jpeg'
    ),
    Food(
        id:'p14',
        title: 'পাস্তা',
        description: 'পাস্তার বিভিন্ন রেসিপিঃ ভিন্ন ধরনের পাস্তা রান্নার রেসিপি'
            '\n\n\nপাস্তা কমবেশি সবাই খেতে পছন্দ করেন। পাস্তা ইতালির জনপ্রিয় খাবার। এই খাবারটি পুষ্টিগুনেও ভরপুর। বাচ্চারা এই খবারটি খেতে বেশ মজা পায়।'
            ' কিন্তু পাস্তা একটু স্পাইসি না হলে ঠিক যেন জমে না। অনেকেই বলে বাড়ির পাস্তা রেস্তোরার পাস্তার মতো স্বাদ হয় না। ধরনাটি ভুল। পাস্তার বিভিন্ন রেসিপি রয়েছে '
            'খুব সুস্বাদু এবং বাড়ি বসেই বানিয়ে নিতে পারবেন। তাই আজকের নিবন্ধটিতে '
            'আপনাদের জন্য রইল পাস্তার বিভিন্ন রেসিপি যা সহজেই কম সময়ে বাড়িতে বানিয়ে নিতে পারবেন এবং স্বাদও হবে মজাদার।'
            '\n\n\nসিম্পিল পাস্তা রেসিপিঃ'
            '\n\n\nউপকরণ (Ingredient)'
            '\nএক কাপ পাস্তা'
        '\nঅলিভ অয়েল/ সাদা তেল'
   '\n গাজর কুচি'
    '\nবিনস কুচি'
   '\n ক্যাপসিকাম কুচি'
   ' \nদুটো ডিম'
    '\nএক কাপ পেঁয়াজ কুচি'
   ' \nএকটি টমেটো কুচি'
    '\nকাঁচা লঙ্কা কুচি'
    '\nটমেটো সস'
    '\nস্বাদমতো লবন'
            '\n\n\nপ্রণালী (Method):-'
            '\n*.একটি ফ্রাই প্যানে জল সঙ্গে এক চিমটে লবণ এবং এক টেবিল চামচ তেল দিয়ে গরম করুন।'
  '\n*.জল গরম হয়ে এলে পাস্তা দিয়ে সেদ্ধ করে নেবেন ( ফুটন্ত জলে ৩-৪ মিনিট রাখলে পাস্তা সেদ্ধ হয়ে যাবে)।'
  '\n*.পাস্তা সেদ্ধ হয়ে এলে অন্য একটি পাত্রে ঢেলে রাখবেন ( পাস্তা ঝরঝরে করতে সেদ্ধ পাস্তা ঠাণ্ডা জলে ধুয়ে নিন)।'
  '\n*.এবার ফ্রাই প্যানে অলিভ অয়েল বা সাদা তেল ভালোভাবে গরম করে নিন।'
  '\n*.তেল গরম হয়ে এলে ডিম দুটি ফ্যাটিয়ে পরিমাণ মতো লবণ দিয়ে ভেজে নিন।'
  '\n*.ভেজে রাখা ডিমটি অন্য পাত্রে তুলে রাখবেন। ফ্রাই প্যানে আবার অল্প করে তেল গরম করে পেঁয়াজ কুচি দিয়ে ভেজে নিন।'
 ' \n*.পেঁয়াজ লালচে করে ভাজা হয়ে এলে গাজর কুচি, বিনস কুচি, ক্যাপসিকাম কুচি দিয়ে এবং পরিমাণ মতো লবণ দিয়ে সবজিগুলি ভালোভাবে ভেজে নেবেন।'
  '\n*.সবজিগুলি ভাজা হয়ে আসলে তার মধ্যে টমেটো কুচি এবং কাঁচা লঙ্কা কুচি দিয়ে নাড়াচাড়া করুন ২-৩ মিনিট। এবার ভেজে রাখা ডিম দিয়ে ভালোভাবে নাড়াচাড়া দিয়ে'
    '\n*.সেদ্ধ করা পাস্তা দিয়ে দিন। চাইলে অল্প পরিমাণ লবণ দিয়ে দিতে পারেন।'
  '\n*.এবার পরিমাণ মতো টমেটো সস দিয়ে ভালো করে রান্না করে নিলেই রেডি সিম্পিল পাস্তা। পাস্তাটি যেমন সুস্বাদু তেমন স্বাদও মজাদার হবে।'
            '\n\n\n\n\n\nচিকেন পাস্তা রেসিপি: --'
            '\n\nউপকরণ (Ingredient)'
            '\n\n*এক কাপ পাস্তা'
        '\n* অলিভ অয়েল'
        '\n* এক কাপ ছোট পিস করা মুরগির মাংস'
        '\n* একটি ছোট পেঁয়াজ কুচি'
        '\n* চার কোয়া রসুন কুচি'
        '\n* পরিমাণ মতো ধনেপাতা কুচি'
       ' \n* এক টেবিল চামচ গোলমরিচের গুঁড়ো'
        '\n* দেড় টেবিল চামচ সয়া সস'
       ' \n* দেড় টেবিল চামচ টমেটো সস'
        '\n* স্বাদমতো লবণ'
            '\n\n\nপ্রণালী (Method)'
            '\n\n@ প্রথমে একটি ফ্রাই প্যানে অথবা কড়াইয়ে এক চা চামচ তেল এবং এক চিমটে লবণ দিয়ে জল গরম করে নিন। ফুটন্ত জলে দুই কাপ পাস্তা সেদ্ধ করে নেবেন। '
            'পাস্তা সেদ্ধ হয়ে এলে অন্য পাত্রে তুলে রাখবেন।'
       '\n@  এবার প্যানে তেল গরম করে রসুন কুচি দিয়ে নাড়াচাড়া করে পেঁয়াজ কুচি দিয়ে ভাজতে থাকুন।'
        '\n@ পেঁয়াজ লালচে ভাজা হয়ে এলে ছোট করে পিস করা মাংস এবং স্বাদমতো লবণ দিয়ে ভেজে নেবেন।'
        '\n@ মাংস টুকরো গুলি ভালোভাবে ভাজা হয়ে গেলে টমেটো সস, সয়া সস এবং অল্প পরিমাণ জল দিয়ে মাংস সেদ্ধ করে নেবেন। একটু গ্রেভি রাখবেন তাতে খেতে স্বাদ হবে।'
         '\n@ এবার গ্রেভিতে সেদ্ধ করে রাখা পাস্তা দিয়ে দিন। ৫-৬ মিনিট অল্প আঁচে ঢেকে রাখুন। ৫-৬ মিনিট বাদে গোলমরিচ গুঁড়ো এবং ধনেপাতা কুচি ছড়িয়ে কিছুক্ষণ নাড়াচাড়া '
            'করলেই সুস্বাদু চিকেন পাস্তা রেডি। একটু স্পাইসি করতে চাইলে গোলমরিচের গুঁড়ো দেওয়ার সময় চিজও ছড়িয়ে দিতে পারেন। চিকেন পাস্তাটি গরম গরম পরিবেশন করুন।'
'\nচিজ পাস্তা রেসিপি:---'
'\n\nউপকরণ (Ingredient)'
'\n- এক প্যাকেট পাস্তা'
'\n-একটি পেঁয়াজ কুচি'
  '\n-দুটো ডিম'
  '\n-এক কাপ টমেটো কুচি'
  '\n-এক কাপ ক্যাপসিকাম কুচি'
  '\n-কাঁচা মরিচ ( প্রয়োজনমতো )'
  '\n-ধনেপাতা ( প্রয়োজনমতো)'
  '\n-চার টেবিল চামচ টমেটো সস'
  '\n-চার টেবিল চামচ সয়া সস'
  '\n-আধ কাপ চিকেন (ছোট কুচি)'
  '\n-চিজ পরিমাণমতো'
  '\n-পরিমাণমতো লবণ এবং তেল'
            '\n\n\nপ্রণালী (Method):--'
            '\n1.প্রথমে একটি প্যানে অল্প পরিমাণ তেল এবং লবণ দিয়ে পাস্তা সেদ্ধ করে নেবেন।'
        '2.পাস্তা সেদ্ধ হয়ে গেলে ঠাণ্ডা জলে ধুয়ে রাখবেন।'
        '3.ডিম ফেটিয়ে ভালোভাবে ভেজে নিন।'
        '4.এবার একটি ফ্রাই প্যানে তেল গরম করে পেঁয়াজ কুচি লালচে করে ভেজে রাখুন।'
        '5.এবার ক্যাপসিকাম, টমেটো এবং চিকেন কুচি দিয়ে ভাজতে থাকুন।'
    '6.এবার তাতে ভেজে রাখা ডিম, ধনেপাতা কুচি, কাঁচা মরিচ কুচি এবং সোয়া সস মিশিয়ে নাড়াচাড়া দিন।'
    '7.এবার ভালোভাবে ভাজা হয়ে গেলে, সেদ্ধ করা পাস্তা ঢেলে পরিমাণ মতো লবণ দিয়ে ভালোভাবে নাড়াচাড়া দিন।'
    '8.এবার পাস্তাটি ডিশে ঢেলে চিজ ছড়িয়ে ওভেনে বেক করে নিলেই রেডি চিজ পাস্তা। গরম গরম পরিবেশন করুন।'
            '\n\n\nসচরাচর জিজ্ঞাস্য প্রশ্ন উত্তরঃ'
            '\n\nQ. চিকেন পাস্তায় কতটা পরিমাণ মাংস লাগবে?'
        '\nA. ছোট এক কাপ মতো মাংস লাগবে অথবা আপনার প্রয়োজন মতো দিতে পারবেন।'
    '\nQ. চিকেন পাস্তাতে কি চিজ দেওয়া যাবে?'
        '\nA. হ্যাঁ, চাইলে দিতে পারেন।'
    '\nQ. পাস্তা বানাতে কত সময় লাগে?'
    '\nA.  সব উপকরণ রেডি থাকলে ৩০ থেকে ৪৫ মিনিট মতো।',
        price: 120.0,
        imageUrl: 'assets/images/pastha.jpg'
    ),
    Food(
        id:'p15',
        title: 'Egg Pudding',
        description: 'পুডিং (PUDDING):--'
            '\n\nপুডিং মজাদার একটি খাবার। দুধ-ডিমের মিশ্রণে বানানো এখাবারটি অনেক পুষ্টিকরও। পুডিং বানানোর নিয়মও অনেক সহজ। '
            'একটু কষ্ট করলে বাসায় আপনিও বানাতে পারেন সুস্বাদু খাবার পুডিং। আজকে আপনাদের জন্য পুডিং বানানোর সহজ উপায় বাতলে দেব।'
            '\n\n\nআধা কেজি পরিমাণ পুডিং বানাতে যা যা লাগবেঃ\n'
            '\n\n১. দুধ আধা লিটার'

  '\n\n২. ডিম ৪টি'

  '\n\n৩. চিনি ৫/৭ টেবিল চামচ (চিনি বেশী পছন্দ করলে আরো দিতে পারেন)'

  '\n\n৪. ভেনিলা এসেন্স (যদি থাকে)'

  '\n\n৫. ঢাকনাওয়ালা টিফিন বক্স বা পুডিং বানানোর বাটি'
            '\n\n\n\nপুডিংয়ের দুধ প্রস্তুত করাঃ--'
            '\n\nপুডিং বানানোর জন্য ৫০০ মিলিলিটার/আধা লিটার দুধ নিয়ে হাড়িতে জ্বালিয়ে ৩০০ মিলিলিটার বা অর্ধেক পরিমান করতে হবে। এরপর নামিয়ে ঠাণ্ডা করতে হবে। '
            'ঠাণ্ডা করার সময় দুধ নাড়তে থাকুন। যেনো সর না জমতে পারে। সর জমিয়ে দুধ নষ্ট করবেন না।'
        'খাটি গরুর দুধ হলে ভালো হয়, আর ম্যানেজ করতে না পারলে বাজারের পাস্তুরিত তরল দুধ দিয়ে পুডিং বানাতে পারবেন। আড়ং, প্রাণ, মিল্ক ভিটার দুধ রয়েছে বাজারে।'
            '\n\n\nপুডিংয়ের ডিম প্রস্তুত করাঃ'
            '\nআধা লিটার দুধের পুডিং বানাতে ৩-৪টি ডিমের প্রয়োজন হয়। একটি বাটিতে ডিমগুলো নিয়ে ভালো করে ফেটিয়ে নিন। '
          'এরপরে এতে চিনি দিয়ে আরো কিছুক্ষণ ফেটাতে থাকুন। খুব ভালো করে মিশ্রণ করতে হবে যেনো ডিমের সাদা এবং হলুদ অংশ পৃথক হয়ে না থাকে।'
            '\n\n\nদুধ ও ডিমের মিশ্রণ তৈরিঃ'
            '\nএবার ডিম-চিনির মিশ্রণে ঠাণ্ডা হয়ে যাওয়া দুধ ঢেলে ভালো করে মিশিয়ে নিন। মনে রাখবেন যদি দুধ সামান্য গরম থাকে তবে ডিমকে জমাট করে ফেলবে।'
            ' তাই দুধ খুব ঠাণ্ডা করে নিয়েই মেশাতে হবে। ভ্যানিলা এসেন্স দিতে চাইলে এসময় কয়েক ফোটা দিতে পারেন। '
            'এটা দেয়া মোটেও জরুরি নয়। বরং ক্যামিকেল মুক্ত খেতে চাইলে না দেয়ায় ভালো। এই মিশ্রণ রেখে দিন পুডিং বানানোর পরবর্তী ধাপের জন্য।'
            '\n\n\nটিফিন বাটিতে ক্যারামেল তৈরিঃ'
            '\nযে বাটিতে পুডিং বানাতে চান সেই বাটিতে ক্যারামেল করতে হবে। পুডিং বানানোর জন্য একটি স্টিলের টিফিন বাটি হলে ভালো হয়।'
            ' টিফিন বাটির তলায় কিছু চিনি ছড়িয়ে দিন। প্রায় ১ চা চামচ পরিমান চিনি বাটিতে ছড়িয়ে দু’এক চামচ পানি দিয়ে চুলায় বসিয়ে দিন।'
        'চিনি গলে মিশে শিরা তৈরি হয়ে লাল হয়ে বাটির সর্বত্র ছড়িয়ে পড়বে। এরপর চুলা থেকে নামিয়ে বাটিটি ঠাণ্ডা করুন। দেখবেন গলিত চিনি লাল হয়ে বাটির নিচের পৃষ্ঠে মিশে আছে।'

        'যদি এখনো বুঝতে না পারেন কিভাবে ক্যারামেল বানাবেন, তবে ক্যারামেল বানানোর জন্য দেখুন: সহজে উপায়ে ক্যারামেল বানানোর নিয়ম।'
            '\n\n\nদুধ-ডিমের মিশ্রণ দিয়ে চুলায় বসানোঃ'
            '\nপুডিং বানানোর জন্য এ পর্যায়ের কাজ কিছুটা জটিল। তবে বুঝতে পারলে খুবই সহজ। দুধ-ডিমের মিশ্রণটিকে গরমে সিদ্ধ করতে হবে। এজন্য একটু বড় পাতিল বা সসপ্যান '
            'ধরনের পাত্র নিতে হয়। পাত্রটির ঠিক মাঝে একটি পাতিল রাখার স্ট্যান্ড বসিয়ে দিন। এবার পাত্রে ১/৪ অংশ পানি দিয়ে পূর্ণ করুন। এবার ক্যারামেলযুক্ত ঠাণ্ডা বাটিতে'
            ' দুধ-ডিমের মিশ্রণ ঢেলে ঢাকনা দিয়ে ঢেকে দিন।'
        'একটি বিষয় পরিষ্কার থাকবেন, দুধ-ডিম মিশ্রিত মিশ্রণ জমে পুডিং তৈরি হবে। এটাকে গরমে জমাতে হবে। তাই গরম পানির মধ্যে বসিয়ে তাপ দেয়া হবে।'
    'মিশ্রন ভর্তি টিফিন বাটিটি স্ট্যান্ডের উপর বসান। এবার এমনভাবে পানি দেবেন যেনো তা গরম হয়ে উৎরিয়ে টিফিন বাটির মধ্যে না ঢুকে পড়ে। প্রয়োজন হলে টিফিন বাটিটি ভারী কিছু দিয়ে'
        'চাপা দিন।'
    'এবার পাতিল বা সসপ্যান যা আপনি ব্যবহার করছেন তা চুলায় উঠিয়ে দিন। পাতিল ঢাকনা দিয়ে ঢেকে দিন। এবারে আগুন জ্বালিয়ে দিন। পাত্রটির ঢাকনার উপরে ভারী'
        'কিছু দিয়ে চাপা দিন। যেনো বাষ্প বের হয়ে যেতে না পারে। ৩৫-৪৫ মিনিট জ্বাল হলে আপনার পুডিং হয়ে যাওয়ার কথা।'
            '\n\n\nপুডিং জমানোঃ'
            '\nচুলা থেকে নামানোর আগে একটি কাঠি দিয়ে পুডিং ঠিকমতো হয়েছে কিনা পরীক্ষা করে নিন। এজন্য চিকন কাঠিটি টিফিন বাটির ঢাকনা খুলে পুডিংয়ের মধ্যে ঢুকিয়ে দিন। যদি কাঠিটি '
            'পানিযুক্ত দেখেন, তবে আরো কিছুক্ষণ জ্বাল দিন। হয়ে গেলে নামিয়ে ফেলুন। পানি শুকিয়ে দুধ-ডিমের মিশ্রণ জমে গেলেই পুডিং হয়ে যাবে।'
            '\n\n\nপুডিংয়ের সর্বশেষ ধাপঃ'
            '\nএরপর পুডিংয়ের বাটি একটু ঠাণ্ডা হলে একটি ছড়ানো প্লেটে উল্টো করে দিন। আস্তে আস্তে বাটিটি তুলে নিন। কোনো তাড়াহুড়ো বা ঝাকা-ঝাকি করবেন না। '
            'এমনিতেই বাটি উঠে আসবে। বাটি তুললে দেখবেন পুডিংয়ের ক্যারামেল অংশটি উপরে রয়েছে।'
            '\n\n\nপুডিং পরিবেশনাঃ'
            '\nএবার ঠাণ্ডা করে খেতে চাইলে ফ্রিজে রাখতে পারেন। হয়ে গেলো মজাদার হোম-মেইড পুডিং। কেটে কেটে প্রিয়জনকে যখন পরিবেশন করবেন, নিশ্চয় তারা চমকে যাবে।'
            '\n\n\nপুডিং বানাতে সতর্কতাঃ'
            '\n১. দুধ ঠাণ্ডা করার সময় নাড়তে থাকুন।'
       '\n ২. গরম দুধের মধ্যে ডিম মেশাবেন না।'
    '\n৩. পুডিং বাটি গরম পানির মধ্যে দেয়ার সময় খেয়াল রাখবেন, পানি যেনো বাটির মধ্যে ঢুকে না পড়ে। পানি গরম করলে উঁচু হবে। তাই বাটির মুখ থেকে পানি নিচুতে রাখুন।',
        price: 60.0,
        imageUrl: 'assets/images/pudding.jpeg'
    ),
    Food(
        id:'p16',
        title: 'Vegetables',
        description: "মিক্সড সবজি রান্নার রেসিপি"
            "\n\n\nঅনেকে হোটেলের মিক্সড সবজিটা খুব পছন্দ করে, ভাবে সকালের নাস্তায় বাসাই পরোটা তৈরি করলেও সবজিটা হোটেল থেকে নিয়ে আসতেই হবে। অত সুন্দর "
            "করে বাসাই রান্না করতে পারব না। কিন্তু সেই ধারনাটা একদম ঠিক নয়, আপনি ইচ্ছা করলে বাসাই তৈরি করতে পারবেন হোটেলের সুস্বাদু মিক্সড সবজি। চলুন তাহলে জেনে"
            " নেই হোটেলের মিক্সড সবজিটির রেসিপি।"
            "\n\n\nযে উপকরন লাগবে:--"
            "\nসবজি– ৬-৭ রকমের (আমি নিয়েছিঃ পেঁপে, মিস্টিকুমড়া, মটর,শিম, আলু, ফুলকপি, বেগুণ, কাঁচা টমাটো,"
            " গাজর– সব সবজি কিউব বা ছোট করে কাটা আর সমপরিমাণ করে নিতে হবে। এখানে ১ কাপ করে নেয়া),"
       " \nছোলার ডাল– ১/২ কাপ,"
       "\n পেঁয়াজ কুচি– ২-৩টি বড়,"
    "\nকাঁচামরিচ ফালি– ৮-১০টি,"
   " \nহলুদ+ধনে গুঁড়া– ১ চা চামচ,"
    "\nমরিচের গুড়া+জিরা গুঁড়া– ১/২ চা চামচ,"
    "\nধনেপাতা কুচি– ১ মুঠো,"
       "\n লবণ— স্বাদমতো,"
    "\nতেল– রান্নার জন্যে ২ টেবিল চামচ।"
            "\n\n\nফোঁড়নের জন্যে লাগবে"
            "\n\nথ্যাতো করা রসুন– ৬-৭কোয়া,"
        "\nশুকনামরিচ– ৩-৪টি,"
        "\nঅল্প একটু গরম মসলা,"
    "\nতেজপাতা–২-৩টি,"
    "\nআস্ত জিরা– দেড় চাচামচ এবং"
        "\nতেল-পরিমাণমত।"
            "\n\n\nযেভাবে তৈরি করতে হবে"
            "\nমিক্সড সবজি রান্না করতে হলে প্রথমে ছোলার ডাল ৩০মিনিট আগে থেকে ভিজিয়ে রাখতে হবে। ডাল ফুলে উঠলে ধুয়ে পানি ঝরিয়ে রাখতে হবে।"

        "এবার হাঁড়িতে সব সবজি ও ডাল নিয়ে তাতে অর্ধেক পেঁয়াজ কুচি, কাঁচামরিচ, হলুদ-মরিচ-ধনিয়া-জিরা গুঁড়া,"
    "দুই টেবিল চামচ তেল ও লবণ দিয়ে খুব ভালোভাবে মাখিয়ে নিতে হবে। এমনভাবে মাখাতে হবে, যেন সবজির গায়ে মসলা বেশ ভালোভাবে লেগে যায়। সবজি মাখানো "
    "হলে হাত ধোয়া পানি দিয়ে দিতে হবে। বেশী পানি দেওয়ার দরকার নেয়। সবজি ও পানি সমান-সমান থাকলেই হবে।"

    "এইবার হাঁড়িটি ঢাকনা দিয়ে ঢেকে চুলার আঁচ বাড়িয়ে রান্না করতে হবে। এবার পানি ফুটে উঠলে আঁচ মাঝারি করে রান্না করতে হবে। মাঝে মাঝে আলতো করে কাঠের "
    "খুন্তি দিয়ে নেড়ে দিতে হবে। পেঁপে আর আলু যখন সেদ্ধ হয়ে যাবে তখন ঢাকনা খুলে দিতে হবে। যদি দেখেন, সবজিতে পানি বেশী রয়ে গেছে তখন চুলার আঁচ বাড়িয়ে পানি টানিয়ে নিতে হবে।"
    "পানি টেনে আসলে ধনেপাতা মিশিয়ে হাঁড়িটি চুলা থেকে নামিয়ে ঢেকে রাখতে হবে অথবা এক চুলায় সবজির হাঁড়ি রেখে অন্য চুলায় ফোঁড়নের জন্যে প্যান বসাতে হবে। প্যানে তেল গরম"
    "করে বাকি অর্ধেক পেঁয়াজ ও রসুন দিয়ে ভেজে নিতে হবে। । পেঁয়াজ-রসুন হালকা বাদামি হলে তার মধ্যে আস্ত জিরা, শুকনো মরিচ আস্ত ৩-৪টি, অল্প গরম মসলার গুড়া ও তেজপাতা দিয়ে "
    "একসাথে একটু নেড়ে, এই মিশ্রণটি সবজির ওপর ঢেলে সাথে সাথে ঢাকনা দিয়ে দিতে হবে। হয়ে গেলো হোটেলের স্বাদে সবজি রেসিপিটি।"
    "** সকালের নাস্তায় রুটি-পরোটার সাথে পরিবেশন করুন দারুন মজার বাংলাদেশী হোটেল-স্টাইল মিক্সড সবজি। ভাতের সাথেও পরিবেশন করতে পারেন।",
        price: 60.0,
        imageUrl: 'assets/images/vegetables.jpg'
    ),
    Food(
      id: 'p17',
      title: 'Chotpoti',
      description: '',
      price: 60.0,
      imageUrl: 'assets/images/chotpoti.JPG',

    ),

    Food(
      id: 'p19',
      title: 'Hilsa Vuna',
      description: '',
      price: 250.0,
      imageUrl: 'assets/images/hiIsh_vuna.jpg',

    ),

    Food(
      id: 'p21',
      title: 'Piaju',
      description: '',
      price: 5.0,
      imageUrl: 'assets/images/piaju.jpg',

    ),
    Food(
      id: 'p22',
      title: 'Plain Cake',
      description: '',
      price: 80.0,
      imageUrl: 'assets/cakeimages/orange_found_cake.webp',

    ),

  ];

  List<Food> get items => _items;


// List<Food> get items {
  //   return [..._items];
  // }
// List<Food>get items => _items;
Food FindById(String id){

  return _items.firstWhere((prod) => prod.id==id);

}
  void AddFood(Food value){
    _items.add(value);

  }

}