import 'package:flutter/cupertino.dart';
import 'package:learn_to_cook/biryani_item/b_Food.dart';

class bFoods extends ChangeNotifier{
  List<bFood> _items=[
    bFood(
        id:'p1',
        title: 'Kacchi',
        description: 'কাচ্চি বিরিয়ানী তৈরি করার সব থেকে সহজ রেসিপি'
            '\n\nকাচ্চি বিরিয়ানির নাম শুনলে জিভে জল আসেনা এমন লোকের সংখ্যা খুব কম। বিয়ে বাড়ি হোক বা অতিথি আপ্যায়ন কাচ্চি বিরিয়ানির তুলনা হয়না। নাম শোনা '
            'মাত্রই খেতে ইচ্ছে করে। অনেকের ধারনা কাচ্চি বিরিয়ানি রান্না করা বেশ ঝামেলার ব্যাপার। কিন্তু আপনি চাইলে খুব সহজেই বাড়িতে কাচ্চি বিরিয়ানি রান্না করে ফেলতে পারেন।'
            '\n\n\nউপকরণ:-'
            '\nবাসমতি চাল – ১ কেজি'
            '\nবখাসির মাংস – ২ কেজি'
            '\nবঘি ও তেল -২৫০ গ্রাম'
            '\nবটকদই- দেড় কাপ,'
            '\nবআলু – আধা কেজি,'
            '\nবপেঁয়াজ বাটা – আধা কাপ,'
            '\nব পেঁয়াজের বেরেস্তা – এক কাপ,'
            '\nবআদা বাটা – ২ টেবিল চামচ,'
            '\nবরসুন বাটা – ২ টেবিল চামচ,'
            '\nবপোস্তেদানা বাটা – এক টেবিল চামচ,'
            '\nবদারচিনি – ৮/১০ টুকরো,'
            '\nবএলাচ – ১০/১২টি,'
            '\nবলবঙ্গ – ৬/৭ টি,'
            '\nবতেজপাতা – ৫/৬ টি ,'
            '\nবগোলমরিচ গুঁড়া – এক চা চামচের চার ভাগের এক ভাগ,'
            '\nবধনে গুঁড়া – ১ চা চামচ,'
            '\nব জিরা – ১ চা চামচ,'
            '\nবমরিচ গুঁড়া – এক চা চামচ,'
            '\nবদুধ – ২ কা্‌প,'
            '\nব চিনি – ১ চা চামচ বা স্বাদ অনুযায়ী,'
            '\nবআলুবোখারা – ১০-১২ টি,'
            '\nবকেওড়াজল – ১ টেবিল চামচ,'
            '\nব কিশমিশ – ইচ্ছেমত ,'
            '\nবজর্দার রঙ – সামান্য,'
            '\nবএবং লবণ – স্বাদ অনুযায়ী।'
            '\n\n\nপ্রস্তুত প্রণালী:-'
            '\nপ্রথমে তেল - ঘি, পেঁয়াজ কুচি এবং গরম মসলার অর্ধেক বাদে অন্যান্য বাটা ও গুঁড়া মসলা মেখে মাংস ম্যারিনেট করে রাখতে হবে এক ঘণ্টা।'
            'এবার চুলায় কড়াই বসিয়ে তাতে তিন ভাগের দুইভাগ তেল ও ঘি দিতে হবে। পেঁয়াজ কুচি দিয়ে বেরেস্তা করে অর্ধেক তুলে রাখতে হবে। এবার তেল ও বেরেস্তার মিশ্রণে ম্যারিনেট করা'
            'মাংস ঢেলে অল্প পানি দিয়ে ভুনা ভুনা করে রান্না করতে হবে।'
            'এবার চাল ধুয়ে পানি ঝরিয়ে রাখতে হবে। একটি বড় ডেকচিতে চালের দিগুন পরিমাণ পানি ফুটাতে হবে। অন্য একটি পাত্রে বাকি তেলটুকু ঢেলে তারমধ্যে বাকি গরম মশলা এবং লবণ দিয়ে চাল ঢেলে'
            'নেড়েচেড়ে ভাজতে হবে কিছুক্ষণ। তারপর তাতে গরমপানিটুকু ঢেলে দিতে হবে।'
            'এবার ভাত পুরোপুরি সেদ্ধ না করে আধা সেদ্ধ হয়ে আসলেই চুলা থেকে নামিয়ে রাখতে হবে। এবার বড় একটি সসপ্যানে ভাত তিনভাগ এবং মাংস দুই ভাগ করে এক ভাগ ভাত, এক ভাগ মাংস এভাবে করে '
            'দুই থেকে তিনটি স্তরে ভাত এবং মাংস বিছিয়ে দিতে হবে।'
            'প্রতিটি স্তরে কাঁচামরিচ এবং কেওড়া ছড়িয়ে দিতে হবে। সবার উপরের স্তরে বাকি পেঁয়াজ বেরেস্তা টুকু, ঘি, কেওরাজল, সামান্য জর্দার রঙ এবং কাঁচামরিচ ছড়িয়ে দিয়ে ঢাকনা দিয়ে ১৫-২০ মিনিট মৃদু আঁচে '
            'দমে রাখতে হবে। এবার গরম গরম পরিবেশন করুন মজাদার কাচ্চি বিরানি।',
        // price: 150.0,
        imageUrl: 'assets/images/kacchi.jpg'
    ),
  bFood(
  id: 'p2',
  title: 'গরুর মাংস বিরিয়ানি',
  description: 'গরুর মাংস দিয়ে সহজে বিরিয়ানি রান্নার রেসিপি'
      '\n\n\nরেসিপি জানা থাকলে গরুর মাংসের বিরিয়ানির থেকে সহজ রান্না আর হয় না। এর '
      'স্বাদ তো প্রায় সবারই জানা। সুস্বাদু এই খাবারটি রাঁধতে চাইলে জেনে নিন সহজ রেসিপি-'
      '\n\n\nউপকরণ:--'
      '\nগরুর মাংস- ১ কেজি'
 '\n পোলাওর চাল- ১ কেজি'
 '\n বিরিয়ানি মসলা- ৩ টেবিল চামচ'
 ' \nএলাচ ও দারুচিনি বাটা- ১ টেবিল চামচ'
 '\n আদা বাটা- ১ টেবিল চামচ'
 '\n রসুন বাটা- ১ টেবিল চামচ'
  '\nপেয়াজকুচি- ১ কাপ'
  '\nতেল- ১ কাপ'
 '\n আলু- ১ কাপ (কিউব করে কাটা)'
 '\n কিচমিচ- ১০-১৫ টি'
  '\nপানি- যতটুকু চাল তার দ্বিগুণ পানি লাগবে'
  '\nতেজপাতা- ৩ টি'
  '\nলবণ- স্বাদমতো'
 '\n জিড়া গুড়া- ১ টেবিল চামচ'
  '\nগোলাপ জল- ১ চামচ'
  '\nকেওরা জল- ১ চামচ।'
      '\n\n\nপ্রণালি:--'
      '\nপ্রথমে মাংসকে ছোট ছোট টুকরো করে ধুয়ে নিতে হবে। এখন যে পাত্রে চাল ও মাংস জায়গা হবে এমন একটি বড় পাত্র নিতে হবে। পাত্রটি চুলায় বসিয়ে তেল দিয়ে গরম করে নিতে হবে।'
      ' তেল গরম হয়ে আসলে পেঁয়াজকুচি ও তেজপাতা দিয়ে দিতে হবে।'
 ' পেঁয়াজ যখন হালকা বাদামি কালার আসবে তখন আদা বাটা, রসুন বাটা, জিড়ার গুঁড়া, ও স্বাদমতো লবণ দিয়ে একটু কষিয়ে নিতে হবে। যখন মসলা কষে আসবে তখন ধুয়ে মাংস দিয়ে সেদ্ধ হওয়া পর্যন্ত'
  'অপেক্ষা করতে হবে। যখন মাংস মোটামুটি সিদ্ধ হয়ে আসবে তখন আলু দিয়ে একটু সিদ্ধ করে নিতে হবে।'
  'তারপর বিরিয়ানি মসলা দিয়ে একটু নাড়তে হবে। এখন পোলাওর চাল ধুয়ে এই মাংস ও আলুর মধ্যে দিয়ে একটু ভাজতে হবে। যখন পানি শুকিয়ে চাল ভাজা ভাজা হবে তখন আগে থেকে করে রাখা গরম পানি '
  'দিয়ে দিতে হবে।'
 ' যখন গরম পানি কমে মাখা হয়ে আসবে তখন চুলার আঁচ কমিয়ে ধমে রাখতে হবে।'
 ' এরপর এই চালের উপর গোলাপ জল ও কেওরা জল দিয়ে চালগুলোকে নেড়ে আবার ২ মিনিটের মত দমে রাখতে হবে। ২ মিনিট পর চুলা বন্ধ করে আধা ঘণ্টা অপেক্ষা করতে হবে। এরপর পরিবেশনের পালা।',
  imageUrl: 'assets/biryaniimages/beef_biryani.webp',
  ),
    bFood(
      id: 'p3',
      title: 'চিকেন বিরিয়ানী',
      description: 'উপাদানগুলি:--'
          '\n\n\n ৬ জনের জন্য -'
      '\nএকটা চিকেন গোটা'
      '\nপরিমাণ মত টক দই, লবণ, বিরিয়ানির মশলা, সয়াবিন তেল'
    '\nদুই চামচ ধনিয়া গুড়া'
   '\n দুই চামচ আদা ও রসুন বাটা'
    '\n2 টা আলু মোটা করে কেটে নিতে হবে।'
   '\n এক কেজি পোলাও এর চাল'
   ' \n1 চামচ কেওড়া পানি'
    '\nএক চামচ জিরা গুঁড়া'
    '\nএক কাপ দুধ'
    '\nদের কাপ পিয়াজ'
          '\n\n\nধাপগুলি--'
          '\n1.প্রথমে চিকেন ছোটো করে টুকরো করে কেটে নিতে হবে। তারপর উপরের সব মসলা গুলো মিশিয়ে আধা ঘণ্টা ম্যারিনেট করে রাখতে হবে।'
          '\n2.ম্যারিনেট করা চিকেন কড়াই বসিয়ে তাতে ঢেলে দিয়ে ভালো করে কষিয়ে নিতে হবে।'
          '\n3.কষানো চিকেনে পানি দিয়ে সিদ্ধ করে নিতে হবে। তারপর তেলের ওপর উঠে আসলে গ্যাস বন্ধ করে দিতে হবে'
          '\n4.দুই টা আলু মোটা করে কেটে অরেঞ্জ ফুড কালার দিয়ে ভেজে নিতে হবে। অল্প পানি দিয়ে সিদ্ধ করে নিতে হবে।'
          '\n5.এইবার একটা পোলাও এর জন্যে পাত্র বসিয়ে তাতে তেল ও ঘি মিশিয়ে তাতে পরিমান মতো পিয়াজ কুচি দিয়ে ভেজে পোলাও এর চাল দিয়ে ভেজে নিতে হবে।'
          '\n6.এইবার ওর মধ্যে আদা রসুন বাটা অল্প, এলাচ,দারুচিনি ও তেজপাতা ও আলু বোখারা দিয়ে চাল কষিয়ে নিতে হবে।'
               'তারপর পানি দিয়ে সিদ্ধ করে নিতে হবে।'
          '\n7.পোলাও রান্না হয়ে গেলে তারমধ্যে চিকেন ও আলু দিয়ে ভালো করে মিশিয়ে নিন। তারপর ছোটো কাপ এর এক কাপ দুধ নিয়ে তাতে অরেঞ্জ ফুড কালার ও এক চামচ কেওড়া জল দিয়ে মিশিয়ে নিতে হবে।'
            'উপর এ কিছু পিয়াজ বেরেস্তা দিয়ে বিরিয়ানি মশলা দিয়ে দুধ ও কেওড়া পানি দিয়ে ঢাকা দিয়ে দমে রাখতে হবে'
          '\n8.এইবার একটা সুন্দর সার্ভিং ডিস এ ঢেলে পরিবেশন করেন চিকেন বিরিয়ানী।',
      imageUrl: 'assets/biryaniimages/chicken biryani1.webp',
    ),
    bFood(
      id: 'p4',
      title: 'িংড়ি আলুর ডিম বিরিয়ানি',
      description: 'চিংড়ি আলুর ডিম বিরিয়ানি '
          '\n\n\nউপাদানগুলি--'
          '\n ৪-৫ জনের জন্য।,'
     ' ১ কেজি পোলাওয়ের চাল,'
      '১২ পিস গলদা চিংড়ি,'
   ' ৬ টা সিদ্ধ ডিম,'
    '৩ টা বড় সাইজের আলু,'
    '১ প্যাকেট রাঁধুনি বিরিয়ানি মসলা,'
    '৩ চা চামচ আদা ও রসুন বাটা,'
   ' ৩-৪ টা আস্ত এলাচ, দারচিনি, লবঙ্গ ও তেজপাতা'
    '৪ চা চামচ ঘি'
   ' ১ কাপ টক দই'
   ' ১ কাপ ঘন দুধ'
   ' ১০-১৫ টা আস্ত কাঁচামরিচ,'
   ' ২ কাপ পিঁয়াজ কুচি,'
    '১ কাপ গাজর কুচি,'
    '১ কাপ ধনেপাতা কুচি,'
    'পরিমাণ মতো তেল, লবণ ও পানি।'
          '\n\n\nপ্রস্তুত প্রণালীঃ--'
          '\n1.প্রথমেই একটি কড়াইয়ে পরিমান মত তেল ও ঘি দিয়ে এর মধ্যে পেঁয়াজ কুচি ও গোটা মসলা দিয়ে ভালো করে বাঁদামী রং এ ভেজে নিতে হবে। এরপর কাঁচামরিচ দিয়ে এরমধ্যে আদা ও রসুন বাটা এবং '
          'বিরিয়ানি মসলা দিয়ে ভালো করে কষিয়ে নিতে হবে।'
          '\n2.এরপর ফেটানো টক দই ও লিকুইড দুধ দিয়ে ভালো করে নেড়ে এরমধ্যে আগে থেকে লবণ ও হলুদ দিয়ে ভেজে রাখা চিংড়ি মাছ ও ভাজা আলু দিয়ে ভালো করে কষিয়ে রান্না করে নিতে হবে।'
          '\n3.এবার অন্য একটি পাত্রে তেল দিয়ে এর মধ্যে গোটা মশলা ও পেঁয়াজ কুচি দিয়ে ভেজে নিতে হবে। পোড় আগে থেকে দূরে রাখা পোলার চাল ও গাজর কুচি একসাথে দিয়ে ভাজতে হবে। তারপর পরিমাণমতো পানি'
          ' দিয়ে পোলার চাল গুলো হাল্কা সেদ্ধ করে নিতে হবে।'
          '\n4.পোলার চাল হালকা সিদ্ধ হলে এর মধ্যে চিংড়ি মাছে তরকারিতে ঢেলে বিয়ে মেরে অল্প আঁচে রান্না করে নিতে হবে। পর বিরিয়ানি নামানোর আগে ধনেপাতা কুচি ও'
          ' ঘি দিয়ে নামিয়ে নিলেই রেডি গরম গরম মজাদার চিংড়ি মাছের ডিম বিরিয়ানি।'
          '\n',
      imageUrl: 'assets/biryaniimages/chindi_biryani.webp',
    ),
    bFood(
      id: 'p5',
      title: 'পাচঁমিশালি ডালের ভুনা খিচুড়ি',
      description: 'বিভিন্ন প্রকার ডালের ভুনা খিচুড়ি রান্না করতে যা যা লাগবে--'
          '\n\n\nযে কোন সুগন্ধি চাল ২ কাপ(২৫০ গ্রাম মাপের কাপ)'
  '\nমসুর ডাল ১ মুষ্টি'
  '\nমুগ ডাল ১ মুষ্টি(ভেজে নিতে হবে)'
  '\nবুটের ডাল ১ মুষ্টি(৩/৪ ঘন্টা ভিজিয়ে রাখতে হবে)'
 '\n খেসারি ডাল ১ মুষ্টি'
 '\n মাসকালাইয়ের ডাল ১ মুষ্টি(ভেজে নিতে হবে)'
  '\n\n[সব ডাল মিলে যেনো চালের অর্ধেক পরিমাণ হয় অর্থাৎ এক কাপ মত বা ২৫০ গ্রাম]'
 '\n লবণ স্বাদমতো'
  '\nমরিচ গুঁড়া ২ চা চামচ(ঝাল কম খেলে কমিয়ে দিতে হবে)'
 '\n হলুদ গুঁড়া আধা চা চামচ'
 '\n ধনিয়ার গুঁড়া ১ চা চামচ'
 '\n জিরার গুঁড়া- ১ চা চামচ'
  '\nগরম মশলার গুড়া-আধা চা চামচ'
  '\nরসুন বাটা- ১ চা  চামচ'
 '\n আদা বাটা- ১ চা চামচ'
 ' \nকাঁচা মরিচ-৬/৭ টি(মাঝ দিয়ে অল্প চিরে নিতে হবে)'
  '\nদারুচিনি- ২ টুকরা'
 '\n সাদা/সবুজ এলাচ- ২টি'
  '\nলবঙ্গ ও গোলমরিচ- ৩/৪টি করে'
 ' \nতেজপাতা- ১টি'
 ' \nপেঁয়াজ কুচি- ১ কাপ'
  '\nতেল- ১ কাপ'
  '\nঘি- ১ টেবিল চামচ(না থাকলে তেলের পরিমাণ টা একটু বাড়িয়ে নিতে হবে)'
          '\n\n\nপাচঁমিশালি ডালের ভুনা খিচুড়িপ্রস্তুত প্রণালী-'
          '\n#প্রথমে ৩ ঘন্টা আগে ভিজিয়ে রাখা বুটের ডালের মাঝে বাকি সব ডাল দিয়ে আরো ৩০ মিনিট ভিজিয়ে রাখতে হবে।'

      '#৩০ মিনিট পর ডালের সাথে চাল মিশিয়ে ভাল করে ধুয়ে চালনি/ঝাঝরি তে রেখে দিতে হবে পানি ঝড়ানোর জন্য।'
    '#এবার কড়াইয়ে/প্যানে তেল দিয়ে তাতে এলাচ,দারুচিনি, গোলমরিচ,তেজপাতা,লবঙ দিয়ে ২০/৩০ সেকেন্ড এর মত নেড়ে তাতে পেয়াজ কুচি দিয়ে ভাজতে হবে।পেয়াজ ব্রাউন কালার হয়ে আসলে এতে'
    'আদা বাটা,রসুন বাটা,মরিচ গুড়ো,লবণ,হলুদ ও এক কাপ পানি দিয়ে মশলা গুলোকে ভাল করে কষিয়ে নিতে হবে।মশলা থেকে তেল ছেড়ে আসতে ধরলে তাতে ধুয়ে রাখা চাল ডাল ও কাচা মরিচ  দিয়ে ৬ মিনিট '
    'এর মত ভাজতে হবে অনবরত নেড়ে নেড়ে।খেয়াল রাখতে হবে যেনো লেগে/পুড়ে না যায়।'
   ' #ভাজা হয়ে গেলে চাল ডালের দ্বিগুন পানি অর্থাৎ ৬ কাপ পানি দিয়ে চুলার তাপ বাড়িয়ে বলক ওঠা পর্যন্ত ঢেকে রান্না করতে হবে।বলক উঠলে চুলার তাপ কমিয়ে ঢাকনা তুলে ভাল করে নেড়ে দিয়ে লবন চেক'
   ' করে নিতে হবে এবং ঢেকে রান্না করতে হবে আরো ৫ মিনিট।৫ মিনিট পর ঢাকনা তুলে আলতো করে নেড়ে দিয়ে চুলার আচ কমে রেখে ঢেকে রান্না করতে হবে আরো ১০ মিনিট।১০ মিনিট পর উপরে ঘি'
    'ছড়িয়ে ৪/৫ মিনিট ঢাকনা দিয়ে ঢেকে দমে রাখতে হবে।দম দেওয়া হয়ে গেলে নামিয়ে পরিবেশেন করতে গবে গরম গরম।'
    '\n\n\nবিঃদ্রঃ সেম রেসিপি ফলো করে মসুর ডালের ভুনা খিচুড়ি রান্না করা যাবে।সেক্ষেত্রে ডাল চালের অর্ধেক নিতে হবে।আবার চাইলে একই রেসিপি ফলো করে মুগ ডাল,মসুর ডাল ও বুটের ডাল দিয়েও এই ভুনা '
   ' খিচুড়ি রান্না করা যাবে।এক্ষেত্রেও তিন প্রকার ডাল মিলে চালের অর্ধেক পরিমাণ নিতে হবে।',
      imageUrl: 'assets/biryaniimages/dal_khichuri.jpg',
    ),

    bFood(
        id: 'p6',
        title: 'শাহী বিফ বিরিয়ানির',
        description: 'বাসমতী চালে শাহী বিফ বিরিয়ানির দারুণ সহজ রেসিপি-'
            '\n\n\nউপকরণ--'
            '\n- গরুর মাংস ১/২ কেজি - বাসমতএ চাল ২ কাপ - কালো এলাচ ২ টা - সাদা এলাচ ৪-৫ টা - লং ৫-৬ টা - গোলমরিচ ৮-১০ টা - কাবাব চিনি ৩-৪ টা '
            '- দারুচিনি ১ টা - তেজপাতা ১-২ টা - ধনে গুঁড়ো ১/২ চা চামচ - আস্ত জিরা ১/২ চা চামচ - জয়ফল-জয়ত্রি গুঁড়ো ১/২ চা চামচ - মরিচ গুঁড়ো ১/২ চা চামচ '
            '- লবণ স্বাদ মত - দই ১/২ কাপ - কেওরা জল ২ চা চামচ - তেল পরিমাণ মত - পেঁয়াজ কুচি ১/২ কাপ - আদা বাটা ১ টেবিল চামচ - রসুন বাটা ১/২ টেবিল চামচ - '
            'কাঁচা মরিচ ৭/৮ টা - ঘি ২-৩ চা চামচ - লেবুর রস ১ টেবিল চামচ - পিঁয়াজ বেরেস্তা অল্প - চিনি সামান্য'
            '\n\n\nপ্রণালি--'
            '\n-প্যানে তেল গরম করে পিঁয়াজ কুচি সোনালি করে ভেজে মাংস সহ (দই,চিনি,কেওরা জল,ঘি,পিয়াজ বেরেস্তা,কাঁচামরিচ বাদে) সব মশলা দিয়ে কষিয়ে রান্না করতে হবে।'
            '\n-রান্না শেষের দিকে দই, চিনি দিয়ে আরও কিছুক্ষণ রান্না করে ঝোল মাখা মাখা হলে নামিয়ে ফেলতে হবে।'
            '\n-এবার অন্য একটি প্যানে বা রাইস কুকারে বাসমতী চাল,স্বাদমত লবণ,২ চা চামচ ঘি, লেবুর রস আর পরিমান মত পানি দিয়ে রাইস রান্না করে নিতে হবে।'
            '\n-রাইস রান্না হয়ে গেলে কিছু রাইস তুলে নিয়ে বীফ ঢেলে দিয়ে পিঁয়াজ বেরেস্তা,ঘি,কাঁচামরিচ ছিটিয়ে দিয়ে বাকি রাইসটা ওপর থেকে দিয়ে দমে দিতে হবে ২০-৩০ মিনিটের মত । '
            'রাইস কুকারে করলে অন করে দিতে হবে ।'
            '\n-২০-৩০ মিনিট পর রাইসটা হাল্কা মিক্স করে নিলে হয়ে যাবে অনেক মজার বিফ বিরিয়ানি । চুলায় করলে কম আঁচে দম দিতে হবে ।',
        imageUrl: 'assets/biryaniimages/shahi_biryani.webp'
    ),

    bFood(
      id: 'p7',
      title: 'ইলিশের কাচ্চি বিরিয়ানি',
      description: 'ইলিশের কাচ্চি বিরিয়ানি রান্নার সহজ রেসিপি--'
          '\n\n\nউপকরণ--'
          '\nইলিশ: ১ টি (৮ পিস)'
     '\n টক দই: ৩/৪ কাপ'
  ' \n পেঁয়াজ বেরেস্তা: ১/২কাপ'
  ' \n লবণ: স্বাদমত'
    '\nআদা বাটা: ১ চা চামচ'
   ' \nলাল মরিচের গুঁড়া: ২ চা চামচ'
    '\nকাচামরিচ ফালি: ৫-৪পিস'
    '\nচিনি: ১চা চামচ'
    '\nগরম মশলা একসাথে গুঁড়া/বাটা: ১চা চামচ'
    '\nসরিষার তেল: ১/৪ কাপ'
    '\nঘি: ২ টেবিল চামচ'
    '\nজর্দ্দার/ জাফরান রং: ১/৪চা চামচ'
    '\nমাছ পরিষ্কার করে ধুয়ে পানি ঝরিয়ে নিন। মাছ বাদে সব উপকরণ একসাথে ব্লেন্ড করে মাছের সাথে মিশিয়ে কমপক্ষে ১ ঘন্টা মেরিনেড করে রাখুন। একটি বড় প্যানে মেরিনেড করা মাছ বিছিয়ে রাখুন।'
          '\n\n\nচাল প্রস্তুত প্রণালি---'
          '\nপোলাউ বা বাসমতি চাল: ৪কাপ'
      '\nআদার রস: ১ টেবিল চামচ'
     '\n দারুচিনি: ২ টুকরা,'
      '\nএলাচ: ৩ টি,'
   '\n তেজপাতা: ২ টি,'
   '\n শাহি জিরা: ১ চা চামচ,'
   '\n কাচা মরিচ: ৫ টি'
   '\n লবণ: স্বাদমত'
  ' \n গরম ফুটন্ত পানি: ৭কাপ'
    '\nচাল ধুয়ে পানি ঝড়িয়ে নিন। একটি প্যানে তেল গরম করে সব মশলা দিয়ে চাল দিয়ে ২ মিনিট ভাজুন। পানি চালে দিয়ে ভাল করে নেড়ে দিন। লবণ দেখুন। কয়েকবার ফুটে উঠলে আর চাল পানির সমান হলে,'
          ' ভাল করে নেড়ে ঢাকনা দিয়ে চুলার তাপ একদম কমিয়ে দিন। ১৮ মিনিট এভাবে রাখুন। ১৮ মিনিট পর চুলা বন্ধ করুন। ঢাকনা খুলে ভাত নেড়ে দিন।'
          '\n\n\nবিরিয়ানী প্রস্তুত প্রণালি--'
          '\nপেঁয়াজ বেরেস্তা: ১/২কাপ'
  '\nগুঁড়াদুধ: ১/৪কাপ'
 ' \nঘি: ২ টেবিল চামচ'
 '\nজর্দ্দার রং: সামান্য (১/২ কাপ দুধে ভিজানো)'
          '\n\n\nমাছ বিছানো হাড়িতে মাছের উপর অর্ধেক বেরেস্তা, দুঁড়াদুধ ছিটিয়ে দিন। তার উপর অর্ধেক ভাত দিন। আবার বাকি বেরেস্তা, গুঁড়াদুধ দিয়ে ভাত দিন। উপরে ঘি ও দুধের রঙ ছিটিয়ে ভাল করে ঢাকনা দিয়ে দিন। আটার দলা দিয়ে ঢাকনার চারপাশ মুড়ে দিন যাতে ভাপ না বের হতে পারে। ৫ মিনিট মাঝারি আঁচে রান্না করুন। তারপর অল্প আচে দমে রাখুন ৩০ মিনিট। তাওয়া গরম করে তার উপর আরো ২০ মিনিট রাখতে পারেন।'
          ' চুলা বন্ধ করে বিরিয়ানির পাত্রটি পরিবেশনের পাত্রে উল্টিয়ে ঢালুন। গরম গরম পরিবেশন করুন মজাদার ইলিশের কাচ্চি বিরিয়ানি।',
      imageUrl: 'assets/biryaniimages/hilsha_biryani.webp',
    ),
    bFood(id: 'p8',
        title: 'গরুর মাংসের ভুনা খিচুড়ি',
        description: 'গরুর মাংসের ভুনা খিচুড়ি রান্না করতে যা যা লাগবে--'
            '\nগরুর মাংস- ১ কেজি (চর্বিছাড়া মাংস হাড়সহ ছোট করে কাটা)'
  '\nযে কোন সুগন্ধি চাল- আধা কেজি'
  '\nমুগ ডাল ১ কাপ'
 '\n মসুর ডাল ১ কাপ'
  '\nলবণ স্বাদমতো'
 '\n মরিচ গুঁড়া ১ টেবিল চামচ(ঝাল কম খেলে কমিয়ে দিতে হবে)'
 '\n হলুদ গুঁড়া দেড় চা চামচ'
 '\n ধনিয়ার গুঁড়া ১ চা চামচ'
 ' \nজিরার গুঁড়া- ১ চা চামচ'
 '\n গরম মশলার গুড়া-আধা চা চামচ'
 '\n রসুন বাটা- ১ টেবিল  চামচ'
 '\n আদা বাটা- ১ টেবিল চামচ'
 '\n সরিষার তেল ১ টেবিল চামচ'
 ' \nলেবুর রস ১ চা চামচ(এটা অপশনাল,দিলে মাংস তারাতাড়ি সিদ্ধ হবে)'
  '\nদারুচিনি- ২/৩ টুকরা'
 '\n সাদা/সবুজ এলাচ- ৩/৪টি'
 '\n লবঙ্গ ও গোলমরিচ- ৩/৪টি'
  '\nকালো এলাচ মাঝারি ১ টি'
  '\nতেজপাতা- ২টি'
  '\nপেঁয়াজ কুচি- দেড় কাপ'
 '\n তেল- দেড় কাপ'
  '\nঘি- ২ টেবিল চামচ(না দিলেও চলবে)'
            '\n\n\nগরুর মাংসের ভুনা খিচুড়ি রান্নার পদ্ধতিঃ--'
            '\n#প্রথমে মাংস ভাল করে ধুয়ে নিন।'
       ' #ধোয়া মাংসে সব গুড়া ও বাটা মশলা,সরিষার তেল এবং এক চামচ লেবুর রস দিয়ে ভাল করে মাখিয়ে  নিয়ে  ১০ মিনিট অপেক্ষা করুন।'
        '#মুগ ডাল তাওয়ার টেলে/ভেজে নিতে হবে।এরপর মসুর ডাল,চাল ও টেলে নেওয়া ডাল সব একসাথে ভাল করে ধুয়ে পানি ঝরানোর জন্য কিছুক্ষন একপাশে রেখে দিন।'
       ' #এবার চুলায় প্যান বসিয়ে সয়াবিন তেল দিয়ে তাতে সব গোটা মশলা ও পেয়াজ ভেজে নিয়ে মাখিয়ে রাখা মাংস দিয়ে মাঝারি আঁচে ঢেকে রান্না করতে হবে ১০ মিনিট এর মত। কোন পানি দেওয়ার '
       ' প্রয়োজন নেই কেননা মাংস থেকেই পানি বের হবে।১০ মিনিট পর ঢাকনা তুলে ভাল করে মাংস কষিয়ে নিতে হবে।কষাতে কষাতে পানি শুকিয়ে গেলে ১ কাপ পানি দিয়ে আবার আধা ঘণ্টা প্যান ঢেকে রান্না '
        'করতে হবে।'
        '#মাংস প্রায় সেদ্ধ হয়ে গেলে ধুয়ে রাখা চাল ঢেলে দিন।মাঝারি আঁচে ৭/৮ মিনিট মাংস সহ চাল ডাল ভাল করে মিশিয়ে নিতে হবে।তারপর ১০ কাপ পানি দিয়ে ভালো করে নেড়ে ঢাকনা দিয়ে ঢেকে উচ্চতাপে '
        '৮/১০ মিনিটের মতো রান্না করতে হবে।বলক উঠলে নেড়ে ২০ মিনিটের মতো একদম কম আঁচে রান্না করতে হবে যেনো নিচে লেগে না যায়। ঢাকনা তুলে ঘি দিয়ে আলতো হাতে নেড়ে  আরও ৫ মিনিট দমে রেখে '
        'গরম গরম পরিবেশন করতে হবে বিফ ভুনা খিচুড়ি।'
        '\n\n\nবি:দ্র:এই একই রেসিপি অনুসরণ করে মুরগির মাংস ও খাসির মাংসের ভুনা খিচুড়ি রান্না করা যাবে।হাড়িতে খিচুড়ি রান্না করতে মুলত চাল ডালের দ্বিগুন পানি দিতে হয়।তাহলে খিচুড়ি পারফেক্ট ও'
        'ঝরঝরে হয়।তবে কেউ নরম খিচুড়ি পছন্দ করেন তাহলে এক কাপ পানি বেশি করে দিতে পারেন।',
        imageUrl: 'assets/biryaniimages/beef_khichuri.jpg'
    ),
    bFood(id: 'p9',
        title: 'ইলিশ খিচুড়ি',
        description: 'ইলিশ খিচুড়ি রান্না করতে যা যা প্রয়োজন---'
            '\n\n\n\মসুরের ডাল-১ কাপ(২৫০ গ্রাম এর কাপ)'
  '\nমুগ ডাল-১ কাপ(হালকা ভেজে নেওয়া)'
 '\n পোলাওয়ের চাল- ৩ কাপ'
 '\n ইলিশ মাছ-৬ টুকরো (হলুদ,মরিচ ও স্বাদমতো লবণ দিয়ে ভেজে নিতে হবে)'
 '\n সয়াবিন তেল-১ কাপ'
 '\n দারুচিনি- ২/৩ টুকরো'
 '\n সবুজ/সাদা এলাচ- ২/৩টি'
 '\n কালো এলাচ ছোট ১ টা,বড় হলে অর্ধেক।'
 '\n তেজপাতা- ২ টি'
  '\nপেঁয়াজ কুচি- এক কাপ'
  '\nহলুদ গুঁড়া-এক চা চামচ'
  '\nমরিচ গুঁড়া-১ টেবিল চামচ  বা ঝাল বুঝে'
 '\n আদা বাটা– এক টেবিল চামচ'
  '\nরসুন বাটা– এক টেবিল চামচ'
 '\n লবণ- স্বাদমতো'
  '\nআস্ত কাঁচা মরিচ ৬/৭ টি'
            '\n\n\nইলিশ খিচুড়ি রান্নার প্রক্রিয়া-'
            'n#প্রথমে কড়াইয়ে তেল দিয়ে মাছ ভেজে তুলে রাখতে হবে।'
        '#মাছ ভাজার পর সেই কড়াইয়ে এক কাপ মত তেল দিয়ে তাতে এলাচ, দারুচিনি, তেজপাতা ফোড়ন দিতে হবে।তারপর পেঁয়াজ কুচি দিয়ে পেঁয়াজ বাদামি হলে হলুদ ও মরিচ গুঁড়া,আদা ও রসুন '
       ' বাটা দিয়ে একটু নেড়ে আধা কাপ পানি দিয়ে মশলা  ভালোভাবে কষিয়ে নিতে হবে।'
       ' #এরপর চাল ডালের মিশ্রণ দিয়ে স্বাদ মতো লবণ দিয়ে চাল ভালোভাবে ভাজতে হবে কিছুক্ষণ।ভাজা হয়ে গেলে চাল ডালের অর্ধেক ১০ কাপ পরিমাণ গরম পানি দিয়ে  চুলার আঁচ মাঝামাঝি রেখে '
       ' ঢাকনা দিয়ে ঢেকে রান্না করতে হবে বলক ওঠা অবধি।'
       ' #বলক উঠলে ঢাকনা খুলে নেড়ে দিয়ে লবন চেক করে আবার ঢেকে রান্না করতে হবে ১০ মিনিট বা পানি শুকানো পর্যন্ত।পানি শুকিয়ে চাল ডাল ফুটে গেলে  একটু নেড়ে অর্ধেক খিচুড়ি আলাদা করে'
       ' তুলে রাখতে হবে।'
       ' #এবার ভেজে রাখা মাছগুলো হাঁড়িতে ভাল করে বিছিয়ে দিয়ে তুলে রাখা খিচুড়ি মাছের ওপর ছড়িয়ে দিতে হবে।কাঁচা মরিচ ও ছড়িয়ে ঢাকনা দিয়ে ঢেকে আরো ১০ মিনিট দমে রাখতে হবে।এরপর চুলা থেকে '
        'নামিয়ে গরম গরম পরিবেশন করুরে হবে ইলিশ খিচুড়ি।',
        imageUrl: 'assets/biryaniimages/hilsha_khichuri.jpg'
    ),
    bFood(id: 'p10',
        title: 'পাঁচমিশালি সবজির খিচুড়ি',
        description: 'মিক্সড সবজি খিচুড়ি রান্না করতে লাগবে--'
            '\n\n\nচাল ২ কাপ বা আধা কেজি'
  '\nমুগ ডাল আধা কাপ(ভেজে নিতে হবে)'
  '\nমসুর ডাল আধা কাপ'
  '\nগাজর,বরবটি,আলু,ফুলকপি,মটরশুঁটি প্রতিটা সবজি আধা কাপ করে।পছন্দ মত যেকোনো সবজি দেওয়া যাবে।'
 '\n পেঁয়াজ কুচি ১ কাপ'
  '\nআদা বাটা ১ চা-চামচ'
 '\n রসুন বাটা ২ চা চামচ'
  '\nহলুদ গুড়া ১/২ চা চামচ'
  '\nজিরা গুড়া ১ চা চামচ'
  '\nমরিচের গুড়া ১ চা চামচ(ঝাল কম বেশি খেলে কমিয়ে বাড়িয়ে দিতে হবে)'
  '\nকাঁচা মরিচ ফালি ২/৩ টি'
  '\nতেজপাতা ২ টি'
 '\n দারুচিনি ২/৩ টুকরো'
 '\n এলাচ ২/৩ টি'
  '\nলবঙ,গোলমরিচ ২/৩ টি করে'
 '\n লবণ স্বাদ মত'
  '\nতেল ১ কাপ'
  '\nঘি ১ টেবিল চামচ'
            '\n\n\nপাঁচমিশালি সবজির খিচুড়ি রেসিপি--'
            '\n#মুগ ডাল ভেজে নিয়ে চাল ও ডাল এক সাথে ধুয়ে পানি ঝড়িয়ে নিতে হবে।'
       ' #হাড়িতে তেল দিয়ে পেঁয়াজ ভেজে সব মশলা দিয়ে চাল,ডাল ও সবজি দিয়ে কিছুক্ষণ ভেজে নিতে হবে।'
        '#এখন চাল ও ডালের দ্বিগুন অর্থাৎ ৬ কাপ পানি দিয়ে ঢেকে চুলার আঁচ বারিয়ে বলক ওঠা অবধি রান্না করতে হবে।ভালো করে ফুটে উঠলে নেড়ে লবন চেক করে আঁচ কমিয়ে রান্না করতে হবে।'
        '#পানি শুকিয়ে চাল ডাল সিদ্ধ হলে নামানোর আগে ঘি দিয়ে কিছুক্ষণ দমে রেখে পরিবেশন করতে হবে গরম গরম সবজি খিচুড়ি।'
        '\nবিঃদ্রঃসবজির ল্যাটকা খিচুড়ি বা পাতলা খিচুড়ি খেতে চাইলে সেম রেসিপি ফলো করে শুধু এক/দেড় কাপ পানি বেশি করে দিতে হবে।',
        imageUrl: 'assets/biryaniimages/vegetable_khichuri.jpg'
    ),
    bFood(id: 'p11',
        title: 'ডিমের খিচুড়ি',
        description: 'ডিমের খিচুড়ি বানানোর উপকরণ--'
            '\n\n\nপোলাওয়ের চাল ২ কাপ(চাইলে যেকোন চাল দিয়ে করতে পারেন)'
  '\nমসুর ডাল ১ কাপ(ধুয়ে ৩০ মিনিট ভিজিয়ে রাখুন)'
 '\n আলু ২টি (কিউব করে কাটা)'
 '\n গাজর ১টি (কিউব করে কাটা)'
  '\nমটরশুঁটি ১ কাপ'
 '\n ফুলকপি ১ কাপ(মাঝারি করে টুকরো করা)'
 '\n পেঁপে আধা কাপ(কিউব করে কাটা)'
  '\nপটল আধা কাপ(কিউব করে কাটা)'
  '\nডিম ৪টি ফেটানো'
  '\nজিড়ার গুড়ো ১ চা চামচ'
  '\nধনিয়া গুড়া আধা চা চামচ'
 '\n গরম মসলা ১ চা চামচ'
  '\nমরিচের গুড়া ১ টেবিল চামচ বা ঝাল বুঝে'
  '\nলবণ পরিমাণ মতো'
 '\n তেল আধা কাপ'
 '\n ঘি ২ টেবিল চামচ'
  '\nআদা বাটা,'
 ' \nপেঁয়াজ ১ টেবিল চামচ'
 '\n রসুন বাটা ১ চা-চামচ'
  '\nকাঁচামরিচ ৭/৮টি'
  '\nপেঁয়াজ কুচি আধা কাপ'
  '\nতেজপাতা ২ টি'
            '\n\n\nডিমের খিচুড়ি বানানোর প্রণালী---'
            '\n#আলু,গাজর,পেঁপে,পটলের খোসা ছাড়িয়ে কিউব করে কেটে নিন।এবার হাঁড়িতে তেল দিয়ে সবজিগুলো তেলের মধ্যে হালকা ভেজে তুলে রাখুন।'
        '#তেলের মধ্যে ঘি দিয়ে গরম করে তেজপাতা  দিয়ে চাল ডাল দিয়ে ভাজুন।ভাজা হলে সবজি দিয়ে নেড়েচেড়ে সব মশলা,লবন,হলুদ দিয়ে  চাল ডালের দ্বিগুন বা ৬ কাপ পানি দিন।ঢেকে ফুল আঁচে রান্না '
       ' করুন বলক আসা অবধি।'
       ' #বলক আসলে লবন চেক করে চুলার আঁচ একদম লো করে ফেটানো ডিম দিয়ে ওপর-নিচ করে নেড়ে আস্ত কাঁচামরিচ দিয়ে ঢেকে দিন।'
        '#১৫/২০ মিনিট পর পানি শুকিয়ে ঝরঝরে হয়ে গেলে হালকা হাতে উল্টেপাল্টে ওপরে বেরেস্তা ছড়িয়ে নামিয়ে গরম গরম পরিবেশন করুন ডিম খিচুড়ি।',
        imageUrl: 'assets/biryaniimages/egg_khichuri.jpg'
    ),


  ];

  List<bFood> get items => _items;


// List<Food> get items {
  //   return [..._items];
  // }
// List<Food>get items => _items;
  bFood FindById(String id){

    return _items.firstWhere((prod) => prod.id==id);

  }
  void AddFood(bFood value){
    _items.add(value);

  }
}