import 'package:flutter/cupertino.dart';
import 'package:learn_to_cook/fish_curry/fc_Food.dart';
import 'package:learn_to_cook/vegetable/v_Food.dart';

class vFoods extends ChangeNotifier{
  List<vFood> _items=[
    vFood(
        id:'p1',
        title: 'চফুলকপি ভাজা',
        description: 'ফুলকপি ভাজা রেসিপি -'
            '\n\n\nউপাদানগুলি::--'
            '\nফুলকপি'
       '\n হলুদ গুরা পরিমানমত কালার এর জন্য'
        '\n1/4 চা চামচ মরিচগুরা'
   ' \nলবন স্বাদমত'
    '\nসরিষার তেল পরিমানমত'
            '\n\n\nধাপগুলি::--'
            '1. ফুলকপি ফুলগুলো বড় টুকরো করে ভিজিয়ে রেখে ধুয়ে পানি ঝরিয়ে নিব'
            '\n2.হলুদ,মরিচ,লবন দিয়ে মাখিয়ে 10 মিনিট রেস্ট দিব'
            '\n3.করাইতে তেল গরম করে ফুলকপিগুলো দিয়ে নেররচেরে ঢাকনা দিয়ে সিদ্ধ করে নিব লো থেকে একটু বেশি আচে'
            '\n4.মাঝে মাঝে নেরেচেরে দি ব,অনেকটা সময় নিয়ে সিদ্ধ করে নিয়ে ঢাকনা সরিয়ে ভাজা ভাজা করে নিব,তবে একটু '
            'কচকচে রেখে সিদ্ধ করব,বেশি নেরেচেরে ভেংগে ফেলব না,,,ফুলগুলো আস্তই রাখতে চেষ্টা করব'
            '\n5.গরম ভাতের সাথে বা আমি খালি খালি এই ভাজা ফুলকপি খেতে পছন্দ করি।',
        imageUrl: 'assets/sobjiimages/fulkopi_vaja.webp'
    ),
    vFood(
        id:'p2',
        title: 'ইলিশ মাছ দিয়ে শীতের মিক্স সবজি ',
        description: 'ইলিশ মাছ দিয়ে শীতের মিক্স সবজি রেসিপি --'
            '\n\n\nউপাদানগুলি::-'
            '\nটুকরো ইলিশ মাছের'
        '\nফুলকপি 1 টির অর্ধেক'
   '\n 2 টি আলু'
   '\n সিম টুকরো দের কাপ'
   '\n হলুদ গুরা পরিমানমত'
    '\nমরিচ গুরা 1 চা চামচের কম/ পছন্দমত ঝাল'
    '\n1/2 চা চামচ ধনেগুরা'
   '\n 1/4 চা চামচ জিরা গুরা'
    '\n1/4 চা চামচ রসুন বাটা'
    '\nলবন স্বাদমত'
   '\n কাচামরিচ ও ধনেপাতাকুচি স্বাদমত'
    '\n1 টি পেয়াজকুচি'
    '\nপরিমানমত তেল'
            '\n\n\nধাপগুলি--'
            '\n1.প্রথমে সবজিগুলো কেটে আলাদা হারিতে রেখে ধুয়ে পানি ঝরিয়ে নিব'
            '\n2.তারপর মাছগুলোতে হলুদ ও লবন মাখিয়ে পরিমানমত তেলে ভেজে তুলে নিব'
            '\n3.মাছ ভাজার করাইতে সেই তেলেই প্রথমে ফুলকপি,পরে সিম তারপর আলুৃগুলো তে অল্প হলুদ ও.লবন দিয়ে ভেজে তুলে নিব'
            '\n4.আলুগুলো ভাজার শেষের দিকে পেয়াজকুচি দিয়ে নেরেচেরে সব উপকরন মসলা দিয়ে কষিয়ে বাকি সবজি ও মাছ,কাচামরিচ ফেরে'
            ' দিয়ে পরিমানমত পানি দিয়ে লবন দেখে ঢেকে রান্না করব'
            '\nপাতলা ঝোল থাকতে ধনেপাতা কুচি দিয়ে নামিয়ে নিব।',
        imageUrl: 'assets/sobjiimages/hisha_mixd_sobji.webp'
    ),

    vFood(
        id:'p3',
        title: 'চঘি দিয়ে বেগুন ভাজা ',
        description: 'ঘি দিয়ে বেগুন ভাজা রেসিপি---'
            '\n\n\nউপাদানগুলি::'
            '\n\n\n7 পিস বেগুন চাক করে কাটা'
        '\n1/2 চা চামচ হলুদ গুরা'
   '\n 1/2 চা চামচ মরিচ গুরা'
   '\n লবন পরিমানমত'
    '\nঘি ভাজার জন্য'
            '\n\n\nধাপগুলি:--'
            '\n#বেগুনের চাকগুলো ধুয়ে পানি ঝরিয়ে লবন,হলুদ,মরিচ দিয়ে মাখিয়ে রাখব 10 মিনিট'
            '\n#পেন গরম করে ঘি দিয়ে গলিয়ে নিব বেগুনগুলো দিয়ে মিডিয়াম আচে ঢেকে দিব,কিছুক্ষন পরে আচ লো থেকে একটু বেশি'
            ' দিব,ঢাকনা সরিয়ে উল্টিয়ে দিব,দুপাশ সময় নিয়ে ভাজা ভাজা হয়ে আসলে তুলে নিব।',
        imageUrl: 'assets/sobjiimages/begun_vaji.webp'
    ),

    vFood(
        id:'p4',
        title: 'ডালের বড়ি দিয়ে বথুয়া শাকের ঘন্ট ',
        description: 'উপাদানগুলি::'
            '\n### ৪জন--'
       ' \n২আটি বথুয়া শাক'
        '\n১টি আলু কুচি'
       ' \n১/২ কাপ বেগুন কুচি'
    '\n৬টি ডালের বড়ি'
    '\n১/২ চা চামচ হলুদ'
   ' \n১/২ চা চামচ লবণ'
    '\n৪টি কাঁচা মরিচ'
    '\n১/২ চা চামচ কালো জিরে'
    '\n৪টেবিল চামচ তেল'
            '\n\n\nধাপগুলি:--'
            '\n@ডালের বড়ি ভেজে তুলে রাখতে হবে'
            '\n@শাক ধুয়ে কুচি করে কেটে নিতে হবে।'
            '\n@প্যানে তেল গরম হলে কালো জিরে শুকনো মরিচ ফোড়ন দিয়ে আলু ভেজে বেগুন ভেজে শাক কুচি দিয়ে নেড়েচেড়ে এর মধ্যে হলুদ লবণ দিয়ে ঢেকে দিতে হবে।'
            '\n@ঢাকা তুলে দেখতে হবে সিদ্ধ হল কিনা। আলু সিদ্ধ হলে ডালের বড়ি দিয়ে ভাজা ভাজা হলে নামিয়ে নিতে হবে।',
        imageUrl: 'assets/sobjiimages/daler_bodi.webp'
    ),

    vFood(
        id:'p5',
        title: 'রসুন কুচি দিয়ে ডাটা শাক ভাজা ',
        description: 'উপাদানগুলি::--'
            '\n 4 জনের জন্য --'
       ' \n১আটি ডাটা শাক'
        '\n২কোয়া রসুন কুচি'
        '\n১চা চামচ হলুদ গুড়ো'
        '\n১চা চামচ লবণ'
       '\n ১টি শুকনো মরিচ'
       '\n ১/২ চা চামচ কালো জিরে'
    '\n৪টি কাঁচা মরিচ'
    '\n৪টেবিল চামচ তেল'
            '\n\n\nধাপগুলি--'
            '\n# প্যানে তেল গরম হলে কালো জিরে শুকনো মরিচ রসুন কুচি ফোড়ন দিয়ে ভাজা হলে ডাটা শাক কুচি দিয়ে নেড়েচেড়ে এর মধ্যে হলুদ লবণ মরিচ দিয়ে নাড়াচাড়া করে ঢেকে রাখতে হবে'
            '\n# ঢাকা তুলে জল শুকিয়ে আসলে ভাজা ভাজা হলে নামিয়ে নিতে হবে।',
        imageUrl: 'assets/sobjiimages/data_vaja.webp'
    ),
    vFood(
        id:'p6',
        title: 'ফুলকপির ডাল ',
        description: 'উপাদানগুলি::--'
        '\n৬জনের জন্য '
            '\n১কাপ মুসুরি ডাল'
        '\nটুকরো ২কাপ ফুলকপি'
       '\n টুকরো ১কাপ আলু'
        '\n১/২ চা চামচ আদা বাটা'
    '\n২টি পেঁয়াজ কুচি'
    '\n১কোয়া রসুন কুচি'
    '\nফালি ৫টি কাঁচা মরিচ'
   '\n ২টেবিল চামচ ধনে পাতা কুচি'
    '\n২টি শুকনো মরিচ'
   '\n ১টি তেজপাতা'
   '\n ১চা চামচ গোটা জিরে'
    '\n১চা চামচ লবণ'
   '\n ১/২ চা চামচ হলুদ গুড়ো'
    '\n১/২ চা চামচ মরিচ গুড়ো'
   ' \n১/২ চা চামচ জিরে গুড়ো'
    '\n১/২ চা চামচ ধনে গুড়ো'
   '\n ১/২ চা চামচ গরম মসলা গুড়ো'
   '\n ১/২ চা চামচ ঘি'
    '\n৪টেবিল চামচ তেল'
            '\n\n\nধাপগুলি::--'
            '\n* ডাল ধুয়ে ভিজিয়ে রাখতে হবে।'
            '\n* প্যানে তেল গরম হলে ফুলকপি ও আলু ভেজে তুলে রাখতে হবে।'
            '\n* ঐ তেলে গোটা জিরে তেজপাতা ফোড়ন দিয়ে পেঁয়াজ কুচি ও রসুন কুচি দিয়ে নেড়েচেড়ে এর মধ্যে সব মসলা দিয়ে কসাতে হবে'
            ' এবং ডাল দিয়ে দিতে হবে এখন পরিমাণ মত জল দিয়ে ফুটতে দিতে হবে।'
            '\n* ডাল সিদ্ধ হলে ফুলকপি ও আলু দিয়ে ফুটিয়ে ধনেপাতা কুচি ও ঘি ছড়িয়ে নামিয়ে নিতে হবে। আরেকটু বেশি টেস্ট বাড়ানোর জন্য নামানোর '
            'আগে তেলে গোটা জিরে শুকনো মরিচ ফোড়ন দিয়ে উপরে ঢেলে দিতে হবে।',
        imageUrl: 'assets/sobjiimages/fulkopi_dal.webp'
    ),
    vFood(
        id:'p7',
        title: 'চিফুলকপি তরকারি আলু টমেটো দিয়ে ',
        description: 'উপাদানগুলি::-'
            '\n1 টি ফুলকপি'
        '\n3 টি আলু'
    '\n3 টি টমেটো'
   '\n রুই মাছের টুকরো 10 টি'
   ' \nহলুদ গুরা পরিমানমত'
   ' \n1 চা চামচ মরিচ গুরা'
    '\n1/2 চা চামচ ধনে গুরা'
    '\n1/4 চা চামচ জিরা গুরা'
    '\nলবন স্বাদমত'
    '\n1/4 চা চামচ রসুন বাটা'
        '\nকাচামরিচ ও ধনেপাতা কুচি স্বাদমত'
   '\n তেল পরিমানমত'
    '\nপানি পরিমানমত'
        '\n1 টি পেয়াজকুচি'
            '\n\n\nধাপগুলি::--'
            '\n# ফুলকপি গুলো বড় করে কেটে পানিতে অনেকক্ষন ভিজিয়ে রেখে ধুয়ে পানি ঝরিয়ে নিব,আলুগুলো টুকরো করে ধুয়ে নিব,টমেটোগুলো ধুয়ে 4 পিস করে কেটে নিব'
            '\n# প্রথমে মাছগুলোতে হলুদ ও লবন মাখিয়ে পরিমানমত তেলে ভেজে নিব'
            '\n# সেই করাইতে অল্প তেলে ফুলকপি দিয়ে দিব অল্প লবন ও হলুদ গুরা দিয়ে নেরেচেরে হালকা ভেজে তুলে রাখব,আলুগুলো ও একইভাবে ভেজে তুলে নিব'
            '\n# তারপর অল্প তেলে টমেটোগুলো দিয়ে হালকা নেরেচেরে ভেজে নিব'
            '\n# এখব করাইতে পরিমানমত অল্প তেল দিয়ে পেয়াজ দিয়ে নেরেচেরে হালকা ভাজা হলেই সব উপকরন গুরা ও বাটা মসলা দিয়ে কষিয়ে সবজি গুলো ও.মাছগুলো দিয়ে নেরে '
            'দিব,পরিমানমত পানি দিব লবন দেখে নিব কাচামরিচ ফেরে দিব,ঢেকে রান্না করে নিব'
            '\n# সিদ্ধ হলে ধনেপাতা দিয়ে একটু দমে রেখেরান্না শেষ করব।',
        imageUrl: 'assets/sobjiimages/fulkopi_tometo_alu.webp'
    ),
    vFood(
        id:'p8',
        title: 'শোল মাছের মাথা দিয়ে লাউ',
        description: 'উপাদানগুলি::--'
            '\n ৬জন---'
       '\n ২টি শোল মাছের মাথা'
        '\n১টি ছোট লাউ'
       '\n ১চা চামচ আদা বাটা'
       '\n ১চা চামচ হলুদ গুড়ো'
       '\n ১চা চামচ লবণ'
       '\n ১চা চামচ জিরে গুড়ো'
       '\n ফালি ৫টি কাঁচা মরিচ'
        '\nধনে পাতা কুচি'
        '\n১চা চামচ গোটা জিরে'
        '\n১টি তেজপাতা'
        '\n৫টেবিল চামচ তেল'
            '\n\n\nধাপগুলি---'
            '\n@ প্যানে তেল গরম হলে মাছের মাথা হলুদ লবণ দিয়ে ভেজে তুলে রাখতে হবে।'
            '\n@ ঐ তেলে গোটা জিরে তেজপাতা ফোড়ন দিয়ে লাউ কুচি, হলুদ লবণ কাচা মরিচ দিয়ে ঢেকে দিতে হবে।'
            '\m@ লাউ সিদ্ধ হলে মাছের মাথা জিরে গুড়ো ওধনে পাতা কুচি ছড়িয়ে নাড়া চাড়া করে নামিয়ে নিতে হবে।',
        imageUrl: 'assets/sobjiimages/matha_law.webp'
    ),
    vFood(
        id:'p9',
        title: 'মাছ দিয়ে লাউ রান্না ',
        description: 'উপাদানগুলি::--'
            '\n ৬ জন'
        '\n১ টা মাজারি সাইজের লাউ ছিলে পছন্দ মত কেটে ধুয়ে নেওয়া,'
       '\n ১০ পিস যে কোন মাছ'
    '\n1/2 কাপ পিয়াজ বাটা'
   '\n ১ টে চামচ রসুন বাটা'
    '\nঅল্প অল্প করে হলুদ মরিচ ধনিয়া গুড়া'
    '\n৬-৭ টা কাচামরিচ ফালি'
    '\n1/2 কাপ ধনিয়া পাতা কুচি'
    '\nলবন'
    '\nতেল'
            '\n\n\nধাপগুলি::--'
            '\n# চুলায় পাতিল বসিয়ে তেল দিয়ে গরম করে নিব, দ্যান পিয়াজ রসুন বাটা দিয়ে কসিয়ে নিব,'
            '\n# দ্যান লাউ দিয়ে মিশিয়ে নিয়ে গুড়া মসলা আর লবন দিয়ে আবার ও মিশিয়ে নিয়ে ডেকে কিছুসময় রান্না করে নিব,'
            '\n# মাজে মাজে নেড়েছেড়ে দিয়ে ১০ মিনিট রান্না করব, দ্যান মাছ আর কাচামরিচ দিয়ে রান্না করব তবে কোন পানি দিবনা,'
            '\n# এভাবে রান্না করে নিয়ে নিব, হয়ে গেলে উপরে ধনিয়া পাতা দিয়ে পরিবেশন করব।',
        imageUrl: 'assets/sobjiimages/mach_low.webp'
    ),
    vFood(
        id:'p10',
        title: 'চমিষ্টি কুমড়া পাতার বাটা শাক ভাজি ',
        description: 'উপাদানগুলি::--'
            '\n8-9 টি মিষ্টি কুমড়া / চালকুমড়া পাতা'
        '\n3 টি রসুন'
   '\n 4 টি কাচামরিচ'
    '\nলবন স্বাদমত'
    '\nতেল পরিমানমত'
            '\n\n\nধাপগুলি::--'
            '\n@ পাতাগুলো ধুয়ে পরিমানমত পানি দিয়ে ঢেকে রেখে সিদ্ধ করে নিতে হবে,'
            '\n@ সিদ্ধ হলে পানিটা ছেকে ফেলে ঠান্ডা করে নিব,তারপর হাতে নিয়ে চিপে পানি ফেলে পাটায় বেটে নিব,রসুনগুলো ধুয়ে পাটায় ছেচে নিব'
            '\n@ করালতে তেল দিয়ে রসুনকুচি বাদামি করে ভেজে শাক সাথে সামান্য লবন দিয়ে নেরেচেরে নিতে হবে,কাচামরিচ ভেংগে দিয়ে দিব'
            '\n@ যতক্ষন শাক করাই থেকে উঠে আসবে পানি শুকিয়ে ততক্ষন নেরেচেরে করা আচে ভেজে নিব।',
        imageUrl: 'assets/sobjiimages/misti_komrar_pata.webp'
    ),
    vFood(
        id:'p11',
        title: 'আস্ত সিমের তরকারি ',
        description: 'উপাদানগুলি::--'
            '\n250 গ্রাম সিম'
        '\n50 গ্রাম চাপিলা মাছ'
   '\n হলুদ গুরা পরিমানমত'
    '\n1/2 চা চামচ মরিচ গুরা'
    '\n1/2 চা চামচ ধনে গুরা'
   '\n জিরা গুরা 1/4 চা চামচের কম'
   '\n 1/4 চা চামচ রসুন বাটা'
   ' \nলবন স্বাদমত'
   '\n তেল পরিমানমত'
    '\nকাচামরিচ ও ধনেপাতা কুচি স্বাদমতআ'
        '\nপেয়াজ 1 টি কুচি'
            '\n\n\nধাপগুলি::--'
            '\n@ প্রথমে অল্প তেলে মাছগুলো হালকা ভেজে নিব মাছে হলুদ ও.লবন মাখিয়ে'
            '\n@ সেই.করাইতে অল্প তেল দিয়ে আস্ত সিমগুলো বোটা ফেলে ধুয়ে রেখেছিলাম সেগুলো দিয়ে দিব,অল্প লবন ও হলুদগুরা দিয়ে নেরেচেরে ভেজে তুলে নিব'
            '\n@ এরপর করাইতে অল্প তেল দিয়ে পেয়াজ ভেজে সব উপকরন মসলা দিয়ে কষিয়ে সিম ও.মাছগুলো কাচামরিচ ফেরে দিয়ে নেরেচেরে দিব,পরিমানমত পানি দিয়ে লবন দেখে ঢেকে রান্না করব'
            '\n@ নামানোর আগে ধনেপাতাকুচি ছরিয়ে দিয়ে নামিয়ে নিব।',
        imageUrl: 'assets/sobjiimages/Sheemer-Jhal.jpg'
    ),
    vFood(
        id:'p12',
        title: 'ফুলকপি ও ব্রকোলির স‍্যুপ ',
        description: 'ফুলকপি ও ব্রকোলির স‍্যুপ। Cauliflower and Broccoli soup--'
            '\nউপাদানগুলি::--'
            '\n (৪/৫জন।):-'
        '\nফুলকপি- মাঝারী ১ টা। টুকরো করা।'
    '\nব্রকোলি-১ টা। টুকরো করা।'
    '\nতরল দুধ-২ কাপ বা প্রয়োজন মত।'
   '\n রসুন কুচি-১ চা চা।'
   '\n পেঁয়াজ কুচি-২ চা চা।'
    '\nতেল ১চা চা।'
   '\n বাটার-১চা চা, ভরা।'
   '\n লবন- স্বাদ মত।'
    '\nগুল মরিচ গুড়া-১/২ চা চা।'
    '\nপানি -প্রয়োজন মত।'
            '\n\n\nধাপগুলি::--'
            '\n# একটি ফ্রাইপ্যান চূলায় বসিয়ে তেল ও বাটার দিন। এরপর রসুন দিয়ে দু তিন মিনিট ভেজে পেঁয়াজ দিন। দুএক মিনিট নেড়ে ফুলকপি দিন।'
            '\n# দু মিনিট পরে ব্রকোলী দিন ও নাড়ুন। লবন দিন। ৫/৬ মিনিট নেড়েচেড়ে পরিমাণ মত পানি দিয়ে ঢেকে দিন। মোটামুটি সিদ্ধ হয়ে গেলে নামিয়ে ঠান্ডা করে ব্লেন্ড করে নিন।'
            '\n# মিশ্রনটি একটি পাত্রে নিয়ে চূলায় বসান। দুধ ও পরিমাণ মত পানি দিন। বেশী থকথকে ও হবে না, বেশী পাতলাও হবেনা। লবন চেখে নিন। মাঝারী আঁচে ৭/৮ মিনিট ফুটিয়ে নিন। মোটামুটি ঘন হয়ে গেলে গুল '
            'মরিচ ছিটিয়ে চূলা বন্ধ করে দিন। ব্রেড বা নান বা এমনি এমনিই উপভোগ করুন স্বাস্থ্যকর এই স‍্যুপ।'
            '\n# ',
        imageUrl: 'assets/sobjiimages/soup.webp'
    ),
    vFood(
        id:'p13',
        title: 'বেগুন সিম আলু দিয়ে সুটকি ভুনা ',
        description: 'উপাদানগুলি##-'
            '\n2 টি আলু মোটা কুচি'
        '\n3 টি বেগুন মোটা কুচি'
    '\n1 কাপ সিম মোটা কুচি'
    '\n5 টি চ্যাপা সুটকি'
   ' \n1/2 চা চামচ হলুদ গুরা'
    '\n1 চা চামচ মরিচগুরা'
   ' \n1/2 চা চামচ ধনেগুরা'
    '\nলবন'
    '\nকাচামরিচ ফারা পছন্দমত'
    '\nতেল পরিমানমত'
    '\n4 টি পেয়াজকুচি'
            '\n\n\nধাপগুলি--'
            '\n@ করাইতে পরিমানমত তেল দিয়ে পেয়াজকুচি ভেজে নিব,তারপর সুটকি গুলো ধুয়ে দিয়ে পেয়াজের সাথে ভেজে নিয়ে সব বাটা ও গুরা মসলা দিয়ে কষিয়ে সবজিগুলো সাথে লবন ও কাচামরিচ সামান্য পানি যেন সবজিগুলো '
            'সিদ্ধ হয়ে মাখা মাখা হয় সেই.আন্দাজে দিয়ে ঢেকে রান্না করে নিব'
            '\n@ সিদ্ধ হলে ঢাকনা সরিয়ে নেরেচেরে মাখামাখা করে তুলে নিব।',
        imageUrl: 'assets/sobjiimages/sutki_vuna.webp'
    ),
    vFood(
        id:'p14',
        title: 'টমেটো পুরা ভর্তা ',
        description: 'উপাদানগুলি::-'
            '\n6 টি পাকা টমেটো'
       '\n 6-7 টি কাচামরিচ কুচি'
    '\nধনেপাতা কুচি স্বাদমত'
   '\n লবন পরিমানমত'
    '\nপেয়াজকুচি ছোট 3 টি'
            '\n\n\nধাপগুলি::--'
            '\n# টমেটো ধুয়ে নিব.শুকনো তাওয়া গরম করে টমেটোগুলো দিয়ে ঢেকে দিব আচ বারিয়ে দিব তারপর মিডিয়ামে রাখব'
            '\n# কিছুসময় পরে ঢাকনা সরিয়ে উল্টিয়ে দিব খেয়াল রাখতে হবে যেন পুরে না যায়'
            '\n# দুইপাশ সিদ্ধ হলে নরম হবে তারপর তুলে নিব চুলা থেকে'
            '\n# টমেটোর খোসা পুরাগুলো ফেলে দিয়ে সব উপকরন দিয়ে মাখিয়ে নিব।',
        imageUrl: 'assets/sobjiimages/tometo_por.webp'
    ),





  ];

  List<vFood> get items => _items;


// List<Food> get items {
  //   return [..._items];
  // }
// List<Food>get items => _items;
  vFood FindById(String id){

    return _items.firstWhere((prod) => prod.id==id);

  }
  void AddFood(vFood value){
    _items.add(value);

  }
}