import 'package:flutter/cupertino.dart';
import 'package:learn_to_cook/breakfast/br_Food.dart';

class brFoods extends ChangeNotifier{
  List<brFood> _items=[
    brFood(
      id: 'p1',
      title: 'চটপটি',
      description: ' চটপটি যেভাবে করতে হয়--'
  '\nউপকরণ::--'
  '\nডাবলি বুট- ২ কাপ'
  '\nআলু মাঝারি সাইজের- ২-৩ টা'
  '\nপেঁয়াজ কুঁচি- ১/২ কাপ'
  '\nমরিচ গুঁড়া- ১/২ চা চামচ'
  '\nজিরা গুঁড়া- ২ চা চামচ'
 ' \nধনিয়া গুঁড়া- ১.৫ চা চামচ'
 ' \nবেকিং সোডা- ১ চা চামচ'
  '\nলবণ- স্বাদমতো'
  '\nসয়াবিন তেল- ২ টেবিল চামচ'
  '\nপাকা তেঁতুল- ১/২ কাপ'
 '\n শুকনামরিচ- ২ টা'
 ' \nভাজা জিরা গুঁড়া- ১/২ চা চামচ'
  '\nবিট লবণ- ১ চা চামচ'
  '\nলবণ- স্বাদমতো'
 ' \nচিনি- স্বাদমতো'
  '\nসরিষার তেল- ২ চা চামচ'
  '\nপানি- প্রয়োজন মত'
  '\nসিদ্ধ ডিমের ঝুরি- ১ কাপ'
  '\nশসা কুঁচি- ১ কাপ'
 ' \nধনিয়া পাতা কুঁচি- ১ কাপ'
 ' \nকাঁচা মরিচ কুঁচি- ১/২ কাপ'
  '\nপেঁয়াজ কুঁচি- ১/২ কাপ'
  '\nনিমকি- পছন্দমতো'
  '\n\n\nপ্রণালী::--'
  '\n(১) প্রথমে ডাবলি বুট একটি বড় বাটিতে নিয়ে বেশি করে পানি দিয়ে ৫-৬ ঘন্টা ভিজিয়ে রাখতে হবে। ডিম ও আলু ভালোভাবে '
  'সিদ্ধ করে আলু ছিলে হাত দিয়ে ভেঙ্গে ছোটছোট দানা করে রেখে দিতে হবে। আলু শুধু ভেঙ্গে দিবেন, পেস্ট করবেন না।'
  '\n(২) ডাবলি বুট ভেজানো হলে ভালোভাবে ধুয়ে একটি বড় পাত্রে নিয়ে এর সাথে পেঁয়াজ কুচি, মরিচগুঁড়া, জিরা, ধনিয়া,'
  ' বেকিং সোডা, লবণ, তেল ও প্রয়োজনমতো পানি দিয়ে সিদ্ধ করতে হবে। চাইলে প্রেশার কুকার-এ সিদ্ধ করে নিতে পারেন, তাড়াতাড়ি হবে।'
  '\n(৩) ডাল সিদ্ধ হলে তারপর হলুদ দিতে হবে, আর সিদ্ধ করে ভেঙ্গে রাখা আলুগুলোও এখন দিয়ে নেড়ে দিন। ডালের পানি পছন্দমতো ঘন হয়ে'
  ' এলে লবণ দেখে (লাগলে দিয়ে) নামিয়ে ফেলুন । চটপটির জন্য ডাল রেডি, এবার তেতুলের টক তৈরির পালা।'
  '\n(৪) এখন তেঁতুলগুলো ১ কাপ পানিতে ভিজিয়ে রেখে হাত দিয়ে কচলে তেঁতুলের ক্বাথ বের করে নিতে হবে। তেঁতুলগুলো নরম হয়ে পানিতে মিশে গেলে '
  'তেঁতুলের বীচি ও আঁশ বেছে ফেলে দিয়ে তারপর ছেঁকে নিতে হবে। এবার টক তৈরির জন্য তেঁতুলের ক্বাথ রেডি।'
  '\n(৫) এবার একটি পাত্রে তেল গরম করে শুকনা মরিচ ছিড়ে কুঁচি করে তেলে দিয়ে ভাজতে হবে। মরিচ পুড়িয়ে ফেলবেন না,'
  ' ভাজা হলে জিরা গুড়া দিয়ে তেঁতুলের ক্বাথ দিয়ে নাড়তে থাকুন।'
  '\n(৬) এরপর এতে বিট লবণ, লবণ ও চিনি দিয়ে নাড়তে থাকুন। চটপটির জন্য যে তেঁতুলের টক বানানো হয় তা একটু ঘন হয় আর ফুচকার টক একটু পাতলা হয়। আপনি আপনার প্রয়োজন মত পানি মিশিয়ে পাতলা বা ঘন তেঁতুলের টক তৈরি করতে পারেন। টেষ্ট করে দেখুন, লবণ বা চিনি লাগলে দিন। '
  '২-৩ মিনিট পরেই নামিয়ে ফেলুন, সহজেই তৈরি হয়ে গেল তেঁতুলের টক। এবার আপনি চটপটি পরিবেশনের জন্য রেডি।',
      imageUrl: 'assets/images/chotpoti.JPG',

    ),
    brFood(
    id: 'p2',
    title: ' পেয়াজু',
    description: 'পেয়াজু তৈরি উপকরণ:--'
        '\nমসুর ও খেসারি ডাল -১ কাপ,'
 '\n পেয়াজকুচি -২ টেবিল চামচ,'
  '\nকাঁচামরিচ কুচি – ১ টেবিল চামচ,'
  '\nলবন – স্বাদমত,'
  '\nহলুদের গুড়া – ১/২ চামচ,'
 '\n বেসন – ২ টেবিল চামচ,'
  '\nচালের গুড়া – ২ টেবিল চামচ,'
 ' \nআদা ও রসুন বাটা – ১/২ চামচ,'
  '\nধনিয়াপাতা কুচি – ১ টেবিল চামচ'
  '\nতেল – পরিমানমত ( ভাজার জন্য)'
        '\n\n\nপেয়াজু তৈরি পদ্ধতি:--'
        '\nপ্রথমে ডালগুলোকে ৬-৭ ঘন্টা ভিজিয়ে রাখতে হবে।'
    'তারপর ডালগুলোকে ভালো করে ধুয়ে একটি বাটিতে নিয়ে নিতে হবে।'
    'এখন একে একে তেল ছাড়া সব মসলা যেমন – পেয়াজকুচি, আদা ও রসুন বাটা, '
    'কাঁচামরিচ কুচি, ধনিয়াপাতা কুচি, হলুদের গুড়া, বেসন, চালের গুড়া ও স্বাদমত লবন দিয়ে দিতে হবে।'
        '\nএখন সবগুলো উপকরন হাত দিয়ে মিশিয়ে নিতে হবে। এখন যদি মনে হয় উপকরনগুলো শুকনো'
        ' হয়ছে তখন অল্প অল্প পানি দিয়ে একটি শক্ত ডো তৈরী করে নিতে হবে।'
        '\nতারপর চুলায় পর্যাপ্ত পরিমানে তেল দিয়ে ভালোকরে গরম করে নিতে হবে। তেল গরম হয়ে গেলে একটু একটু করে পেয়াজুর '
        'মত করে তেলে দিয়ে দিতে হবে। এখন এই পেয়াজু গুলোকে ব্রাউন কালার করে ভেজে নিতে হবে। তারপর একটি কিচেন টিস্যুর উপর তুলে নিলে হয়ে যাবে মুচমুচে আস্ত ডালের পেয়াজু তৈরি।',
    imageUrl: 'assets/nastaimages/piyaju.jpg',

  ),


    brFood(
      id: 'p3',
      title: 'আলুর চিপস',
      description: 'আলুর চিপস তৈরি করার ঘরোয়া সহজ পদ্ধতি:--'
          '\n\n\npotato chips তৈরি উপকরণ'
          '\n বড় সাইজের আলু -২ টি'
      '\nবিট লবণ -১/২ চামচ'
   ' \nচাট মসলা  -১/২ চামচ'
    '\nমরিচের গুড়া- ১/২ চা চামচ'
    '\nনরমাল লবণ -১/২'
    '\nটেস্টিং সল্ট -১ চিমটি'
    '\nতেল – ভাজার জন্য'
          '\n\n\nআলুর চিপস তৈরি পদ্ধতি::--'
          '\nপ্রথমে আলুর খোসা ছাড়িয়ে আলু গুলো কে ভালোভাবে ধুয়ে নিতে হবে। '
          'এখন একটি গ্রেটার মেশিনের সাহায্যে / ছুরির সাহায্যে পাতলা পাতলা গোল করে কেটে দিতে হবে। '
          '\nএ সময় খেয়াল রাখতে হবে যেন আলুগুলো সাইজ সব গুলো এক হয় কোন টা বড় বা কোন টা ছোট না হয়। '
          'কাটার সাথে সাথে এই আলু গুলোকে পানির মধ্যে চুবিয়ে রাখতে হবে। '
          '\nপানির মধ্যে না চুবিয়ে রাখলে আলু কালো হয়ে যাবে । এমন করে সবগুলো আলু কেটে পাতলা টুকরো করে নিতে হবে। '
          'এখনই আলোগুলোকে ৪থেকে ৫বার ভালোভাবে ধুয়ে নিতে হবে। তারপর একটি বড় বলের মধ্যে ফ্রিজের ঠান্ডা পানি নিতে হবে। '
          '\nএখন এ পানির মধ্যে সামান্য একটু লবণ দিয়ে দিতে হবে। তারপর একটি চামচের সাহায্যে এই পানির সাথে লবণ'
          ' মিশিয়ে নিতে হবে। তারপর ধুয়ে রাখা আলুকে পানির মধ্যে দিয়ে দিতে হবে । এ পানির মধ্যে চুবিয়ে রাখতে হবে ১০ মিনিটের জন্য।'
          '\n১০ মিনিট পর একটি টিস্যু বা কাপড়ের উপর আলু গুলো তুলে নিতে হবে। এখন অপেক্ষা করতে হবে এই আলু থেকে যেন সবগুলো পানি শুকিয়ে যায়। '
          'যখন পানি শুকিয়ে যাবে তখন চুলায় একটি কড়াইতে তেল দিয়ে দিতে হবে।'
          '\nতেল গরম হয়ে আসলে ধুয়ে শুকিয়ে রাখা আলো দিয়ে যেতে হবে। তারপর ১০ থেকে ১৫মিনিট '
          'ধরে ধৈর্য নিয়ে উল্টে পাল্টে আলু বেজে কুড়মুড়ে করে নিতে হবে।'
          '\nএখন একটি মসলা তৈরি করে নিতে হবে। তার জন্য একটি বাটি নিয়ে নিতে হবে। তারপর একে একে বিট লবণ, চাট মসলা, মরিচের গুঁড়া, টেস্টিং সল্ট '
          'এবং নরমাল লবণ নিয়ে একটি চামচের সাহায্যে একসাথে মিশিয়ে নিতে হবে।'
          '\nএখন চিপসগুলো হালকা গরম থাকা অবস্থায় এই মসলা ওপরে ছিটিয়ে দিতে হবে। মসলা ছিটানো হয়ে গেলে হাত দিয়ে  উল্টে পাল্টে দিতে হবে।'
          ' তারপর অপেক্ষা করতে হবে ঠান্ডা হওয়ার জন্য। ঠান্ডা হলে দেখবেন কুড়মুড়ে আলুর চিপস তৈরি।',
      imageUrl: 'assets/nastaimages/chips.jpg',

    ),
    brFood(
      id: 'p4',
      title: 'ফালুদা',
      description: 'মজাদার ফালুদা রেসিপি | ঘরে ফালুদা তৈরি রেসিপি--'
          '\n\n\nমজাদার ফালুদা রেসিপি উপকরণ'
          '\nদুধ ১ লিটার'
  '\nডিম ১ টি   ফালুদা মিক্স  – এক প্যাকেট'
 ' \nসবুজজেলি ১টেবিল চামচ ( ফালুদা মিক্স এর প্যাকেটের ভিতরে এই জেলি পাওয়া যাবে)'
  '\nলাল জেলি ১টেবিল চামচ ( ফালুদা মিক্স এর প্যাকেটের ভিতরে এই জেলি পাওয়া যাবে)'
 ' \nকলা ১ টেবিল চামচ'
 '\n আপেল ১টেবিল চামচ'
  '\nআনার ১ টেবিল চামচ'
  '\nআইসক্রিম ১ টেবিল চামচ'
          '\n\n\nমজাদার ফালুদা রেসিপি প্রণালী--'
          '\n প্রথম ধাপ-'
          '\nপ্রথমে আমরা দুই ধরনের জেলি প্রিপারেশন করে নিব। জেলি তৈরি করার জন্য একটি পাত্র নিয়ে নিবো।'
          ' পাত্রে এক কাপ পরিমাণ পানি দিয়ে চুলায় বসিয়ে দিব। যখন পানি গরম হয়ে আসবে তখন এক প্যাকেট জেলি দিয়ে দিব।'
      'এখন এই মিশ্রন টাকে কিছুক্ষণ নাড়তে থাকব। যখন পানি একটু কমে আসবে তখন এটাকে একটা '
      'ছড়ানো প্লেটে / বাটিতে নিয়ে নেব। এখন এই প্লেট  টাকে নরমাল রেখে ঠাণ্ডা করে নিব।'
    'যখন এটা ঠান্ডা হয়ে আসবে তখন এক ঘন্টার জন্য নরমাল ফ্রিজে রেখে দেবো। এমন করে অন্য জেলিটা তৈরি করে নিব।'
          '\n\n\n দ্বিতীয় ধাপ:--'
          '\nএখন একটি ছড়ানো পাত্রে এক লিটার পরিমাণ দুধ দিয়ে দিব। দুধটাকে কিছুক্ষণ জ্বাল করে ঘন করে আনব।'
          ' একটু ঘন হয়ে আসলে এক প্যাকেট ফালুদা মিক্স দিয়ে এটাকে নাড়তে থাকতে হবে এক প্যাকেট ফালুদা মিক্স দিয়ে এটাকে নাড়তে থাকতে হবে।'
          ' এ পর্যায়ে নাড়া বন্ধ রাখা যাবে না।'
      'নাড়া বন্ধ করে দিলে নিচ থেকে এটা লেগে যাওয়ার সম্ভাবনা থাকে। এটা নাড়তে নাড়তে যখন দেখা যাবে  নুডুলস এবং সাবুদানা গুলো সিদ্ধ হয়ে গেছে। '
      'তখন চুলা অফ করে দিতে হবে। চুলা থেকে নামানোর পর।'
          'যখন এই মিশ্রণটি হালকা একটু ঠান্ডা হয়ে আসবে তখন তার মধ্যে একটা ডিম ফেটে নিয়ে অল্প অল্প করে দিয়ে মিশিয়ে দিতে হবে। এখন এটাকে '
          'নরমাল তাপমাত্রা ঠান্ডা করে নিব। ঠান্ডা হয়ে আসলে এটাকে নরমাল ফ্রিজে এক ঘন্টার জন্য রেখে দিব।'
          '\n\n\n তৃতীয় ধাপ:-এখন এই ফালুদা টা পরিবেশনের জন্য আপনার আপনাদের পছন্দ অনুযায়ী পরিবেশন করতে পারেন। আমি যেভাবে করেছি তা এখানে বলে দিচ্ছি।'
          ' একটি বাটিতে কিছু ফালুদা মিক্স দিব। তারপর দুই ধরনের জেলি দিব। তারপর কলা এবং আপেল দিব।'
     ' এখন আবার কিছু ফালুদা মিক্স দিব এখন আবার কিছু ফালুদা মিক্স দিব। এখন কিছু ফল এবং দু দিক দিয়ে দুই ধরনের জেলি দিয়ে দিব। তারপর আইসক্রিম দিব। '
      'আমি ওপরে কিছু চেরি ফল দিয়ে পরিবেশন করে দিছি। আপনারা আপনাদের মত করে নিবেন। এইতো দেখলেন তো ঘরে বসে কত সহজেই ফালুদা তৈরি করা যায়। ',
      imageUrl: 'assets/nastaimages/feluda.jpg',

    ),
    brFood(
      id: 'p5',
      title: 'জিলাপি',
      description: 'জিলাপি তৈরি রেসিপি | ঘরেই তৈরি করুন সুস্বাদু জিলাপি'
          '\n জিলাপি তৈরি রেসিপি উপকরণ'
          '\nজিলাপি সিরার জন্য যা যা লাগবে'
          '\n\n চিনি -2 কাপ'
      '\nপানি -১/2 কাপ'
    '\nএলাচ -2 টুকরো'
    '\nলেবুর রস -1 টেবিল চামচ'
          '\n\n জিলাপির ব্যাটার তৈরীর জন্য যা যা লাগবে :'
          '\n ময়দা  -1 কাপ,'
  'চালের গুড়া  – ১/২ কাপ'
  'বেসন – ১/২ কাপ,'
  'বেকিং সোডা -১ চামচ'
 ' ফুট কালার  -১ চিমটি পরিমাণ ( অপশনাল)'
  'নরমাল পানি – প্রয়োজনমতো'
  'তেল  -পরিমানমতো ( জিলাপি ভাজার জন্য) '
          '\n\n\n জিলাপি তৈরি রেসিপি প্রস্তুত প্রণালী '
          '\nপ্রথম ধাপ'
          '\n প্রথমে আমাদেরকে জিলাপির জন্য যে সিরা তা তৈরি করে নিতে হবে। তার জন্য চুলায় একটি  ছড়ানো পাত্রের মধ্যে চিনি ও পানি দিয়ে দিতে হবে।'
          ' যখন চিনি গলে যাবে তখন তার মধ্যে দুটো এলাচ দিয়ে দিতে হবে।'
          '\nদ্বিতীয় ধাপ'
          '\nএখন এই চিনির সিরাটা হালকা ঘন হয়ে আসা পর্যন্ত অপেক্ষা করতে হবে। যখন আপনি হাত দিয়ে ধরলে বুঝবেন যে এটা'
          ' আঠালো হয়ে আসছে তখন একটেবিল চামচ লেবুর রস দিয়ে তার মধ্যে ভালোভাবে মিশিয়ে দিতে হবে। '
          'এখন চুলা অফ করে দিয়ে এটাকে ঢাকনা দিয়ে ঢেকে রেখে দিতে হবে । '
          '\nতৃতীয় ধাপ'
          '\n তারপর জিলাপি ব্যাটার তৈরির জন্য একটি বড় মিক্সিং বোল নিয়ে নেব। এরমধ্যে চালের গুঁড়ো, বেসন, বেকিং সোডা, ময়দা একসাথে দিয়ে ভালোভাবে মিশিয়ে নিতে হবে।'
          ' এই শুকনো উপকরণ মেশান হয়ে গেলে। অল্প অল্প করে পানি দিয়ে একটি ব্যাটার তৈরি করে নিতে হবে। ব্যাপারটা এমন হবে বেশি ঘন আবার বেশি পাতলা ও না।'
          '\nব্যাটারটা তৈরি করার সময় একটু সময় নিয়ে ভালোভাবে মিশিয়ে নিতে হবে। এ সময় খেয়াল রাখতে হবে যেন জিলাপির ব্যাটার বেশি পাতলা না হয়ে যায়। যদি '
          ' জিলাপির ব্যাটার পাতলা হয়ে যায় তখন আপনার জিলাপির প্যাচ সুন্দরভাবে দিতে পারবেন না। এমনকি পেচগুলো দেওয়ার সাথে সাথে ছড়িয়ে যাবে। '
          '\nচতুর্থ ধাপ'
          '\nযখন ব্যাটারটা তৈরি হয়ে যাবে তখন একটি সসের বোতল এর মধ্যে ব্যাটার দিয়ে দিতে হবে। যদি আপনাদের কাছে কোন সসের বোতল না থাকে তখন নরমাল পানির '
          'বোতলের মুখ টা ছিদ্র করে এর ভিতরে জিলাপির ব্যাটার দিয়ে দিতে হবে।'
          '\nএখন জিলাপি ভাজার জন্য একটি ছড়ানো পাইপেনের মধ্যে তেল গরম করে নিতে হবে। যখন তেল গরম হয়ে আসবে তখন বোতলটাকে হালকা একটু চাপ দিয়ে জিলাপির সেভ দিয়ে দিতে হবে।'
          ' এরকম করে আপনার পাইপেন বা কড়াইতে যতটুকু দেওয়া যায় ততটুকু দিতে হবে ।'
          '\nএক্ষেত্রে মনে রাখতে হবে যেন একটা জিলাপি সাথে আরেকটা জিলাপির প্যাচ না লাগে। এখন এই জিলাপি গুলো কে মিডিয়াম আছে মচমচে করে ভেজে নিতে হবে। '
          '\nযখন জিলাপি গুলো ভাজা শেষ হবে তখন এই জিলাপি গরম অবস্থায় শিরার মধ্যে দিয়ে দিতে হবে। এক্ষেত্রে মনে রাখতে হবে যেন সিরাটা হালকা কুসুম গরম থাকে।'
          '\nজিলাপি দেওয়ার পর 20 সেকেন্ড পরে আবার উল্টে অন্যপাশে সিরার মধ্যে দিয়ে দিতে হবে। 20 সেকেন্ড পরে জিলাপি তুলে নিতে হবে। এমন করে সবগুলো জিলাপি তৈরি করে নিতে হবে।',
      imageUrl: 'assets/nastaimages/jilapi.jpg',

    ),
    brFood(
      id: 'p6',
      title: 'লুচি',
      description: 'নরম ফুলকো লুচি রেসিপি'
          '\nনরম ফুলকো লুচি তৈরী করতে যা লাগবে:'
          '\nআটা ও ময়দার মিশ্রণ : ১ কাপ, লবণ : স্বাদমত, তেল : ২ টেবিল চামচ '
          '( ডো তৈরির জন্য), তেল : ভাজার জন্য, পানি : প্রয়োজনমত ( ডো তৈরির জন্য) ।'
          '\n\n\nনরম ফুলকো লুচি বানাবেন যেভাবে:'
          '\nএকটি বড় বাটিতে আটা ও ময়দার মিশ্রণ নিয়ে তার মধ্যে লবন ও ২ টেবিল চামচ তেল দিয়ে দিতে হবে। এখন হাতের সাহায্য সব গুলো উপকরণ একসাথে মিশিয়ে নিতে হবে। এখন অল্প '
          'অল্প পানি দিয়ে একটি শক্ত ডো তৈরি করে নিতে হবে। এই ডোটাকে ৩০ মিনিটের জন্য ঢেকে রেখে দিতে হবে।'
          '\n৩০ মিনিট পর এই ডো থেকে ছোট ছোট লেচি কেটে নিতে হবে। এখন এই লেচি থেকে গোল করে হালকা মোটা রেখে রুটি বেলে নিতে হবে।  চুলায় একটি কড়াইতে পর্যাপ্ত পরিমাণ তেল দিয়ে গরম করে নিতে হবে।',
      imageUrl: 'assets/nastaimages/luchi.jpg',

    ),
    brFood(
      id: 'p7',
      title: 'চিকেন কিমা পরোটা ',
      description: 'চিকেন কিমা পরোটা তৈরির সহজ রেসিপি'
          '\n\nচিকেন কিমা পরোটা তৈরির উপকরণ'
          '\n মুরগির মাংসের কিমা : ১  কাপ ( আপনারা ইচ্ছা করলে গরুর মাংসের কিমা দিতে পারেন)'
     '\n পেঁয়াজ কুচি : ১ টেবিল চামচ'
    '\nকাঁচামরিচ কুচি : ১ টেবিল চামচ'
    '\nধনিয়া পাতা : ১ টেবিল চামচ'
    '\nআদা ও রসুন বাটা : ১ টেবিল চামচ'
   '\n জিরা গুঁড়া : আধা চা চামচ'
    '\nগরম মসলা গুঁড়া : হাফ চা চামচ'
   '\n ধনিয়া গুঁড়া : হাফ চা চামচ'
   '\n লবণ : স্বাদ'
    '\nঘি :  ১ টেবিল চামচ'
          '\n\nচিকেন কিমা পরোটা ডো তৈরির উপকরণ'
          '\nময়দা : ১কাপ'
     '\n তেল : ১ টেবিল চামচ'
     '\n লবণ : স্বাদমতো'
    '\nপানি : প্রয়োজনমতো'
          '\n চিকেন কিমা পরোটা তৈরির রেসিপি প্রণালী'
          '\nপ্রথম ধাপ'
          '\nপ্রথমে একটি কড়াইতে ১ টেবিল চামচ ঘি দিয়ে তার মধ্যে পেঁয়াজ কুচি দিয়ে দিতে হবে। এখন পেঁয়াজ একটু হালকা ব্রাউন কালার চলে আসবে তার মধ্যে '
          ' মুরগির মাংসের কিমা দিয়ে দিতে হবে। মাংস দেয়ার পরে এর মধ্যে একে একে আদা রসুন বাটা জিরা গুড়া ধনিয়ার গুড়া ধনিয়ার গুড়া গরম মসলার গুঁড়া কাঁচা মরিচ কুচি '
          'ও স্বাদমতো লবণ দিয়ে দিতে হবে। তারপর এটাকে ডেকে কিছুক্ষণ রান্না করে নিতে হবে।'
          '\nযখন মাংস সিদ্ধ হয়ে পানি কমে আসবে তখন এর মধ্যে ধনিয়াপাতা কুচি দিয়ে দিতে হবে। এখন কিছুক্ষণ নেড়েচেড়ে এটাকে তুলে ঠান্ডা করে নিতে হবে।'
          '\n দ্বিতীয় ধাপ'
          '\nএকটি মিক্সিং বলে ময়দা,  লবণ ও তেল দিয়ে একসাথে ভালো ভাবে মিশিয়ে নিতে হবে। এখন অল্প অল্প করে  পানি দিয়ে একটি খামির তৈরি করে নিতে হবে। '
          'এখন খামিরটাকে ঢাকনা দিয়ে ১০মিনিট ঢেকে রাখতে হবে।'
          '\nতৃতীয় ধাপ'
          '\nএখন এই খামিরটাকে একটু মথে নিতে হবে। তারপর এটাকে সমানভাবে ছোট ছোট লেচি কেটে নিতে হবে( পরোটার জন্য যতটুকু প্রয়োজন) । এখন একটি লেচি নিয়ে একটি রুটির মত করে বেলে নিতে হবে।'
          ' রুটি বেলা শেষ হলে এর মাঝখানে তৈরি করে রাখা মাংসের কিমা দিয়ে দিতে হবে। তারপর সাইড দিয়ে একটু পানি লাগিয়ে নিতে হবে।'
          '\nএখন সাইট থেকে এই রুটি তাকে টেনে মাঝখানে এনে একসাথে লাগিয়ে মুখ বন্ধ করে দিতে হবে। তারপর এটাকে হাতে নিয়ে একটু চাপ দিয়ে বড় করে নিতে হবে।'
          ' এ পর্যায়ে এটাকে বেনলি দিয়ে বলা যাবে না। এভাবে করে প্রত্যেকটি পরোটা তৈরি করে নিতে হবে।'
          '\n চতুর্থ ধাপ'
          '\nএখন একটি কড়াইতে সামান্য পরিমাণ ঘি দিয়ে নিতে হবে। ঘি গরম হয়ে আসলে তৈরি করা পরোটা দিয়ে দিতে হবে। এখন একটি ঢাকনা দিয়ে ঢেকে কিছুক্ষণ অপেক্ষা করতে হবে। ততক্ষণ অপেক্ষা করতে হবে'
          ' যতক্ষণ না এই পিট  ব্রাউন কালার চলে না আসে। এখন উল্টে অন্যপাশ ব্রাউন করে নিতে হবে।',
      imageUrl: 'assets/nastaimages/porota.jpg',

    ),
    brFood(
      id: 'p8',
      title: 'চকলেট বিস্কুট',
      description: 'চকলেট বিস্কুট রেসিপি | চুলায় তৈরি বিস্কুট | chocolate cookies'
          '\n\nচকলেট বিস্কুট রেসিপি উপকরণ'
          '\nময়দা  ১ কাপ'
  '\nআইসিং সুগার ১/২ কাপ'
 '\n কোকো পাউডার, ১/৪ কাপ'
 '\n বেকিং পাউডার হাফ চা চামচ'
 '\n বেকিং সোডা- ১ টিস্পপুন'
 '\n তেল- প্রয়োজনমতো'
  '\nসাদা তিল -সাজানোর জন্য (ইচ্ছানুযায়ী)'
          '\n\n\nচকলেট বিস্কুট রেসিপি প্রণালী'
          '\nপ্রথমে একটি মিক্সিং বলে ময়দা, আইসিং সুগার, কোকো পাউডার, বেকিং পাউডার, বেকিং সোডা কে  একসাথে একটি চালনীর সাহায্যে চেলে নিতে হবে। তারপর অল্প'
          ' অল্প করে তেল দিয়ে একটি ডো তৈরি করে নিতে হবে। তারপরে বিস্কিট গুলো ব্যাক করার জন্য একটি ছড়ানো ট্রে নিতে হবে।'
          '\nএরপর এই ট্রে এর ওপরে সামান্য একটু তেল ব্রাশ করে দিতে হবে। তারপর একটি নরমাল কাগজ  বিছিয়ে দিতে হবে। এখন এই '
          'বিস্কিটের ডোটা থেকে একটু একটু নিয়ে বিস্কিটের সেপ দিয়ে দিতে হবে।'
          '\nতারপরে বিস্কিট গুলোকে ওই ট্রেতে  নিয়ে নিতে হবে। এখন চুলায় একটি পাত্র বসিয়ে তার ওপর একটি স্ট্যান্ড দিয়ে ৫ মিনিট প্রিহিট করে নিতে হবে। তারপরে বিস্কিটের এই ট্রে পাত্রের স্ট্যান্ডের উপরে দিয়ে দিতে হবে।'
          '\nএখন চুলার আঁচ মিডিয়াম রেখে 20 থেকে 25 মিনিট অপেক্ষা করতে হবে। 20 থেকে 25 মিনিট পর চেক করে নিতে হবে বিস্কিট গুলা হয়েছে কিনা। যদি হয়ে থাকে তখন এটাকে নামিয়ে ঠান্ডা করে নিতে হবে,'
          ' আর যদি না হয় তখন আরো 5 মিনিট অপেক্ষা করতে হবে।'
          '\n বিশেষ দ্রষ্টব্য :  বিস্কিট গরম থাকা অবস্থায় মনে হবে যেন হয় নাই। কিন্তু যখন এগুলো ঠান্ডা হয়ে যাবে তখন এটা শক্ত হয়ে যাবে। বিস্কিট গরম থাকা অবস্থায় নরম থাকে । ',
      imageUrl: 'assets/nastaimages/choklet_biskut.jpg',

    ),
    brFood(
      id: 'p9',
      title: 'বোম্বে মিক্স সালাদ',
      description: 'বোম্বে মিক্স সালাদ তৈরির পদ্ধতি'
          '\n\n\nউপকরণ'
          '\nবোম্বে মিক্স- ১ কাপ'
     '\n টমেটো কিউব- ১ কাপ'
    '\nশসা কিউব- ১ কাপ'
   '\n পেঁয়াজ কুঁচি- ২-৩ টেবিল চামচ'
    '\nধনেপাতা কুঁচি- ১ চা চামচ'
    '\nপুদিনাপাতা কুঁচি- ২ টেবিল চামচ'
    '\nআমের চাটনি- ১ টেবিল চামচ'
    '\nলবণ- স্বাদমতো'
          '\n\n\nপ্রস্তুত প্রনালী--'
          '\n(১) প্রথমে একটি পাত্রে একে একে টমেটো কিউব, শসা কিউব, পেঁয়াজ কুঁচি, ধনেপাতা কুঁচি, পুদিনাপাতা কুঁচি, আমের চাটনি ও লবণ দিয়ে ভালো করে মিশিয়ে নিবো।'
          '\n(২) মেশানো হলে এতে বোম্বে মিক্স চানাচুর দিয়ে আবারও ভালো করে মেশাবো।'
          '\n(৩) হয়ে গেলে সালাদ ডিশে সুন্দর করে সাজিয়ে পরিবেশন করতে পারেন মজাদার বোম্বে মিক্স সালাদ।'
          '\nদেখলেন তো কিভাবে খুব সহজেই তৈরি করা যায় মজাদার এই সালাদটি। বিকেলের নাস্তায়, আপনার প্রতিদিনের ডায়েট চার্টে অথবা মেহমানদারীতেও রাখতে পারেন সুস্বাদু কুড়মুড়ে বোম্বে মিক্স সালাদ।'
          ' তো তৈরি করে ফেলুন মজাদার এই সালাদটি এবং উপভোগ করুণ।',
      imageUrl: 'assets/nastaimages/bombe_mixed.jpg',

    ),
    brFood(
      id: 'p10',
      title: 'ব্রেড আলু পাকোড়া',
      description: 'ব্রেড আলু পাকোরা তৈরির পদ্ধতি'
          '\nউপকরণ'
          '\n(১) পাউরুটি- ৩ টুকরা'
          '\n(২) আলু সিদ্ধ- ৩টি'
          '\n(৩) কাঁচা মরিচ কুঁচি- ২ চা চামচ'
          '\n(৪) পেঁয়াজ কুঁচি- ২ চা চামচ'
          '\n(৫) গোল মরিচ গুড়া- ১/২ টেবিল চামচ'
          '\n(৬) ডিম- ২টি'
          '\n(৭) পেঁয়াজ বেরেস্তা- ২ চা চামচ'
          '\n(৮) লবণ- পরিমাণমতো'
          '\n(৯) ব্রেড ক্রাম্বস- ১ কাপ'
          '\n(১০) সয়াবিন তেল- ১ কাপ'
          '\n(১১) সরিষার তেল- ২ চা চামচ'
          '\n(১২) ধনেপাতা কুচি- ২ চা চামচ'
          '\n\n\nপ্রস্তুত প্রণালী'
          '\n১. প্রথমে আলু সিদ্ধ করে নিতে হবে।'
          '\n২. তারপর একটি পাত্রে পাউরুটির চারপাশ কেটে মাঝের দিক পানিতে ভিজিয়ে রাখবো।'
          '\n৩. এবার পাউরুটির পানি ঝরিয়ে নিয়ে সিদ্ধ করা আলুর সাথে ভালো করে মেখে মিশিয়ে নিতে হবে।'
          '\n৪. মেশানো হলে তাতে একেএকে পেঁয়াজ কুঁচি, পেঁয়াজ বেরেস্তা, কাঁচা মরিচ কুঁচি, গোল মরিচ গুড়া,'
          ' লবণ, সরিষার তেল এবং ধনেপাতা মিশিয়ে নিব।'
          '\n৫. এবার একটি প্যানে তেল গরম করে নিব।'
          '\n৬. এবার পাকোড়ার শেইপ করে ডিমে চুবিয়ে ব্রেড ক্রাম্বসে গড়িয়ে গরম তেলে ভেজে নিতে হবে। '
          'পাকোরা বাদামি রঙ হলে নামিয়ে নিব।'
          '\nহয়ে গেলো মজাদার ব্রেড আলু পাকোড়া। টমেটো কিংবা চিলি সসের সাথে পরিবেশন করতে পারেন সুস্বাদু ডিশটি। '
          'তৈরি করুন মজাদার ব্রেড আলু পাকোড়া এবং উপভোগ করুন বৃষ্টিময় বিকেল!',
      imageUrl: 'assets/nastaimages/bread-alu-pakora.jpg',

    ),
    brFood(
      id: 'p11',
      title: 'ডিম পরোটা',
      description: 'মজাদার ডিম পরোটা বানানোর পদ্ধতি-'
          '\n\n\nউপকরণ :'
          '\nময়দা – ২ কাপ'
      'ডিম- ৪টি'
    'মাংসের কিমা- ১ কাপ'
   ' পেঁয়াজ বাটা- ৩ টেবিল চামচ'
   ' আদা বাটা- ১ চা চামচ'
    'রসুন বাটা- ১ টেবিল চামচ'
    'গরম মসলা- ১টি তেজপাতা, ১টি দারুচিনি, ৩টি এলাচ, ২টি গোলমরিচ, ২টি লবঙ্গ'
    'হলুদ গুঁড়া- ১ চা চামচ'
    'ধনিয়া গুঁড়া- ১ চা চামচ'
    'মরিচ গুঁড়া- ১ চা চামচ'
   ' জিরা গুঁড়া- ১/২ চা চামচ'
    'কাঁচামরিচ কুঁচি- ১ টেবিল চামচ'
    'ধনেপাতা কুঁচি- ১ টেবিল চামচ'
    'তেল- ভাজার জন্য'
    'লবণ- স্বাদমতো'
    'পানি- প্রয়োজনমতো'
          '\nপ্রস্তুত প্রণালী :'
          '\n১. প্রথমে একটি বাটিতে ময়দা, লবণ, তেল এবং পানি দিয়ে মাখিয়ে  রুটি বানানোর মতো করে ডো বানিয়ে রেখে দিন।'
          '\n২. তারপর একটি ফ্রাইং প্যান-এ প্রয়োজনমতো তেল দিয়ে এরমধ্যে গরম মসলা দিয়ে কিছুক্ষণ ভেজে নিন। মনে রাখবেন গরম মসলা ভাজার দুটি কারণ আছে, '
          'প্রথমটি হলো সুন্দর একটা গন্ধ বের হয় আর অন্যটি হলো এটি খাবারের স্বাদ বাড়ায়।'
          '\n৩. এরপর এর মধ্যে একে একে পেঁয়াজ, রসুন, আদা বাটা, হলুদ, ধনিয়া, জিরা, মরিচের গুঁড়া, গরম মসলা এবং পানি দিয়ে  '
          'ভালোভাবে কষিয়ে নিন আর হ্যাঁ অবশ্যই লবণ দিতে ভুলবেন না।'
          '\n৪. মসলা কষানো হয়ে গেলে কিমা করা মাংস দিয়ে দিন। আপনার পছন্দ মতো যেকোন মাংসের কিমা ব্যবহার করতে পারেন।'
          '\n৫. মাংসের কিমা দিয়ে ঢেকে দিন। মাংস থেকে পানি উঠবে। এই পানি শুকিয়ে গেলে যদি দেখেন মাংস সিদ্ধ না হয় তাহলে সিদ্ধ করার জন্য আবার পানি দিন।'
          ' পানি শুকিয়ে গেলে নামিয়ে ঠান্ডা করে নিন।'
          '\n৬. এবার রুটি বানিয়ে নিন। রুটি বানানো হয়ে গেলে এর মধ্যে কিমা দিয়ে দিন, কিমার উপর কাঁচা মরিচ কুঁচি ও ধনেপাতা কুঁচি দিয়ে '
          'পরোটার আকৃতিতে ভাজ করে বেলে নিন।'
          '\n৭. এখন একটি বাটিতে ৪টি  ডিম সামান্য লবণ দিয়ে ফেটে নিন।'
          '\n৮. এবার একটি কড়াইতে তেল নিয়ে নিন। তেলের পরিমাণ হবে এমন যেন পরোটাগুলো ডুবো তেলে ভাজা যায়। তেল গরম হয়ে এলে পরোটা ডিমে চুবিয়ে ভেজে নিন। '
          'অবশ্যই একটি একটি করে ভাজবেন। হালকা লাল রঙের হলে নামিয়ে নিন।'
          '\nগরম গরম পরিবেশন করুন এই অসাধারণ মজাদার পরোটা। খুব সহজে ঘরে বসেই হাতের কাছের জিনিস দিয়েই তৈরি করতে পারেন মজাদার এই ডিশ-টি। তো ঝটপট বানিয়ে ফেলুন এবং উপভোগ করুন মজাদার ডিম পরোটা।',
           imageUrl: 'assets/nastaimages/egg-paratha.jpg',

    ),
    brFood(
      id: 'p12',
      title: 'ম্যাশড পটেটো বল',
      description: 'ম্যাশড পটেটো বল তৈরির পদ্ধতি'
          '\n\n\nউপকরণ:--'
          '\nবড় আকৃতির আলু- ৩টি'
     '\n ময়দা- ১/২কাপ'
   '\n ডিমের কুসুম- ৩টি'
    '\nমাখন- ২চা চামচ'
    '\nলবণ- পরিমাণমতো'
    '\nগোলমরিচ- স্বাদমতো'
    '\nতেল– ভাজার জন্য'
    '\nব্রেড ক্রাম্প- ১/২কাপ'
          '\n\nপ্রস্তুত প্রণালী:-'
          '\n১) প্রথমে আলু সেদ্ধ করে নিন।'
          '\n২) সেদ্ধ হয়ে এলে নামিয়ে ঠান্ডা করে খোসা ছাড়িয়ে ম্যাশ করে নিতে হবে।'
          '\n৩) এবার ম্যাশ করা আলুর সাথে লবণ, মাখন, গোলমরিচের গুঁড়া এবং ডিমের কুসুম ভালো করে মিশিয়ে নিন।'
          '\n৪) মেশানো হলে ২-৩ ঘন্টা রেখে দিতে হবে। এতে প্রতিটি উপাদান ভালোভাবে মিশে যাবে।'
          '\n৫) এবার আলুর মিশ্রণটি দিয়ে গোলগোল বলের মতো শেইপ তৈরি করে নিতে হবে।'
          '\n৬) এখন বলগুলো প্রথমে ময়দার উপর গড়িয়ে নিন তারপর ডিমের মিশ্রণে ডুবিয়ে নিন।'
          '\n৭) এবার একটি প্যানে তেল গরম করে নিবো। গরম হয়ে এলে বলগুলো ব্রেড ক্রাম্পে গড়িয়ে গরম তেলে ভেজে নিতে হবে।'
          '\n৮) অল্প আঁচে বলগুলো ভেজে নিবেন। বাদামী রঙ হয়ে গেলে নামিয়ে নিন।',
      imageUrl: 'assets/nastaimages/mashed_potato.jpg',

    ),
    brFood(
      id: 'p13',
      title: 'ওটস অমলেট',
      description: 'ওটস অমলেট বানানোর পদ্ধতি'
          '\nউপকরণ:-'
          '\nডিম– ৪টি'
     '\n দুধ- ১/২ টেবিল চামচ'
    '\nলবণ- পরিমাণমতো'
    '\nওটস– ২ টেবিল চামচ'
    '\nপেঁয়াজ কুঁচি- ১ টেবল চামচ'
    '\nকাঁচা মরিচ কুঁচি- ১ চা চামচ'
    '\nক্যাপসিকাপ কুঁচি- ১ চা চামচ'
    '\nগাজর- ১ চা চামচ'
    '\nধনেপাতা- ১/২ চা চামচ'
    '\nতেল- ২ চা চামচ'
    '\nগোল মরিচ গুঁড়া- এক চিমটি'
          '\n\n\nপ্রস্তুত প্রণালী'
          '\n১. প্রথমে একটি পাত্রে ওটস ও দুধ মিশিয়ে ৫ মিনিট রেখে দিতে হবে।'
          '\n২. তারপর আরেকটি পাত্রে ডিম ফাটিয়ে তাতে একে একে লবণ, গোল মরিচ, কাঁচা মরিচ,'
          ' ক্যাপসিকাম, গাজর, পেঁয়াজ কুঁচি এবং ধনেপাতা দিয়ে মিশিয়ে নিন।'
          '\n৩. মেশানো হয়ে গেলে তাতে দুধে ভেজানো ওটস দিয়ে ভালো করে মিশিয়ে নিতে হবে।'
          '\n৪. তারপর একটি প্যানে তেল গরম করে নিবো।'
          '\n৫. তেল গরম হয়ে গেলে তাতে ডিমের মিশ্রণটি দিয়ে অল্প আঁচে ভেজে নিতে হবে।'
          '\n৬. বাদামি রঙ হয়ে গেলে তুলে নিবো।'
          '\nতৈরি হয়ে গেলো মজাদার ওটস অমলেট। খুব সহজেই তৈরি করুন এবং বিকেলের নাস্তায় আনুন নতুনত্ব!',
      imageUrl: 'assets/nastaimages/Oats_Omelette.jpg',

    ),
    brFood(
      id: 'p14',
      title: 'সেমাই সুজির বরফি',
      description: 'সেমাই সুজির বরফি তৈরির পদ্ধতি'
          '\nউপকরণ:--'
          '\nসেমাই- ১ কাপ'
      '\nডিম- ৩টি'
    '\nসুজি- ২ কাপ'
    '\nপেঁয়াজ কুঁচি- ৩ টেবিল চামচ'
   '\n কাঁচামরিচ কুঁচি- ২ টেবিল চামচ'
    '\nজিরাগুড়া- ১/২ টেবিল চামচ'
    '\nলবণ- স্বাদমতো'
    '\nধনেপাতা কুঁচি- ২ চা চামচ'
          '\n\n\nপ্রস্তুত প্রণালী:-'
          '\n(১) প্রথমে একটি বাটিতে সুজি নিয়ে তাতে ২টি ডিম দিয়ে মাখিয়ে রেখে দিতে হবে ১৫ মিনিট রেখে দিতে হবে।'
          '\n(২) তারপর এর মধ্যে একে একে পেঁয়াজ কুঁচি, কাঁচামরিচ কুঁচি, জিরাগুঁড়া,'
          ' লবণ ও ধনেপাতা কুঁচি ইত্যাদি দিয়ে ভালো করে মাখিয়ে নিবো।'
          '\n(৩) তারপর একটি ট্রেতে বিছিয়ে নিয়ে পছন্দমতো শেইপে কেটে নিতে হবে।'
          '\n(৪) এবার একটি বাটিতে সেমাই আধা ভেংগে নিবো এবং আরেকটি বাটিতে একটি ডিমে লবণ দিয়ে ফেটিয়ে নিবো।'
          '\n(৫) এবার সুজির তৈরি বরফিগুলো ডিমে ডুবিয়ে আধা গুড়া সেমাইয়ে গড়িয়ে নিবো।'
          '\n(৬) এবার একটি প্যানে তেল গরম করে তাতে বরফিগুলো দিয়ে লাল লাল করে ভেঁজে নিবো।'
          '\nহয়ে গেলে নামিয়ে গরম গরম পরিবেশন করবো মজাদার সেমাই সুজির বরফি। বিকেলের নাস্তায় তৈরি করে উপভোগ করতে পারেন মজাদার এই ডিশটি।'
          ' বড় ছোট সবারই ভালো লাগবে সুস্বাদু সেমাই সুজির বরফি।',
      imageUrl: 'assets/nastaimages/semaisuji.jpg',

    ),
    brFood(
      id: 'p15',
      title: 'চিকেন হালিম',
      description: 'উপকরণ:-'
          '\n১. মুগ ডাল ভাজা আধা কাপ,'
     '\n ২. মসুর ডাল আধা কাপ,'
     '\n ৩. অড়হর ডাল আধা কাপ,'
    '\n৪. মটর ডাল আধা কাপ,'
    '\n৫. ছোলার ডাল আধা কাপ,'
    '\n৬. মাষকলাই ডাল আধা কাপ,'
   ' \n৭. পোলাও চাল আধা কাপ,'
    '\n৮. লবণ স্বাদমতো।'
          '\n\n\nপ্রণালি:-'
          '\nসব উপকরণ ভালোভাবে ধুয়ে হলুদ ১ চা-চামচ ও মরিচ গুঁড়া ১ টেবিল-চামচ, লবণ দিয়ে সেদ্ধ দিতে হবে। সেদ্ধ হলে ভালোমতো ঘুঁটে নিন।'
          '\nউপকরণ:-'
          '\nমাংস রান্না'
      '\n১. চিকেন ১টি ছোট ছোট করে কাটা,'
     '\n ২. হলুদ আধা চা-চামচ,'
    '\n৩. মরিচ ১ চা-চামচ,'
    '\n৪. জিরা ১ চা-চামচ,'
    '\n৫. আদা ১ টেবিল-চামচ,'
    '\n৬. রসুন আধা চা-চামচ,'
    '\n৭. গরমমসলা ৩/৪টি করে,'
    '\n৮. তেল ১ কাপ,'
    '\n৯. লবণ স্বাদমতো,'
    '\n১০. পেঁয়াজ ১ কাপ।'
          '\n\n\nপ্রণালি'
          '\nপাত্রে সব মাখিয়ে মাংস ভালোমতো কষিয়ে রান্না করুন। এবার সেদ্ধ করে রাখা ডাল মাংসের হাঁড়িতে দিয়ে আবার ১৫/২০ মিনিট রান্না করুন।'
          '\nপরিবেশন'
      '\n১. পেঁয়াজ বেরেস্তা আধা কাপ,'
      '\n২. আদা কুচি ১ টেবিল-চামচ,'
    '\n৩. ধনিয়াপাতা ২ টেবিল-চামচ,'
    '\n৪. লেবু পরিমাণমতো,'
   '\n ৫. জিরা গুঁড়া ১ টেবিল-চামচ।'
    '\nবাটিতে হালিম নিয়ে উল্লিখিত উপকরণগুলো দিয়ে পরিবেশন করুন।',
      imageUrl: 'assets/nastaimages/chicken-oats-haleem.jpg',

    ),
    brFood(
      id: 'p16',
      title: 'ভেজিটেবল রোল',
      description: 'রোল র‍্যাপার তৈরি :-'
          '\nডিম – ১ টি'
     '\nড ময়দা বা সাদা আটা – ১+ ১/২ কাপ'
   ' \nডবেকিং পাউডার – ১ চাচামচ'
    '\nডকর্ন ফ্লাওয়ার – ১ টেবিল চামচ'
    '\nডলবণ – ১/২ চাচামচ'
    '\nডচিনি – ২ চাচামচ'
    '\nডনরমাল পানি – ২ কাপ বা এর সামান্য  বেশি'
          '\n\n\nপ্রনালি :-'
          '\n– হ্যান্ড মিক্সার দিয়ে ডিম ভালো করে ফেটে নিন ।'
          '\n– বাকি সব উপকরন এক সাথে ভালো করে মিক্স করে নিন ।'
          '\n– ননস্টিক ফ্রাই প্যানে প্রথমে গরম করে নিন ।'
          '\n– একটি কটনের বল সামান্য তেলে ভিজিয়ে রাখুন ।'
          '\n– গরম প্যানে কটনে বল আলতো করে বুলিয়ে নিন ।'
          '\n– এবার ব্যাটার ১ চামচ করে দিন । আমি ডালের গোল বড় চামচের ১ চামচ দিয়েছি । পরিমাণ মত  দিলেই হবে ।'
          '\n– খুব দ্রুত ব্যাটার দিয়ে প্যান ঘুরিয়ে ঘুরিয়ে রুটির শেপ করে নিন ।'
          '\n– অনেকটা পাটিসাপটা বা চিতই পিঠার মত ।'
          '\n– চেষ্টা করবেন একটু পাতলা টাইপের রুটি করতে ।'
          '\n– কয়েক সেকেন্ডের জন্য ঢেকে দিন । ঢাকনার পানি গড়িয়ে রুটিতে পরার আগে তুলে ফেলবেন । পানি পড়ে গেলে রুটি কাঁচা কাঁচা থাকবে ।'
          '\n– ঢাকনা তুলে অপর পিঠও ১-২ মিনিটের জন্য সেঁকে নিন ।'
          '\n– রুটি গুলো সেঁকে ছাঁকনি বা জালি ঝুড়ির উপরে রাখুন তাহলে রুটি ঘামবেনা ।'
          '\n– সব গুলো একই ভাবে বানিয়ে নিন ।'
          '\n– আমি বানানোর অর্ধেক পর্যায় আরো সামান্য পানি এ্ড করেছি । ব্যাটার ঘন হয়ে গেলে আপনারাও সামান্য পানি এড করতে পারেন ।'
          '\n\n\n– ১২  টি রোল র‍্যাপার হবে ।'
          '\n পুর তৈরি :-'
          '\nপাতা কপি – ১ টি (ছোট)'
  '\nআলু – ২ টি (মাঝারি )'
  '\nপেঁয়াজ + কাঁচামরিচ কুচি'
  '\nস্বাদই ম্যাজিক মশলা – ১ প্যাকেট'
  '\nটেস্টিং সল্ট – ১ চাচামচ (ঐচ্ছিক )'
  '\nলবণ – পরিমাণ মত'
  '\nসামান্য হলুদ'
  '\nতেল – ২–৩ টেবিল চামচ'
          '\n\n\nপ্রনালি :-'
          '\n– প্যানে তেল গরম করে সব এক সাথে দিয়ে দিন ।'
      '\n– ঢাকনা দিয়ে দিন । সিদ্ধ হয়ে আসলে  ঢাকনা খুলে দিন ।'
      '\n– ভালো করে ভেজে নামিয়ে নিন ।'
          '\n\nরোল তৈরি করা :-'
          '\nআটা  বা ময়দা – ১/৪ কাপ'
     '\n পানি – পরিমান মত'
      '\nডিম – ২ টি'
      '\nটোস্টের গুঁড়া – ১ কাপ (খুব ভালো করে গুঁড়া করে নিবে'
          '\n\n প্রনালি :-'
          '\n– সব এক সাথে মিক্স করে স্টিকি ডো তৈরি করুন ।'
      '\n– অনেকটা আঠার মত হবে ।'
      '\n– এবার একটা করে রুটি নিয়ে রুটির চারদিকে এই স্টিকি ডো লাগিয়ে দিন ।'
     '\n – মাঝখানে পরিমান মত পুর দিয়ে  দুই সাইড ভালো করে লাগিয়ে দিন ।'
     '\n – পাশাপাশি দুই সাইড রোল করে দিন । শেষের  মাথা ভালো করে লাগিয়ে দিন।'
     '\n – এবার একটি করে রোল ডিমে ডুবিয়ে বিস্কুটের গুঁড়ায় গড়িয়ে নিন । আবারো  ডিমে ডুবিয়ে বিস্কুটের গুঁড়ায় ডুবিয়ে নিন ।'
      '\n– ২ বার  কোটিং দিলে সবচেয়ে ভালো হয় ।'
     '\n – গরম তেলে ছেড়ে মাঝারি আঁচে বাদামি কালার করে ভেজে নিন ।'
      '\n– খুব সাবধানে ভাজবেন । বিস্কুটের গুঁড়ার কারণে তাড়াতাড়ি পুড়ে যাবে । তাই মাঝারি আঁচের থেকে কম আঁচ দিয়ে ভাজুন ।',
      imageUrl: 'assets/nastaimages/vegetable_rool.jpg',

    ),
    brFood(
      id: 'p16',
      title: 'বেগুনি',
      description: 'উপকরণ:-'
          '\nনর ক্রিস্পি ফ্রাইড চিকেন মিক্স ১০ গ্রাম'
      '\nবেগুন স্লাইস করা ১৫০ গ্রাম'
      '\nময়দা ৫৪ গ্রাম'
      '\nপানি ২৪২.৫ মিলি'
    '\nতেলে ৫০০মিলি'
          '\n\n\nপ্রণালিঃ'
          '\nবেগুন ধুয়ে পাতলা স্লাইস করে নিন বেগুন স্লাইসের সাথে নর ক্রিস্পি ফ্রাইড চিকেন মিক্স (৪ গ্রাম) এবং পানি (২.৫ মিলি) ভালো করে মিশিয়ে '
          'মেরিনেট হতে দিন ৩০ মিনিটের জন্যে। একটি পাত্রে ময়দার সাথে নর ক্রিস্পি ফ্রাইড চিকেন মিক্স (৬ গ্রাম) '
          'এবং পানি (২৪০মিলি) গুলিয়ে নিন ৩০ মিনিটের জন্য রেখে দিন।'
          '\n৩০ মিনিট শেষ হলে  বেগুন স্লাইসগুলো লিকুইড ময়দার মিশ্রনে ডুবিয়ে গরম তেলে (৫০০মিলি) '
          'ডিপ ফ্রাই করুন। সোনালি রংয়ের হয়ে এলে গরম গরম পরিবেশন করুন।',
      imageUrl: 'assets/nastaimages/beguni.jpg',

    ),
    brFood(
      id: 'p17',
      title: 'ফুচকা',
      description: 'ফুচকা তৈরির রেসিপি:--'
          '\n\n\nউপকরণ:-'
          '\nফুচকা তৈরির জন্য লাগবে-  ময়দা ১/৪ কাপ। '
          'সুজি ১ কাপ। তেল ও পানি পরিমাণ মতো। তাল মাখনা ১ টেবিল চামচ। লবণ আধা চা-চামচ।'
          '\n\n\nফুচকার পুর তৈরির জন্য লাগবে'
          '\nসিদ্ধ ডাবলি ছোলা/ মটর দেড় কাপ। সিদ্ধ আলু এক কাপ। সিদ্ধ ডিম ১টি। পেঁয়াজ কুচি ২-৩ টেবিল-চামচ।'
          ' ধনেপাতা কুচি। কাচামরিচ কুচি। লবণ।'
          ' বিট লবণ। চাট মসলা। টালা শুকনা মরিচ। টালা জিরা গুঁড়া স্বাদ মতো।'
          '\nপদ্ধতি:--'
          '\nফুচকা তৈরির উপকরণগুলো ভালো করে মিশিয়ে ডো তৈরি করে নিন। ডো-টা বেশি শক্ত বা নরম হবে না।'
          '\nভেজা টিস্যু দিয়ে ১০ মিনিট ঢেকে রাখুন। এবার ডোটাকে কয়েক ভাগ করে মোটা রুটির মতো বেলে নিয়ে গোল '
          'আকারে কাটতে হবে।'
          '\nএবার ডুবো তেলে বাদামি করে ভেজে নিন।'
          '\nপুর তৈরির সব উপকরণ মিশিয়ে ফুচকার মাঝে ছিদ্র করে তাতে পুর ভরে তেঁতুলের টক দিয়ে পরিবেশন করুন।'
          '\n\n\nতেতুলের টক তৈরি'
          '\n১ কাপ পানিতে কিছু তেঁতুল ভিজিয়ে চটকিয়ে ক্বাথ তৈরি করে নিন। এবার এতে স্বাদ মতো লবণ, বিট লবণ, চিনি, লেবুর খোসা কুচি, লেবুর রস,'
          ' ভাজা জিড়া গুঁড়া ও মরিচ গুঁড়া দিয়ে মিশিয়ে নিন।',
      imageUrl: 'assets/nastaimages/fuchka.jpg',

    ),





  ];

  List<brFood> get items => _items;


// List<Food> get items {
  //   return [..._items];
  // }
// List<Food>get items => _items;
  brFood FindById(String id){

    return _items.firstWhere((prod) => prod.id==id);

  }
  void AddFood(brFood value){
    _items.add(value);

  }
}