import 'package:flutter/cupertino.dart';
import 'package:learn_to_cook/fish_curry/fc_Food.dart';

class fcFoods extends ChangeNotifier{
  List<fcFood> _items=[
    fcFood(
        id:'p1',
        title: 'চিংড়ি মাছের তরকারি ',
        description: 'ডাঁটা ও আলু দিয়ে চিংড়ি মাছের ঝোল--'
            '\n\n\nউপকরণ--'
            '\n ৪ জনের জন্য'
  '\n ৬০০ গ্রাম মাঝারি সাইজের বাগদা চিংড়ি'
  '\n ১ টি আলু (বড়)'
  '\n ২ টি কাটোয়ার ডাঁটা (নরম ডগার দিকটা)'
  '\n ১ টি পেঁয়াজ কুচোনো'
  '\n ১ টি পেঁয়াজ বাটা'
  '\n ১ চা চামচ লঙ্কা বাটা'
  '\n ১ চা চামচ জিরে গুঁড়ো'
  '\n ১/২ চা চামচ হলুদ গুঁড়ো'
  '\n ১ চিমটি গোটা জিরে (ফোড়নের জন্য)'
  '\n স্বাদমতো নুন'
  '\n ৩ টেবিল চামচ সঃ তেল'
  '\n পরিমাণ মতো জল'
            '\n\n\nধাপ:--'
            '\n\n1.প্রথমে মাছ ভালো করে ধুয়ে নিয়ে নুন ও একটু হলুদ মেখে ভেজে নিন। এবং আলু ও ডাঁটা একটু ভাঁপিয়ে নিন।'
            '\n2.এবার কড়াই আবার অল্প তেল দিন, একটু গরম হলে পেঁয়াজ ও গোটা জিরে ফোঁড়ন দিয়ে একটু ভাজতে হবে'
            '\n3.এবার পেঁয়াজ বাটা, লঙ্কা বাটা, দিয়ে আরো একটু ভেজে পেঁয়াজের কাঁচা গন্ধ চলে গেলে নুন, হলুদ, জিরে গুঁড়ো ও'
            ' সামান্য জল দিয়ে মশলা টা কষিয়ে ভাজা আলু ও ডাঁটা দিয়ে আরও একটু কষিয়ে নিন।'
            '\n4.এবার তেল বেরিয়ে এলে ঝোলের পরিমাণে জল দিয়ে দিন। জল খানিকটা ফুটে গেলে মাছ ভাজা মাছ গুলো দিয়ে গ্যাস সিম করে কিছুক্ষণ রেখে নামিয়ে দিন। তৈরি চিংড়ি ডাঁটার ঝোল।',
        imageUrl: 'assets/fishimages/chingdi_fish.webp'
    ),
    fcFood(
        id:'p2',
        title: 'গাজর দিয়ে মাছের তরকারি',
        description: 'উপকরণ:--'
            '\n 1জনের জন্য'
        '\n2 টুকরো কাতল মাছ'
   '\n 1 টি গাজর'
   '\n 1 টি আলু'
   ' \n5 চা চামচ তেল'
    '\n1/4 চা চামচ পাঁচ ফোড়ন'
    '\n1 চা চামচ নুন'
   '\n 1 চা চামচ আদা ও জিরে বাটা'
   '\n 1 চা চামচ পেঁয়াজ বাটা'
    '\n1/2 কাপ জল'
    '\n1 চা চামচ হলুদ গুঁড়ো'
    '\n2 টি কাঁচা লঙ্কা'
   ' \n1 টি তেজপাতা'
    '\nপ্রয়োজন মত ধনেপাতা'
            '\n\n\nধাপ--'
            '\n1.মাছ ধুয়ে নুন হলুদ মাখিয়ে ভেজে রাখুন। আলু গাজর কেটে রাখুন।'
            '\n2.কড়াইয়ে তেল দিয়ে পাঁচফোড়ন ও তেজপাতা দিন। কেটে রাখা আলু ও গাজর দিন।নুন,হলুদ পেয়াজ বাটা, জিরে ও আদা বাটা, লঙ্কা দিয়ে ভালো করে কষিয়ে জল দিন।'
            '\n3.সেদ্ধ হয়ে গেলে ধনে পাতা দিয়ে নামিয়ে নিন। গরম ভাতের সাথে পরিবেশন করুন।',
        imageUrl: 'assets/fishimages/gajor_fish.webp'
    ),
    fcFood(
        id:'p3',
        title: 'ইলিশ মাছের দোপেঁয়াজি',
        description: '\n\n\nউপকরণ:'
            '\nইলিশ মাছ – ৬ টুকরা'
  '\nপেঁয়াজ কুঁচি – ৩ টেবিল চামচ'
  '\nআদা বাটা – সিকি চা চামচ'
  '\nরসুন বাটা – আধা চা চামচ'
 ' \nকাঁচামরিচ – ৮-১০টি (আস্ত)'
  '\nহলুদ গুঁড়া – আধা চা চামচ'
  '\nজিরা গুঁড়া – আধা চা চামচ'
  '\nধনিয়া গুঁড়া – আধা চা চামচ'
  '\nসয়াবিন তেল – দেড় কাপ'
  '\nপানি – পরিমাণমত'
  '\nলবণ – স্বাদমতো'
            '\n\n\nপ্রস্তুত প্রণালী:--'
            '\n1.ফ্রাইপ্যানে তেল গরম করে পেঁয়াজ কুচি হালকা বাদামী করে ভেজে নিন।'
            '\n2.অতঃপর তাতে একে এক আদা , রসুন বাটা, হলুদ গুঁড়া, জিরা গুঁড়া, ধনিয়া গুঁড়া ও সামান্য পানি দিয়ে ভাল করে কষিয়ে নিন।'
            '\n3.এবার মাছের টুকরা গুলো দিয়ে ও সামান্য পানি দিয়ে আরও কিছুক্ষণ ঢেকে রান্না করুন।'
            '\n4.রান্না প্রায় হয়ে এলে আস্ত কাঁচামরিচ গুলো দিয়ে ২-৩ মিনিট রেখে নিন।'
            '\n5.তেল মসলার উপরে উঠে এলে নামিয়ে নিন।',
        imageUrl: 'assets/fishimages/hilsha_curry.webp'
    ),
    fcFood(
        id:'p4',
        title: 'কাতলা মৌরী',
        description: 'কাতলা মাছ রেসিপি:--'
            '\n\n\nউপকরণ:-'
            '\n২ টুকরো কাতলা মাছ'
        '\n১/২ চামচ মৌরী শুকনো খোলায় ভেজে গুড়ো করা'
    '\n১ টি শুকনো লঙ্কা'
    '\n১ টি তেজপাতা'
    '\n৩চা চামচ পেঁয়াজ বাটা'
    '\n১/২চা চামচ রসুন বাটা'
    '\n১/২ চামচ আদা বাটা'
    '\n২টেবিল চামচ টকদই'
    '\n১/২চা চামচ হলুদ গুঁড়ো'
    '\n১/২ চা চামচ লঙ্কার গুঁড়ো'
    '\n১/২ চা চামচ ধনে গুড়ো'
    '\nস্বাদমতো নুন'
    '\n১/৪ চা চামচ চিনি'
    '\n১/২্চা চামচ গরম মসলা গুড়ো'
    '\n২ টি কাঁচালঙ্কা'
    '\nপরিমাণমত তেল'
    '\n১চা চামচ ধনেপাতা কুচি'
    '\n১চা চামচ ঘি'
    '\nপরিমাণমত জল'
            '\n\n\nধাপ:--'
            '\n1. মাছগুলো ভালো করে ধুয়ে নুন হলুদ গুড়ো মাখিয়ে নিন ।'
            '\n2. এবার একটি কড়াইয়ে পরিমাণমত তেল গরম করে নিন ।'
            '\n3. গরম তেলে নুন হলুদ গুড়ো মাখিয়ে নেওয়া মাছগুলো দিয়ে ভেজে নিন এবং পাশে তুলে রাখুন।'
            '\n4. এবার ওই তেলেই ১ টি শুকনো লঙ্কা এবং ১ টি তেজপাতা ফোড়ন দিন ।'
            '\n5. এরপর ৩ চামচ পেঁয়াজ বাটা, ১/২ চামচ রসুন বাটা, ১/২ আদা বাটা, দিয়ে ভালো করে কষিয়ে নিন ।'
            '\n6. এবার একটি বাটিতে টকদই, হলুদ গুঁড়ো স্বাদমতো নুন, চিনি নিয়ে ভালো করে ফেটিয়ে কড়াইতে ঢেলে দিন ।'
            '\n7. এরপর লঙ্কার গুঁড়ো, ধনে গুঁড়ো দিয়ে মসলাটা আবারও ভালো করে কষিয়ে নিন ।'
            '\n8. যখন মসলাটা থেকে তেল ছেড়ে আসবে তখন পরিমাণমত জল দিন ।'
            '\n9. এবার ভাজা মৌরী গুঁড়ো এবং গরম মসলা গুঁড়ো দিয়ে জলটা ফুটে উঠলে ভেজে রাখা মাছ গুলো দিয়ে দিন ।'
            '\n10. কাঁচালঙ্কা দিয়ে কিছুক্ষণের জন্য ঢেকে দিন ।'
            '\n11. কিছুক্ষণ পর ঢাকা খুলে ১ চামচ ধনেপাতা কুচি এবং ১ চামচ ঘি ছড়িয়ে নামিয়ে নিন ।'
            '\n12. গরম ভাতের সাথে পরিবেশন করুন কাতলা মৌরী ।',
        imageUrl: 'assets/fishimages/katla.webp'
    ),
    fcFood(
        id:'p5',
        title: 'পেঁয়াজ কলি দিয়ে মাছের তরকারি',
        description: 'উপকরণ:--'
            '\n\n\n২ টুকরো কাতলা মাছ'
        '\n১০০গ্রাম পেঁয়াজ কলি কাটা'
        '\n১/২কাপ পেঁয়াজ কাটা'
    '\n২চা চামচ রসুন কুচি'
    '\n২টেবিল চামচ আদা বাটা'
    '\n১চা চামচ হলুদ গুঁড়া'
   '\n ২চা চামচ লঙ্কা গুঁড়া'
   '\n ২চা চামচ লঙ্কা বাটা'
    '\n১টেবিল চামচ ধনে গুঁড়া'
            '\n\n\nধাপ:--'
            '\n1.আগে মাছ ভেজে নিতে হবে ভালো করে ।'
            '\n2.কড়াই এ তেল দিয়ে তাতে শুকনো লঙ্কা ফোড়ন পেঁয়াজ কুচি ও রসুন বাটা দিয়ে নারতে হবে ।'
            '\n3.সব মশলা মিশিয়ে দিয়ে হালকা করে ভাজতে হবে ও সামান্য জল দিয়ে ফুটতে দিতে হবে ।'
            '\n4.নুন দিয়ে মাছ মিশিয়ে একটু নেরে নামিয়ে রাখতে হবে ও ভাত দিয়ে পরিবেশন করতে হবে ।',
        imageUrl: 'assets/fishimages/katla_fish_f.webp'
    ),
    fcFood(
        id:'p6',
        title: 'মাগুর মাছের ঝোল',
        description: 'মাগুর মাছের ঝোল'
            '\n\n\nউপকরণ:---'
            '\n ৫জন জন্য '
        '\n১০টি মাগুর মাছ'
       '\n ৪টি কাঁচালঙ্কা'
        '\nস্বাদ মতো নুন'
       ' \nসর্ষে তেল পরিমান মতো'
        '\n১চা চামচ কালজিরে'
        '\n১টেবিল চামচ হলুদ গুঁড়ো'
        '\n২টি আলু'
        '\n১টি কাঁচালঙ্কা'
        '\n১চা চামচ জিরে গুঁড়ো'
        '\n১/২চা চামচ লঙ্কার গুঁড়ো'
    '\n১/২ চা চামচ চিনি'
    '\n২টেবিল চামচ ধনেপাতা কুঁচি'
            '\n\n\nধাপ::--'
            '\n1.মাছগুলো নুন হলুদ মাখিয়ে ৫মিনিট রাখতে হবে।'
            '\n2.তারপর প্যান এ তেল গরম করে মাছ গুলো ভেঁজে তুলে রাখতে হবে।'
            '\n3.বাকি তেলে কালো জিরে ফোরণ দিতে হবে,কালো জিরে চড়চড় করে উঠল আলু আর কাঁচাকলা(লম্বা করে কাটা) দিয়ে একটু ভাজতে হবে।'
            '\n4.সাথে হলুদ-জিরে-লঙ্কার গুঁড়ো, নুন,চিনি দিয়ে কষতে হবে।'
            '\n5.জল দিতে হবে পরিমান মতো,জল ফুটতে আরম্ভ করলে ভেঁজে রাখা মাছগুলো দিয়ে দিতে হবে।'
            '\n6.সব সেদ্ধ হয়ে গেলে নিজের পছন্দ মতো ঝোল রেখে ধনেপাতা কুঁচি দিতে হবে,আর একটু সর্ষে তেল দিয়ে নামাতে হবে।',
        imageUrl: 'assets/fishimages/maghur_fish.webp'
    ),
    fcFood(
        id:'p7',
        title: 'পাবদা মাছের তেল ঝাল',
        description: 'পাবদা মাছের তেল ঝাল --'
            '\n\n\nউপকরণ--'
            '\n (2 জন)'
      ' \n  250 গ্রাম পাবদা মাছ'
    '\n 4-5 টা বেগুন লম্বা করে কাটা'
   '\n  1/2 কাপ টমাটো কুচি'
    '\n 3-4 টে কাচালঙ্কা'
   '\n  4 টেবিল চামচ সর্ষের তেল'
    '\n স্বাদ মত নুন'
    '\n 1 টেবিল চামচ হলুদ গুঁড়ো'
   ' \n 1/2 চা চামচ কালো জিরা'
    '\n 1 চা চামচ ধনেপাতা কুচি'
            '\n\n\nধাপ::--'
            '\n1.প্রথমে মাছে নুন হলুদ মাখিয়ে রাখতে হবে। কড়াইয়ে তেল গরম করে ওতে মাছ ভেজে তুলে রাখতে হবে।'
            '\n2.এর পর বেগুন ভেজে তুলে রাখতে হবে। ওই তেলে কালো জিরা, কাচালঙ্কা ফোড়ন দিয়ে টমাটো কুচি দিয়ে ভাজতে হবে।'
            '\n3.নুন ও হলুদ ও সামান্য জল দিয়ে ভাল করে নাড়তে হবে।'
            '\n4.এর পর জল দিয়ে মাছ ও বেগুন দিয়ে দিতে হবে। একটু ফুটে উঠলে ধনেপাতা কুচি ছরিয়ে গরম ভাতের সাথে পরিবেশন করতে হবে।',
        imageUrl: 'assets/fishimages/pubda_fish.webp'
    ),
    fcFood(
        id:'p8',
        title: 'ফুলকপি দিয়ে রুই মাছের ঝোল',
        description: 'ফুলকপি দিয়ে রুই মাছের ঝোল::--'
            '\n\n\nউপকরণ:--'
            '\n (৪ জন)'
        '\n৪ পিস রুই মাছ'
        '\nস্বাদ মতো নুন'
       '\n ১ চা চামচ হলুদ গুঁড়ো'
        '\n১চা চামচ লঙ্কার গুঁড়ো'
       ' \n২ চা চামচ জিরার গুঁড়ো'
        '\n১/২ চা চামচ ১/২ চা চামচ কালোজিরা'
    '\n১ টা টমেটো'
   '\n ১ টা আলু'
   '\n ১/২ ফুলকপি'
   ' \nপরিমান মতন জল'
    '\n১ চা চামচ আদা বাটা'
    '\n৬-৮ চা চামচ তেল'
    '\n৩ চা চামচ কুচনো ধোনে পাতা'
    '\n১/২ চা চামচ চিনি'
            '\n\n\nধাপ::--'
            '\n1. এটা বানাতে যা যা লাগছে সব নিয়ে নিলাম ।'
            '\n2.করাই এর মধ্যে তেল গরম করে মাছ গুলো নুন, হলুদ মাখিয়ে একটু লাল লাল ভাজা করে নিলাম ।'
            '\n3.তারপর সেই তেল এর মধ্যে কালোজিরা ফোড়ন দিলাম আর আলু আর কপি কেটে দিলাম আর ভাজা করে নেবো একটু ।'
            '\n4.কপি, আর আলু ভাজা হোলে তারমধ্যে কুচনো টমেটো দিলাম আর একটু নাড়াচাড়া করলাম । তারপর তারমধ্যে নুন, হলুদ,লঙ্কার গুঁড়ো, জিরার গুঁড়ো, আদা বাটা সব কিছু দিলাম ।'
            '\n5.কিছুক্ষণ মসলা কোষে নিলাম । তারপর অল্প করে জল দিয়ে ঢেকে দিলাম সব সেদ্ধ হবার জন্য ৭-৮ মিনিট ।'
            '\n6.তারপর প্রায় ৮ মিনিট পর ঢাকনা খুলে দেখছি কপি আর আলু সেদ্ধ হয়ে গেছে । তারপর তারমধ্যে ভাজা মাছ গুলো দিলাম ।'
            '\n7.আরও একটু জল দিলাম আর ২-৩ মিনিট ফুটিয়ে নিলাম ধনে পাতা কুচি দিলাম ।'
            '\n8.তাহলেই তৈরি হয়ে গেলো ফুলকপি দিয়ে রুই মাছের ঝোল । গরম গরম ভাত এর সাথে পরিবেশন করলাম ।',
        imageUrl: 'assets/fishimages/rui_fish.webp'
    ),
    fcFood(
        id:'p9',
        title: 'তেলাপিয়া মাছের পাতলা ঝোল',
        description: 'তেলাপিয়া মাছের পাতলা ঝোল::--'
            '\n\n\n(উপকরণ)>>>'
            '\n৩ টি তেলাপিয়া মাছ'
        '\n১ টি আলু'
        '\n১ টি ছোট ফুলকপি'
       '\n ১ টি টমেটো'
        '\n১ টি পিয়াজ'
       '\n ১ চামচ আদা রসুন বাটা'
       '\n ২ চামচ ধনে জিরে বাটা'
       '\n স্বাদমতো নুন'
       '\n ১ চামচ হলুদ'
       '\n ১ কাপ তেল'
       '\n ২ চামচ ধনে পাতা'
       '\n ১ চামচ জিরে'
        '\n১ চামচ লঙ্কাগুরো'
            '\n\n\nধাপ::--'
            '\n1.মাছে নুন,হলুদ মাখিয়ে তেলে ভেজে তুলে নিতে হবে।'
            '\n2.তেলে আলু,ফুলকপি টুকরো করে কেটে নুন,হলুদ দিয়ে ভেজে তুলে নিতে হবে।'
            '\n3.তেলে জিরে ফোড়ন দিয়ে পিয়াজ কুচি দিয়ে লাল করে ভেজে আদা রসুন বাটা দিয়ে ভাজতে হবে।'
            '\n4.টমেটো বাটা,নুন,হলুদ,ধনে জিরে বাটা,লঙ্কাগুরো দিয়ে ভাজতে হবে।'
            '\n5.মশলা কষা হলে সব্জি দিয়ে মিশিয়ে মাছ দিয়ে জল দিয়ে ঢেকে রান্না করতে হবে।'
            '\n6.ঝোল শুকিয়ে এলে ধনেপাতা দিয়ে নামিয়ে নিতে হবে।',
        imageUrl: 'assets/fishimages/telapia_fish.webp'
    ),
    fcFood(
        id:'p10',
        title: 'ট্যাংরা মাছের তেল ঝাল।',
        description: 'ট্যাংরা মাছের তেল ঝাল।::--'
            '\n\n\nউপকরণ:--'
            '\n (৪জন)'
       '\n ৩০০ গ্রাম ট্যাংরা মাছ কেটে ধুয়ে পরিষ্কার করে নুন হলুদ মাখিয়ে রাখা।'
       '\n ৩-৪ টে গোটা কাঁচা লঙ্কা'
   '\n ১ চা চামচ হলুদ গুঁড়ো'
    '\n৩ টেবিল চামচ সর্ষের তেল'
   '\n ১ টেবিল চামচ আদা রসুন বাটা'
    '\n২ টি বড় টমেটো মিহি করে কুচানো'
   '\n ১ চা চামচ ধনে গুঁড়ো'
   '\n ১/২ চা চামচ কালো জিরে'
   '\n ১ টেবিল চামচ কাশ্মীরি লঙ্কার গুঁড়ো'
    '\n১/২ চা চামচ লাল লঙ্কার গুঁড়ো'
    '\n১টেবিল চামচ ধনেপাতা কুচি'
    '\nস্বাদমতো লবণ'
            '\n\n\nধাপ::--'
            '\n1. কড়াইতে 2 টেবিল চামচ সর্ষের তেল দিয়ে, তেল ভালো করে গরম হবার পর আগে থেকে নুন হলুদ মাখিয়ে রাখা ট্যাংরা মাছ গুলোকে হালকা করে ভেজে নিতে হবে। মাছ ভাজার পর '
            'কড়াইতে আরও ১ টেবিল চামচ সর্ষের তেল দিয়ে, ওই তেল গরম হবার পর তাতে কালো জিরে ও গোটা কাঁচা লঙ্কা ফোড়ন দিতে হবে। সুগন্ধ বেরোলে কুচি করে কেটে রাখা টমেটো গুলোকে দিয়ে'
            ' দিতে হবে ও তেলের মধ্যে ভালো করে ভাজতে হবে। এর মধ্যে সামান্য লবণ দিতে হবে তবে টমেটো গুলি খুব তাড়াতাড়ি নরম হয়ে যাবে।'
            '\n2. টমেটো গুলি নরম হয়ে যাবার পরে, ওই তেলের মধ্যে এক এক করে হলুদ গুঁড়ো, লাল লঙ্কার গুঁড়ো, কাশ্মীরি লঙ্কার গুঁড়ো, আদা-রসুন বাটা ও ধনের গুড়ো দিতে হবে। '
            'এবার কড়াইতে ১ টেবিল চামচ জল দিয়ে সব মসলা গুলোকে ভাল করে ভাজতে হবে। ৩-৪ মিনিট ভাজার পর মসলা থেকে তেল বেরিয়ে আসলে তার মধ্যে আগে থেকে করে রাখা দেড় কাপ '
            'গরম জল ঢেলে দিতে হবে। এবার স্বাদমতো লবণ দিতে হবে। ঝোল ফুটে উঠলে এর মধ্যে ভেজে রাখা ট্যাংরা মাছ গুলোকে দিয়ে দিতে হবে। এবার কড়াইতে একটি ঢাকনা দিয়ে ঢেকে ঝোল '
            'সমেত মাছগুলোকে দু মিনিট ফুটতে দিতে হবে।'
            '\n3. মাছের ঝোল ফুটে উঠলে ধনেপাতা ছড়িয়ে নামিয়ে নিতে হবে। গরম ভাতের সাথে এই ট্যাংরা মাছের ঝাল পরিবেশন করতে হবে।'
            ' এই পুরো রান্না টাই মাঝারি তাপে করতে হবে তবেই রান্নাটি খুবই সুস্বাদু হবে।',
        imageUrl: 'assets/fishimages/tengra_fish.webp'
    ),




  ];

  List<fcFood> get items => _items;


// List<Food> get items {
  //   return [..._items];
  // }
// List<Food>get items => _items;
  fcFood FindById(String id){

    return _items.firstWhere((prod) => prod.id==id);

  }
  void AddFood(fcFood value){
    _items.add(value);

  }
}